Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/blog.po
Languages: fr, xd

source: Blog Blueprint
fr: *Blueprint* du blog

source: You'll use the same techniques you learned about when writing the authentication blueprint to write the blog blueprint. The blog should list all posts, allow logged in users to create posts, and allow the author of a post to edit or delete it.
fr: Vous utiliserez les mêmes techniques que celles que vous avez apprises lors de l'écriture du modèle d'authentification pour écrire le modèle du blog. Le blog doit lister tous les messages, permettre aux utilisateurs connectés de créer des messages et permettre à l'auteur d'un message de le modifier ou de le supprimer.
xd: Utilizarás las mismas técnicas que aprendiste al escribir el Blueprint de autenticación para escribir el Blueprint del blog. El blog debe listar todas las entradas, permitir a los usuarios registrados crear entradas, y permitir al autor de una entrada editarla o eliminarla.

source: As you implement each view, keep the development server running. As you save your changes, try going to the URL in your browser and testing them out.
fr: À mesure que vous implémentez chaque vue, laissez le serveur de développement fonctionner. Lorsque vous enregistrez vos modifications, essayez d'aller à l'URL dans votre navigateur et de les tester.
xd: A medida que implementes cada vista, mantén el servidor de desarrollo en funcionamiento. A medida que guarde los cambios, intente ir a la URL en su navegador y probarlos.

source: The Blueprint
fr: Le *blueprint*
xd: El Blueprint

source: Define the blueprint and register it in the application factory.
fr: Définir le *blueprint* et l'enregistrer dans la fabrique d'applications.
xd: Define el blueprint y regístralo en la fábrica de aplicaciones.

source: Import and register the blueprint from the factory using :meth:`app.register_blueprint() <Flask.register_blueprint>`. Place the new code at the end of the factory function before returning the app.
fr: Importez et enregistrez le *blueprint* depuis la fabrique en utilisant :meth:`app.register_blueprint() <Flask.register_blueprint>`. Placez le nouveau code à la fin de la fonction de la fabrique avant de retourner l'application.
xd: Importa y registra el blueprint de la fábrica usando :meth:`app.register_blueprint() <Flask.register_blueprint>`. Coloca el nuevo código al final de la función de fábrica antes de devolver la app.

source: Unlike the auth blueprint, the blog blueprint does not have a ``url_prefix``. So the ``index`` view will be at ``/``, the ``create`` view at ``/create``, and so on. The blog is the main feature of Flaskr, so it makes sense that the blog index will be the main index.
fr: Contrairement au *blueprint* pour l'authentification, le *blueprint* du blog n'a pas d\'``url_prefix``. Donc la vue ``index`` sera à ``/``, la vue ``create`` à ``/create``, et ainsi de suite. Le blog est la fonctionnalité principale de Flaskr, il est donc logique que l'index du blog soit l'index principal.
xd: A diferencia del plano de autenticidad, el blueprint del blog no tiene una ``url_prefix``. Así que la vista ``index`` estará en ``/``, la vista ``create`` en ``/create``, y así sucesivamente. El blog es la característica principal de Flaskr, así que tiene sentido que el índice del blog sea el índice principal.

source: However, the endpoint for the ``index`` view defined below will be ``blog.index``. Some of the authentication views referred to a plain ``index`` endpoint. :meth:`app.add_url_rule() <Flask.add_url_rule>` associates the endpoint name ``'index'`` with the ``/`` url so that ``url_for('index')`` or ``url_for('blog.index')`` will both work, generating the same ``/`` URL either way.
fr: Cependant, le point de terminaison pour la vue ``index`` définie ci-dessous sera ``blog.index``. Certaines vues d'authentification se référaient à un point de terminaison ``index`` simple. :meth:`app.add_url_rule() <Flask.add_url_rule>` associe le nom du point de terminaison ``'index'`` à l'url ``/`` de sorte que ``url_for('index')`` ou ``url_for('blog.index')`` fonctionneront tous les deux, générant la même URL ``/`` dans les deux cas.
xd: Sin embargo, el endpoint para la vista ``index`` definida a continuación será ``blog.index``. Algunas de las vistas de autenticación hacían referencia a un punto final simple ``index``. :meth:`app.add_url_rule() <Flask.add_url_rule>` asocia el nombre del punto final ``'index`` con la url ``/`` para que ``url_for('index')`` o ``url_for('blog.index')`` funcionen ambos, generando la misma URL ``/`` de cualquier manera.

source: In another application you might give the blog blueprint a ``url_prefix`` and define a separate ``index`` view in the application factory, similar to the ``hello`` view. Then the ``index`` and ``blog.index`` endpoints and URLs would be different.
fr: Dans une autre application, vous pourriez donner au *blueprint* du blog un ``url_prefix`` et définir une vue ``index`` distincte dans la fabrique d'application, similaire à la vue ``hello``. Les URLs et les points de terminaison ``index`` et ``blog.index`` seraient alors différents.
xd: En otra aplicación podrías dar al blueprint del blog un ``url_prefix`` y definir una vista ``index`` separada en la fábrica de la aplicación, similar a la vista ``hello``. Entonces los endpoints y las URL de ``index`` y ``blog.index`` serían diferentes.

source: The index will show all of the posts, most recent first. A ``JOIN`` is used so that the author information from the ``user`` table is available in the result.
fr: L'index montrera tous les messages, les plus récents en premier. Un ``JOIN`` est utilisé pour que les informations sur l'auteur provenant de la table ``user`` soient disponibles dans le résultat.
xd: El índice mostrará todos los mensajes, el más reciente primero. Se utiliza un ``JOIN`` para que la información del autor de la tabla ``user`` esté disponible en el resultado.

source: When a user is logged in, the ``header`` block adds a link to the ``create`` view. When the user is the author of a post, they'll see an "Edit" link to the ``update`` view for that post. ``loop.last`` is a special variable available inside `Jinja for loops`_. It's used to display a line after each post except the last one, to visually separate them.
fr: Lorsqu'un utilisateur est connecté, le bloc ``header`` ajoute un lien vers la vue ``create``. Lorsque l'utilisateur est l'auteur d'un message, il verra un lien "Editer" vers la vue ``update`` de ce message. ``loop.last`` est une variable spéciale disponible dans `Jinja for loops`_. Elle est utilisée pour afficher une ligne après chaque message, sauf le dernier, afin de les séparer visuellement.
xd: Cuando un usuario está conectado, el bloque ``header`` añade un enlace a la vista ``create``. Cuando el usuario es el autor de una entrada, verá un enlace "Edit" a la vista ``update`` para esa entrada. ``loop.last`` es una variable especial disponible dentro de `Jinja para bucles`_. Se utiliza para mostrar una línea después de cada entrada excepto la última, para separarlas visualmente.

source: Create
fr: Créer
xd: Crear

source: The ``create`` view works the same as the auth ``register`` view. Either the form is displayed, or the posted data is validated and the post is added to the database or an error is shown.
fr: La vue ``create`` fonctionne de la même manière que la vue ``register`` d'authentification. Soit le formulaire est affiché, soit les données postées sont validées et le message est ajouté à la base de données, soit une erreur est affichée.
xd: La vista ``create`` funciona igual que la vista auth ``register``. O bien se muestra el formulario, o bien se validan los datos publicados y se añaden a la base de datos o se muestra un error.

source: The ``login_required`` decorator you wrote earlier is used on the blog views. A user must be logged in to visit these views, otherwise they will be redirected to the login page.
fr: Le décorateur ``login_required`` que vous avez écrit plus tôt est utilisé sur les vues du blog. Un utilisateur doit être connecté pour visiter ces vues, sinon il sera redirigé vers la page de connexion.
xd: El decorador ``login_required`` que escribiste antes se utiliza en las vistas del blog. Un usuario debe estar conectado para visitar estas vistas, de lo contrario será redirigido a la página de inicio de sesión.

source: Update
fr: Mise à jour
xd: Actualización

source: Both the ``update`` and ``delete`` views will need to fetch a ``post`` by ``id`` and check if the author matches the logged in user. To avoid duplicating code, you can write a function to get the ``post`` and call it from each view.
fr: Les vues ``update`` et ``delete`` devront toutes deux récupérer un ``post`` par ``id`` et vérifier si l'auteur correspond à l'utilisateur connecté. Pour éviter de dupliquer le code, vous pouvez écrire une fonction pour récupérer le ``post`` et l'appeler depuis chaque vue.
xd: Tanto la vista ``update`` como la vista ``delete`` necesitarán obtener un ``post`` por ``id`` y comprobar si el autor coincide con el usuario conectado. Para evitar duplicar el código, puedes escribir una función para obtener el ``post`` y llamarla desde cada vista.

source: :func:`abort` will raise a special exception that returns an HTTP status code. It takes an optional message to show with the error, otherwise a default message is used. ``404`` means "Not Found", and ``403`` means "Forbidden". (``401`` means "Unauthorized", but you redirect to the login page instead of returning that status.)
fr: :func:`abort` lèvera une exception spéciale qui renverra un code d'état HTTP. Il prend un message optionnel à afficher avec l'erreur, sinon un message par défaut est utilisé. ``404`` signifie "Not Found", et ``403`` signifie "Forbidden". (``401`` signifie "Non autorisé", mais vous redirigez vers la page de connexion au lieu de renvoyer ce statut).
xd: :func:`abort` lanzará una excepción especial que devuelve un código de estado HTTP. Toma un mensaje opcional para mostrar con el error, de lo contrario se utiliza un mensaje por defecto. ``404`` significa "Not Found", y ``403`` significa "Forbidden". (``401`` significa "Unauthorized", pero redirige a la página de acceso en lugar de devolver ese estado).

source: The ``check_author`` argument is defined so that the function can be used to get a ``post`` without checking the author. This would be useful if you wrote a view to show an individual post on a page, where the user doesn't matter because they're not modifying the post.
fr: L'argument ``check_author`` est défini pour que la fonction puisse être utilisée pour obtenir un ``post`` sans vérifier l'auteur. Ce serait utile si vous écriviez une vue pour montrer un article individuel sur une page, où l'utilisateur n'a pas d'importance parce qu'il ne modifie pas l'article.
xd: El argumento ``check_author`` se define para que la función pueda ser utilizada para obtener un ``post`` sin comprobar el autor. Esto sería útil si escribes una vista para mostrar un post individual en una página, donde el usuario no importa porque no está modificando el post.

source: Unlike the views you've written so far, the ``update`` function takes an argument, ``id``. That corresponds to the ``<int:id>`` in the route. A real URL will look like ``/1/update``. Flask will capture the ``1``, ensure it's an :class:`int`, and pass it as the ``id`` argument. If you don't specify ``int:`` and instead do ``<id>``, it will be a string. To generate a URL to the update page, :func:`url_for` needs to be passed the ``id`` so it knows what to fill in: ``url_for('blog.update', id=post['id'])``. This is also in the ``index.html`` file above.
fr: Contrairement aux vues que vous avez écrites jusqu'à présent, la fonction ``update`` prend un argument, ``id``. Cela correspond au ``<int:id>`` dans l'URL. Une vraie URL ressemblera à ``/1/update``. Flask va capturer le ``1``, s'assurer que c'est un :class:`int`, et le passer comme argument ``id``. Si vous ne spécifiez pas ``int:`` et faites plutôt ``<id>``, ce sera une chaîne de caractères. Pour générer une URL vers la page pour mettre à jour, il faut fournir à :func:`url_for` l'argument ``id`` pour qu'il sache quoi remplir : ``url_for('blog.update', id=post['id'])``. Ceci est également dans le fichier ``index.html`` ci-dessus.
xd: A diferencia de las vistas que has escrito hasta ahora, la función ``update`` toma un argumento, ``id``. Este corresponde al ``<int:id>` de la ruta. Una URL real será como ``/1/update``. Flask capturará el ``1``, se asegurará de que es un :class:`int`, y lo pasará como el argumento ``id``. Si no especificas ``int:`` y en su lugar haces ``<id>``, será una cadena. Para generar una URL a la página de actualización, a :func:`url_for` hay que pasarle el ``id`` para que sepa qué rellenar: ``url_for('blog.update', id=post['id'])``. Esto también está en el archivo ``index.html`` de arriba.

source: The ``create`` and ``update`` views look very similar. The main difference is that the ``update`` view uses a ``post`` object and an ``UPDATE`` query instead of an ``INSERT``. With some clever refactoring, you could use one view and template for both actions, but for the tutorial it's clearer to keep them separate.
fr: Les vues ``create`` et ``update`` sont très similaires. La principale différence est que la vue ``update`` utilise un objet ``post`` et une requête ``UPDATE`` au lieu d'une ``INSERT``. Avec une refactorisation intelligente, vous pourriez utiliser une vue et un modèle pour les deux actions, mais pour le tutoriel, il est plus clair de les garder séparés.
xd: Las vistas ``create`` y ``update`` son muy similares. La principal diferencia es que la vista ``update`` utiliza un objeto ``post`` y una consulta ``UPDATE`` en lugar de un ``INSERT``. Con un poco de refactorización inteligente, podrías usar una vista y una plantilla para ambas acciones, pero para el tutorial es más claro mantenerlas separadas.

source: This template has two forms. The first posts the edited data to the current page (``/<id>/update``). The other form contains only a button and specifies an ``action`` attribute that posts to the delete view instead. The button uses some JavaScript to show a confirmation dialog before submitting.
fr: Ce modèle a deux formes. Le premier affiche les données modifiées sur la page actuelle (``/<id>/update``). L'autre formulaire ne contient qu'un bouton et spécifie un attribut ``action`` qui affiche la vue de suppression à la place. Le bouton utilise du JavaScript pour afficher une boîte de dialogue de confirmation avant l'envoi.
xd: Esta plantilla tiene dos formas. El primero publica los datos editados en la página actual (``/<id>/update``). El otro formulario contiene sólo un botón y especifica un atributo ``action`` que envía a la vista de borrado. El botón utiliza algo de JavaScript para mostrar un diálogo de confirmación antes de enviarlo.

source: The pattern ``{{ request.form['title'] or post['title'] }}`` is used to choose what data appears in the form. When the form hasn't been submitted, the original ``post`` data appears, but if invalid form data was posted you want to display that so the user can fix the error, so ``request.form`` is used instead. :data:`request` is another variable that's automatically available in templates.
fr: Le motif ``{{ request.form['title'] or post['title'] }}`` est utilisé pour choisir les données qui apparaissent dans le formulaire. Lorsque le formulaire n'a pas été soumis, les données originales ``post`` apparaissent, mais si des données de formulaire invalides ont été postées, vous voulez les afficher pour que l'utilisateur puisse corriger l'erreur, donc ``request.form`` est utilisé à la place. :data:`request` est une autre variable qui est automatiquement disponible dans les modèles.
xd: El patrón ``{{ request.form['title'] o post['title'] }}` se utiliza para elegir qué datos aparecen en el formulario. Cuando el formulario no se ha enviado, aparecen los datos originales de ``post``, pero si se han publicado datos de formulario no válidos, se desea mostrarlos para que el usuario pueda solucionar el error, por lo que se utiliza ``request.form`` en su lugar. :data:`request` es otra variable que está disponible automáticamente en las plantillas.

source: Delete
fr: Supprimer
xd: Borrar

source: The delete view doesn't have its own template, the delete button is part of ``update.html`` and posts to the ``/<id>/delete`` URL. Since there is no template, it will only handle the ``POST`` method and then redirect to the ``index`` view.
fr: La vue de suppression n'a pas son propre modèle, le bouton de suppression fait partie de ``update.html`` et renvoie à l'URL ``/<id>/delete``. Puisqu'il n'y a pas de modèle, il ne traitera que la méthode ``POST`` et redirigera ensuite vers la vue ``index``.
xd: La vista de borrado no tiene su propia plantilla, el botón de borrado es parte de ``update.html`` y publica en la URL ``/<id>/delete``. Como no hay plantilla, sólo manejará el método ``POST`` y luego redirigirá a la vista ``index``.

source: Congratulations, you've now finished writing your application! Take some time to try out everything in the browser. However, there's still more to do before the project is complete.
fr: Félicitations, vous avez maintenant fini d'écrire votre application ! Prenez le temps de tout essayer dans le navigateur. Cependant, il reste encore beaucoup à faire avant que le projet ne soit complet.
xd: Enhorabuena, ya has terminado de escribir tu aplicación. Tómate un tiempo para probarlo todo en el navegador. Sin embargo, todavía hay más cosas que hacer antes de que el proyecto esté completo.

source: Continue to :doc:`install`.
fr: Passez à :doc:`install`.
xd: Continúa con :doc:`install`.

source: Index
xd: Índice
