Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/database.po
Languages: xd

source: Define and Access the Database
xd: Definir y acceder a la base de datos

source: The application will use a `SQLite`_ database to store users and posts. Python comes with built-in support for SQLite in the :mod:`sqlite3` module.
xd: La aplicación utilizará una base de datos `SQLite`_ para almacenar los usuarios y los mensajes. Python viene con soporte incorporado para SQLite en el módulo :mod:`sqlite3`.

source: SQLite is convenient because it doesn't require setting up a separate database server and is built-in to Python. However, if concurrent requests try to write to the database at the same time, they will slow down as each write happens sequentially. Small applications won't notice this. Once you become big, you may want to switch to a different database.
xd: SQLite es conveniente porque no requiere configurar un servidor de base de datos separado y está incorporado a Python. Sin embargo, si las solicitudes concurrentes intentan escribir en la base de datos al mismo tiempo, se ralentizarán ya que cada escritura se produce de forma secuencial. Las aplicaciones pequeñas no notarán esto. Una vez que se convierta en grande, es posible que desee cambiar a una base de datos diferente.

source: The tutorial doesn't go into detail about SQL. If you are not familiar with it, the SQLite docs describe the `language`_.
xd: El tutorial no entra en detalles sobre SQL. Si no estás familiarizado con él, los documentos de SQLite describen el `lenguaje`_.

source: Connect to the Database
xd: Conectar con la base de datos

source: The first thing to do when working with a SQLite database (and most other Python database libraries) is to create a connection to it. Any queries and operations are performed using the connection, which is closed after the work is finished.
xd: Lo primero que hay que hacer cuando se trabaja con una base de datos SQLite (y con la mayoría de las bibliotecas de bases de datos de Python) es crear una conexión a la misma. Todas las consultas y operaciones se realizan utilizando la conexión, que se cierra una vez finalizado el trabajo.

source: In web applications this connection is typically tied to the request. It is created at some point when handling a request, and closed before the response is sent.
xd: En las aplicaciones web esta conexión suele estar ligada a la petición. Se crea en algún momento cuando se maneja una solicitud, y se cierra antes de que se envíe la respuesta.

source: :data:`g` is a special object that is unique for each request. It is used to store data that might be accessed by multiple functions during the request. The connection is stored and reused instead of creating a new connection if ``get_db`` is called a second time in the same request.
xd: :data:`g` es un objeto especial que es único para cada solicitud. Se utiliza para almacenar datos a los que podrían acceder varias funciones durante la petición. La conexión se almacena y se reutiliza en lugar de crear una nueva conexión si se llama a ``get_db`` por segunda vez en la misma petición.

source: :data:`current_app` is another special object that points to the Flask application handling the request. Since you used an application factory, there is no application object when writing the rest of your code. ``get_db`` will be called when the application has been created and is handling a request, so :data:`current_app` can be used.
xd: :data:`current_app` es otro objeto especial que apunta a la aplicación Flask que maneja la solicitud. Como has utilizado una fábrica de aplicaciones, no hay ningún objeto de aplicación cuando escribes el resto de tu código. La llamada a ``get_db`` se realizará cuando la aplicación haya sido creada y esté gestionando una petición, por lo que se puede utilizar :data:`current_app`.

source: :func:`sqlite3.connect` establishes a connection to the file pointed at by the ``DATABASE`` configuration key. This file doesn't have to exist yet, and won't until you initialize the database later.
xd: :func:`sqlite3.connect` establece una conexión con el fichero apuntado por la clave de configuración ``DATABASE``. Este archivo no tiene que existir todavía, y no lo hará hasta que se inicialice la base de datos más tarde.

source: :class:`sqlite3.Row` tells the connection to return rows that behave like dicts. This allows accessing the columns by name.
xd: :class:`sqlite3.Row` indica a la conexión que devuelva filas que se comporten como dicts. Esto permite acceder a las columnas por su nombre.

source: ``close_db`` checks if a connection was created by checking if ``g.db`` was set. If the connection exists, it is closed. Further down you will tell your application about the ``close_db`` function in the application factory so that it is called after each request.
xd: ``close_db`` comprueba si se ha creado una conexión comprobando si se ha establecido ``g.db``. Si la conexión existe, se cierra. Más adelante le dirás a tu aplicación sobre la función ``close_db`` en la fábrica de la aplicación para que sea llamada después de cada petición.

source: Create the Tables
xd: Crear las tablas

source: In SQLite, data is stored in *tables* and *columns*. These need to be created before you can store and retrieve data. Flaskr will store users in the ``user`` table, and posts in the ``post`` table. Create a file with the SQL commands needed to create empty tables:
xd: En SQLite, los datos se almacenan en *tablas* y *columnas*. Estas deben ser creadas antes de poder almacenar y recuperar los datos. Flaskr almacenará los usuarios en la tabla ``user``, y las entradas en la tabla ``post``. Crea un archivo con los comandos SQL necesarios para crear tablas vacías:

source: Add the Python functions that will run these SQL commands to the ``db.py`` file:
xd: Añade las funciones de Python que ejecutarán estos comandos SQL al archivo ``db.py``:

source: :meth:`open_resource() <Flask.open_resource>` opens a file relative to the ``flaskr`` package, which is useful since you won't necessarily know where that location is when deploying the application later. ``get_db`` returns a database connection, which is used to execute the commands read from the file.
xd: :meth:`open_resource() <Flask.open_resource>` abre un archivo relativo al paquete ``flaskr``, lo cual es útil ya que no necesariamente se sabrá dónde está esa ubicación cuando se despliegue la aplicación posteriormente. ``get_db`` devuelve una conexión a la base de datos, que se utiliza para ejecutar los comandos leídos del archivo.

source: :func:`click.command` defines a command line command called ``init-db`` that calls the ``init_db`` function and shows a success message to the user. You can read :doc:`/cli` to learn more about writing commands.
xd: :func:`click.command` define un comando de línea de comandos llamado ``init-db`` que llama a la función ``init_db`` y muestra un mensaje de éxito al usuario. Puedes leer :doc:`/cli` para aprender más sobre la escritura de comandos.

source: Register with the Application
xd: Regístrese con la aplicación

source: The ``close_db`` and ``init_db_command`` functions need to be registered with the application instance; otherwise, they won't be used by the application. However, since you're using a factory function, that instance isn't available when writing the functions. Instead, write a function that takes an application and does the registration.
xd: Las funciones ``close_db`` y ``init_db_command`` necesitan ser registradas con la instancia de la aplicación; de lo contrario, no serán utilizadas por la aplicación. Sin embargo, como estás usando una función de fábrica, esa instancia no está disponible cuando escribes las funciones. En su lugar, escribe una función que tome una aplicación y haga el registro.

source: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` tells Flask to call that function when cleaning up after returning the response.
xd: :meth:`app.teardown_appcontext() <Flask.teardown_appcontext>` le dice a Flask que llame a esa función cuando se limpie después de devolver la respuesta.

source: :meth:`app.cli.add_command() <click.Group.add_command>` adds a new command that can be called with the ``flask`` command.
xd: :meth:`app.cli.add_command() <click.Group.add_command>` añade un nuevo comando que puede ser llamado con el comando ``flask``.

source: Import and call this function from the factory. Place the new code at the end of the factory function before returning the app.
xd: Importa y llama a esta función desde la fábrica. Coloca el nuevo código al final de la función de fábrica antes de devolver la aplicación.

source: Initialize the Database File
xd: Inicializar el archivo de la base de datos

source: Now that ``init-db`` has been registered with the app, it can be called using the ``flask`` command, similar to the ``run`` command from the previous page.
xd: Ahora que ``init-db`` ha sido registrado con la aplicación, puede ser llamado usando el comando ``flask``, similar al comando ``run`` de la página anterior.

source: If you're still running the server from the previous page, you can either stop the server, or run this command in a new terminal. If you use a new terminal, remember to change to your project directory and activate the env as described in :doc:`/installation`. You'll also need to set ``FLASK_APP`` and ``FLASK_ENV`` as shown on the previous page.
xd: Si todavía está ejecutando el servidor de la página anterior, puede detener el servidor o ejecutar este comando en un nuevo terminal. Si usas un nuevo terminal, recuerda cambiar al directorio de tu proyecto y activar la env como se describe en :doc:`/installation`. También necesitarás configurar ``FLASK_APP`` y ``FLASK_ENV`` como se muestra en la página anterior.

source: Run the ``init-db`` command:
xd: Ejecuta el comando ``init-db``:

source: There will now be a ``flaskr.sqlite`` file in the ``instance`` folder in your project.
xd: Ahora habrá un archivo ``flaskr.sqlite`` en la carpeta ``instance`` de tu proyecto.

source: Continue to :doc:`views`.
xd: Continúa con :doc:`views`.
