Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/index.po
Languages: fr

source: Contents:
fr: Contenu :

source: Tutorial
fr: Tutoriel

source: This tutorial will walk you through creating a basic blog application called Flaskr. Users will be able to register, log in, create posts, and edit or delete their own posts. You will be able to package and install the application on other computers.
fr: Ce tutoriel vous guidera dans la création d'une application de blog de base appelée Flaskr. Les utilisateurs pourront s'inscrire, se connecter, créer des messages, et modifier ou supprimer leurs propres messages. Vous serez en mesure d'emballer et d'installer l'application sur d'autres ordinateurs.

source: screenshot of index page
fr: capture d'écran de la page d'index

source: It's assumed that you're already familiar with Python. The `official tutorial`_ in the Python docs is a great way to learn or review first.
fr: Il est supposé que vous êtes déjà familier avec Python. Le `tutoriel officiel`_ dans les docs Python est un excellent moyen d'apprendre ou de réviser d'abord.

source: While it's designed to give a good starting point, the tutorial doesn't cover all of Flask's features. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to find out more. The tutorial only uses what's provided by Flask and Python. In another project, you might decide to use :doc:`/extensions` or other libraries to make some tasks simpler.
fr: Bien qu'il soit conçu pour donner un bon point de départ, le tutoriel ne couvre pas toutes les fonctionnalités de Flask. Consultez la section :doc:`/quickstart` pour avoir un aperçu de ce que Flask peut faire, puis plongez dans la documentation pour en savoir plus. Le tutoriel utilise uniquement ce qui est fourni par Flask et Python. Dans un autre projet, vous pourriez décider d'utiliser des :doc:`/extensions` ou d'autres bibliothèques pour simplifier certaines tâches.

source: screenshot of login page
fr: capture d'écran de la page de connexion

source: Flask is flexible. It doesn't require you to use any particular project or code layout. However, when first starting, it's helpful to use a more structured approach. This means that the tutorial will require a bit of boilerplate up front, but it's done to avoid many common pitfalls that new developers encounter, and it creates a project that's easy to expand on. Once you become more comfortable with Flask, you can step out of this structure and take full advantage of Flask's flexibility.
fr: Flask est flexible. Il ne vous oblige pas à utiliser un projet ou une disposition de code particuliers. Cependant, au début, il est utile d'utiliser une approche plus structurée. Cela signifie que le tutoriel nécessitera un peu de code passe-partout au départ, mais cela permet d'éviter de nombreux pièges courants que rencontrent les nouveaux développeurs et de créer un projet facile à développer. Lorsque vous serez plus à l'aise avec Flask, vous pourrez sortir de cette structure et profiter pleinement de la flexibilité de Flask.

source: screenshot of edit page
fr: capture d'écran de la page d'édition

source: :gh:`The tutorial project is available as an example in the Flask repository <examples/tutorial>`, if you want to compare your project with the final product as you follow the tutorial.
fr: :gh:`Le projet tutoriel est disponible en tant qu'exemple dans le dépôt Flask <examples/tutorial>`, si vous voulez comparer votre projet avec le produit final en suivant le tutoriel.

source: Continue to :doc:`layout`.
fr: Passez à :doc:`layout`.
