Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/install.po
Languages: xd

source: Make the Project Installable
xd: Hacer que el proyecto sea instalable

source: Making your project installable means that you can build a *distribution* file and install that in another environment, just like you installed Flask in your project's environment. This makes deploying your project the same as installing any other library, so you're using all the standard Python tools to manage everything.
xd: Hacer que tu proyecto sea instalable significa que puedes construir un archivo de *distribución* e instalarlo en otro entorno, al igual que has instalado Flask en el entorno de tu proyecto. Esto hace que el despliegue de su proyecto sea igual que la instalación de cualquier otra biblioteca, por lo que está utilizando todas las herramientas estándar de Python para gestionar todo.

source: Installing also comes with other benefits that might not be obvious from the tutorial or as a new Python user, including:
xd: La instalación también viene con otros beneficios que podrían no ser obvios desde el tutorial o como un nuevo usuario de Python, incluyendo:

source: Currently, Python and Flask understand how to use the ``flaskr`` package only because you're running from your project's directory. Installing means you can import it no matter where you run from.
xd: Actualmente, Python y Flask entienden cómo usar el paquete ``flaskr`` sólo porque lo ejecutas desde el directorio de tu proyecto. Instalarlo significa que puedes importarlo sin importar desde dónde lo ejecutes.

source: You can manage your project's dependencies just like other packages do, so ``pip install yourproject.whl`` installs them.
xd: Puedes gestionar las dependencias de tu proyecto igual que otros paquetes, así que ``pip install tuproyecto.whl`` las instala.

source: Test tools can isolate your test environment from your development environment.
xd: Las herramientas de prueba pueden aislar el entorno de prueba del entorno de desarrollo.

source: This is being introduced late in the tutorial, but in your future projects you should always start with this.
xd: Esto se está introduciendo tarde en el tutorial, pero en tus futuros proyectos deberías empezar siempre con esto.

source: Describe the Project
xd: Describa el proyecto

source: The ``setup.py`` file describes your project and the files that belong to it.
xd: El archivo ``setup.py`` describe tu proyecto y los archivos que le pertenecen.

source: ``packages`` tells Python what package directories (and the Python files they contain) to include. ``find_packages()`` finds these directories automatically so you don't have to type them out. To include other files, such as the static and templates directories, ``include_package_data`` is set. Python needs another file named ``MANIFEST.in`` to tell what this other data is.
xd: ``packages`` le dice a Python qué directorios de paquetes (y los archivos de Python que contienen) debe incluir. ``find_packages()`` encuentra estos directorios automáticamente para que no tengas que escribirlos. Para incluir otros archivos, como los directorios static y templates, se establece ``include_package_data``. Python necesita otro archivo llamado ``MANIFEST.in`` para decir cuáles son estos otros datos.

source: This tells Python to copy everything in the ``static`` and ``templates`` directories, and the ``schema.sql`` file, but to exclude all bytecode files.
xd: Esto le dice a Python que copie todo en los directorios ``static`` y ``templates``, y el archivo ``schema.sql``, pero que excluya todos los archivos del tipo ``bytecode``.

source: See the official `Packaging tutorial <packaging tutorial_>`_ and `detailed guide <packaging guide_>`_ for more explanation of the files and options used.
xd: Consulte el `tutorial oficial de empaquetado <packaging tutorial_>`_ y la `guía detallada <packaging guide_>`_ para obtener más explicaciones sobre los archivos y las opciones utilizadas.

source: Install the Project
xd: Instalar el proyecto

source: Use ``pip`` to install your project in the virtual environment.
xd: Utilice ``pip`` para instalar su proyecto en el entorno virtual.

source: This tells pip to find ``setup.py`` in the current directory and install it in *editable* or *development* mode. Editable mode means that as you make changes to your local code, you'll only need to re-install if you change the metadata about the project, such as its dependencies.
xd: Esto le dice a pip que encuentre ``setup.py`` en el directorio actual y lo instale en modo *editable* o *desarrollo*. El modo editable significa que a medida que se realicen cambios en el código local, sólo será necesario reinstalar si se cambian los metadatos del proyecto, como sus dependencias.

source: You can observe that the project is now installed with ``pip list``.
xd: Se puede observar que el proyecto se instala ahora con ``pip list``.

source: Nothing changes from how you've been running your project so far. ``--app`` is still set to ``flaskr`` and ``flask run`` still runs the application, but you can call it from anywhere, not just the ``flask-tutorial`` directory.
xd: Nada cambia de cómo has estado ejecutando tu proyecto hasta ahora. ``--app`` sigue siendo ``flaskr`` y ``flask run`` sigue ejecutando la aplicación, pero puedes llamarla desde cualquier lugar, no sólo desde el directorio ``flask-tutorial``.

source: Continue to :doc:`tests`.
xd: Continúe con :doc:`tests`.
