Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/next.po
Languages: fr, xd

source: Keep Developing!
fr: Continuez à vous développer !
xd: ¡Siga desarrollando!

source: You've learned about quite a few Flask and Python concepts throughout the tutorial. Go back and review the tutorial and compare your code with the steps you took to get there. Compare your project to the :gh:`example project <examples/tutorial>`, which might look a bit different due to the step-by-step nature of the tutorial.
fr: Vous avez appris un certain nombre de concepts de Flask et de Python tout au long du tutoriel. Revenez en arrière, relisez le tutoriel et comparez votre code avec les étapes que vous avez suivies pour y arriver. Comparez votre projet au projet :gh:`exemple <examples/tutorial>`, qui pourrait avoir un aspect un peu différent en raison de la nature pas à pas du tutoriel.
xd: Has aprendido bastantes conceptos de Flask y Python a lo largo del tutorial. Vuelve a repasar el tutorial y compara tu código con los pasos que has dado para llegar a él. Compara tu proyecto con el :gh:`proyecto de ejemplo <examples/tutorial>`, que puede parecer un poco diferente debido a la naturaleza paso a paso del tutorial.

source: There's a lot more to Flask than what you've seen so far. Even so, you're now equipped to start developing your own web applications. Check out the :doc:`/quickstart` for an overview of what Flask can do, then dive into the docs to keep learning. Flask uses `Jinja`_, `Click`_, `Werkzeug`_, and `ItsDangerous`_ behind the scenes, and they all have their own documentation too. You'll also be interested in :doc:`/extensions` which make tasks like working with the database or validating form data easier and more powerful.
fr: Flask est bien plus que ce que vous avez vu jusqu'à présent. Néanmoins, vous êtes maintenant équipé pour commencer à développer vos propres applications web. Consultez :doc:`/quickstart` pour avoir un aperçu de ce que Flask peut faire, puis plongez dans la documentation pour continuer à apprendre. Flask utilise `Jinja`_, `Click`_, `Werkzeug`_, et `ItsDangerous`_ dans les coulisses, et ils ont tous leur propre documentation aussi. Vous serez également intéressé par les :doc:`/extensions` qui rendent des tâches comme le travail avec la base de données ou la validation des données de formulaire plus faciles et plus puissantes.
xd: Hay mucho más en Flask de lo que has visto hasta ahora. Aun así, ahora estás equipado para empezar a desarrollar tus propias aplicaciones web. Echa un vistazo al :doc:`/quickstart` para obtener una visión general de lo que Flask puede hacer, y luego bucea en los documentos para seguir aprendiendo. Flask utiliza `Jinja`_, `Click`_, `Werkzeug`_ y `ItsDangerous`_ entre bastidores, y todos ellos tienen también su propia documentación. También te interesará :doc:`/extensions` que facilitan y potencian tareas como el trabajo con la base de datos o la validación de datos de formularios.

source: If you want to keep developing your Flaskr project, here are some ideas for what to try next:
fr: Si vous souhaitez continuer à développer votre projet Flaskr, voici quelques idées sur ce que vous pouvez essayer ensuite :
xd: Si quieres seguir desarrollando tu proyecto Flaskr, aquí tienes algunas ideas sobre lo que puedes probar a continuación:

source: A detail view to show a single post. Click a post's title to go to its page.
fr: Une vue détaillée pour afficher un seul message. Cliquez sur le titre d'un message pour accéder à sa page.
xd: Una vista detallada para mostrar una sola entrada. Haga clic en el título de una entrada para ir a su página.

source: Like / unlike a post.
fr: Haut-vote / bas-vote un message.
xd: Me gusta/no me gusta una entrada.

source: Comments.
fr: Commentaires.
xd: Comentarios.

source: Tags. Clicking a tag shows all the posts with that tag.
fr: Tags. Si vous cliquez sur un tag, vous verrez tous les messages correspondant à ce tag.
xd: Etiquetas. Al hacer clic en una etiqueta se muestran todos los mensajes con esa etiqueta.

source: A search box that filters the index page by name.
fr: Une barre de recherche qui filtre la page d'index par nom.
xd: Una caja de búsqueda que filtra la página del índice por nombre.

source: Paged display. Only show 5 posts per page.
fr: Affichage par page. N'affichez que 5 messages par page.
xd: Visualización por páginas. Sólo muestra 5 posts por página.

source: Upload an image to go along with a post.
fr: Téléchargez une image pour accompagner un article.
xd: Cargar una imagen para acompañar un mensaje.

source: Format posts using Markdown.
fr: Formatez vos articles en utilisant le format Markdown.
xd: Formatear los posts usando Markdown.

source: An RSS feed of new posts.
fr: Un flux RSS des nouveaux messages.
xd: Una fuente RSS de nuevos mensajes.

source: Have fun and make awesome applications!
fr: Amusez-vous et faites des applications géniales !
xd: ¡Diviértete y haz aplicaciones increíbles!
