Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/static.po
Languages: fr

source: Static Files
fr: Fichiers statiques

source: The authentication views and templates work, but they look very plain right now. Some `CSS`_ can be added to add style to the HTML layout you constructed. The style won't change, so it's a *static* file rather than a template.
fr: Les vues et les modèles d'authentification fonctionnent, mais ils sont très simples pour le moment. Un peu de `CSS`_ peut être ajouté pour ajouter du style à la mise en page HTML que vous avez construite. Le style ne changera pas, il s'agit donc d'un fichier *statique* plutôt que d'un modèle.

source: Flask automatically adds a ``static`` view that takes a path relative to the ``flaskr/static`` directory and serves it. The ``base.html`` template already has a link to the ``style.css`` file:
fr: Flask ajoute automatiquement une vue ``static`` qui prend un chemin relatif au répertoire ``flaskr/static`` et le sert. Le modèle ``base.html`` a déjà un lien vers le fichier ``style.css`` :

source: Besides CSS, other types of static files might be files with JavaScript functions, or a logo image. They are all placed under the ``flaskr/static`` directory and referenced with ``url_for('static', filename='...')``.
fr: Outre les CSS, d'autres types de fichiers statiques peuvent être des fichiers contenant des fonctions JavaScript, ou une image de logo. Ils sont tous placés dans le répertoire ``flaskr/static`` et référencés avec ``url_for('static', filename='...')``.

source: This tutorial isn't focused on how to write CSS, so you can just copy the following into the ``flaskr/static/style.css`` file:
fr: Ce tutoriel n'est pas axé sur l'écriture de CSS, vous pouvez donc simplement copier ce qui suit dans le fichier ``flaskr/static/style.css`` :

source: You can find a less compact version of ``style.css`` in the :gh:`example code <examples/tutorial/flaskr/static/style.css>`.
fr: Vous pouvez trouver une version moins compacte de ``style.css`` dans le :gh:`code d\'exemple<examples/tutorial/flaskr/static/style.css>`.

source: Go to http://127.0.0.1:5000/auth/login and the page should look like the screenshot below.
fr: Allez sur http://127.0.0.1:5000/auth/login et la page devrait ressembler à la capture d'écran ci-dessous.

source: screenshot of login page
fr: capture d'écran de la page de connexion

source: You can read more about CSS from `Mozilla's documentation <CSS_>`_. If you change a static file, refresh the browser page. If the change doesn't show up, try clearing your browser's cache.
fr: Vous pouvez en savoir plus sur les CSS en consultant `Mozilla's documentation <CSS_>`_. Si vous modifiez un fichier statique, rafraîchissez la page du navigateur. Si la modification ne s'affiche pas, essayez de vider le cache de votre navigateur.

source: Continue to :doc:`blog`.
fr: Continuer vers :doc:`blog`.
