Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/tutorial/templates.po
Languages: fr, xd

source: Templates
fr: Modèles
xd: Plantillas

source: You've written the authentication views for your application, but if you're running the server and try to go to any of the URLs, you'll see a ``TemplateNotFound`` error. That's because the views are calling :func:`render_template`, but you haven't written the templates yet. The template files will be stored in the ``templates`` directory inside the ``flaskr`` package.
fr: Vous avez écrit les vues d'authentification pour votre application, mais si vous exécutez le serveur et essayez d'aller sur l'une des URL, vous verrez une erreur ``TemplateNotFound``. C'est parce que les vues appellent :func:`render_template`, mais vous n'avez pas encore écrit les modèles. Les fichiers de modèles seront stockés dans le répertoire ``templates`` du paquet ``flaskr``.
xd: Has escrito las vistas de autenticación para tu aplicación, pero si estás ejecutando el servidor e intentas ir a cualquiera de las URLs, verás un error ``TemplateNotFound``. Esto se debe a que las vistas están llamando a :func:`render_template`, pero aún no has escrito las plantillas. Los archivos de plantillas se almacenan en el directorio ``templates`` dentro del paquete ``flaskr``.

source: Templates are files that contain static data as well as placeholders for dynamic data. A template is rendered with specific data to produce a final document. Flask uses the `Jinja`_ template library to render templates.
fr: Les modèles sont des fichiers qui contiennent des données statiques ainsi que des espaces réservés pour des données dynamiques. Un modèle est rendu avec des données spécifiques pour produire un document final. Flask utilise la bibliothèque de modèles `Jinja`_ pour rendre les modèles.
xd: Las plantillas son archivos que contienen datos estáticos así como marcadores de posición para datos dinámicos. Una plantilla se renderiza con datos específicos para producir un documento final. Flask utiliza la biblioteca de plantillas `Jinja`_ para renderizar las plantillas.

source: In your application, you will use templates to render `HTML`_ which will display in the user's browser. In Flask, Jinja is configured to *autoescape* any data that is rendered in HTML templates. This means that it's safe to render user input; any characters they've entered that could mess with the HTML, such as ``<`` and ``>`` will be *escaped* with *safe* values that look the same in the browser but don't cause unwanted effects.
fr: Dans votre application, vous utiliserez des modèles pour rendre le `HTML`_ qui s'affichera dans le navigateur de l'utilisateur. Dans Flask, Jinja est configuré pour *auto-échapper* toutes les données qui sont rendues dans les modèles HTML. Cela signifie que le rendu de la saisie de l'utilisateur est sûr ; tous les caractères qu'il a entrés et qui pourraient perturber le HTML, tels que ``<`` et ``>``, seront *échappés* avec des valeurs *sûres* qui auront le même aspect dans le navigateur mais ne provoqueront pas d'effets indésirables.
xd: En tu aplicación, usarás plantillas para renderizar `HTML`_ que se mostrará en el navegador del usuario. En Flask, Jinja está configurado para *autoescapar* cualquier dato que se renderice en las plantillas HTML. Esto significa que es seguro renderizar la entrada del usuario; cualquier carácter que haya introducido que pueda estropear el HTML, como ``<`` y ``>`` será *escapado* con valores *seguros* que se vean igual en el navegador pero que no causen efectos no deseados.

source: Jinja looks and behaves mostly like Python. Special delimiters are used to distinguish Jinja syntax from the static data in the template. Anything between ``{{`` and ``}}`` is an expression that will be output to the final document. ``{%`` and ``%}`` denotes a control flow statement like ``if`` and ``for``. Unlike Python, blocks are denoted by start and end tags rather than indentation since static text within a block could change indentation.
fr: Jinja se présente et se comporte essentiellement comme Python. Des délimiteurs spéciaux sont utilisés pour distinguer la syntaxe Jinja des données statiques du modèle. Tout ce qui se trouve entre ``{{`` et ``}}`` est une expression qui sera affichée dans le document final. ``{%`` et ``%}`` dénote une instruction de flux de contrôle comme ``if`` et ``for``. Contrairement à Python, les blocs sont désignés par des balises de début et de fin plutôt que par une indentation, car le texte statique à l'intérieur d'un bloc peut modifier l'indentation.
xd: Jinja se ve y se comporta principalmente como Python. Se utilizan delimitadores especiales para distinguir la sintaxis de Jinja de los datos estáticos de la plantilla. Todo lo que esté entre ``{{`` y ``}}`` es una expresión que se enviará al documento final. ``{%`` y ``%}`` denota una declaración de flujo de control como ``if`` y ``for``. A diferencia de Python, los bloques se denotan mediante etiquetas de inicio y fin en lugar de indentación, ya que el texto estático dentro de un bloque podría cambiar la indentación.

source: The Base Layout
fr: La disposition de la base
xd: La disposición de la base

source: Each page in the application will have the same basic layout around a different body. Instead of writing the entire HTML structure in each template, each template will *extend* a base template and override specific sections.
fr: Chaque page de l'application aura la même mise en page de base autour d'un corps différent. Au lieu d'écrire la structure HTML complète dans chaque modèle, chaque modèle *étendra* un modèle de base et remplacera des sections spécifiques.
xd: Cada página de la aplicación tendrá el mismo diseño básico alrededor de un cuerpo diferente. En lugar de escribir toda la estructura HTML en cada plantilla, cada plantilla *extenderá* una plantilla base y anulará secciones específicas.

source: :data:`g` is automatically available in templates. Based on if ``g.user`` is set (from ``load_logged_in_user``), either the username and a log out link are displayed, or links to register and log in are displayed. :func:`url_for` is also automatically available, and is used to generate URLs to views instead of writing them out manually.
fr: :data:`g` est automatiquement disponible dans les modèles. Selon que ``g.user`` est défini (à partir de ``load_logged_in_user``), soit le nom d'utilisateur et un lien de déconnexion sont affichés, soit des liens pour s'enregistrer et se connecter sont affichés. :func:`url_for` est aussi automatiquement disponible, et est utilisé pour générer des URLs pour les vues au lieu de les écrire manuellement.
xd: :data:`g` está disponible automáticamente en las plantillas. En función de si se establece ``g.user`` (desde ``load_logged_in_user``), se muestra el nombre de usuario y un enlace de cierre de sesión, o se muestran enlaces para registrarse e iniciar sesión. :func:`url_for` también está disponible automáticamente, y se utiliza para generar URLs a las vistas en lugar de escribirlas manualmente.

source: After the page title, and before the content, the template loops over each message returned by :func:`get_flashed_messages`. You used :func:`flash` in the views to show error messages, and this is the code that will display them.
fr: Après le titre de la page, et avant le contenu, le modèle boucle sur chaque message renvoyé par :func:`get_flashed_messages`. Vous avez utilisé :func:`flash` dans les vues pour afficher les messages d'erreur, et voici le code qui va les afficher.
xd: Después del título de la página, y antes del contenido, la plantilla hace un bucle sobre cada mensaje devuelto por :func:`get_flashed_messages`. Has utilizado :func:`flash` en las vistas para mostrar los mensajes de error, y este es el código que los mostrará.

source: There are three blocks defined here that will be overridden in the other templates:
fr: Il y a trois blocs définis ici qui seront remplacés dans les autres modèles :
xd: Hay tres bloques definidos aquí que serán anulados en las otras plantillas:

source: ``{% block title %}`` will change the title displayed in the browser's tab and window title.
fr: ``{% block title %}`` modifiera le titre affiché dans l'onglet et le titre de la fenêtre du navigateur.
xd: ``{% block title %}`` cambiará el título mostrado en la pestaña del navegador y el título de la ventana.

source: ``{% block header %}`` is similar to ``title`` but will change the title displayed on the page.
fr: ``{% block header %}`` est similaire à ``title`` mais changera le titre affiché sur la page.
xd: ``{% block header %}`` es similar a ``title`` pero cambiará el título mostrado en la página.

source: ``{% block content %}`` is where the content of each page goes, such as the login form or a blog post.
fr: ``{% block content %}`` est l'endroit où va le contenu de chaque page, comme le formulaire de connexion ou un article de blog.
xd: ``{% block content %}`` es donde va el contenido de cada página, como el formulario de acceso o una entrada del blog.

source: The base template is directly in the ``templates`` directory. To keep the others organized, the templates for a blueprint will be placed in a directory with the same name as the blueprint.
fr: Le modèle de base se trouve directement dans le répertoire ``templates``. Pour garder les autres organisés, les modèles pour un *blueprint* seront placés dans un répertoire avec le même nom que le *blueprint*.
xd: La plantilla base está directamente en el directorio ``templates``. Para mantener los demás organizados, las plantillas de un plano se colocarán en un directorio con el mismo nombre que el plano.

source: Register
fr: S'inscrire
xd: Registro

source: ``{% extends 'base.html' %}`` tells Jinja that this template should replace the blocks from the base template. All the rendered content must appear inside ``{% block %}`` tags that override blocks from the base template.
fr: ``{% extends 'base.html' %}`` indique à Jinja que ce modèle doit remplacer les blocs du modèle de base. Tout le contenu rendu doit apparaître à l'intérieur des balises ``{% block %}`` qui remplacent les blocs du modèle de base.
xd: ``{% extends 'base.html' %}`` indica a Jinja que esta plantilla debe reemplazar los bloques de la plantilla base. Todo el contenido renderizado debe aparecer dentro de las etiquetas ``{% block %}`` que anulan los bloques de la plantilla base.

source: A useful pattern used here is to place ``{% block title %}`` inside ``{% block header %}``. This will set the title block and then output the value of it into the header block, so that both the window and page share the same title without writing it twice.
fr: Un modèle utile utilisé ici consiste à placer ``{% block title %}`` à l'intérieur de ``{% block header %}``. Cela permettra de définir le bloc title puis d'afficher sa valeur dans le bloc header, de sorte que la fenêtre et la page partagent le même titre sans l'écrire deux fois.
xd: Un patrón útil utilizado aquí es colocar ``{% block title %}`` dentro de ``{% block header %}``. Esto establecerá el bloque title y luego emitirá el valor del mismo en el bloque header, para que tanto la ventana como la página compartan el mismo título sin escribirlo dos veces.

source: The ``input`` tags are using the ``required`` attribute here. This tells the browser not to submit the form until those fields are filled in. If the user is using an older browser that doesn't support that attribute, or if they are using something besides a browser to make requests, you still want to validate the data in the Flask view. It's important to always fully validate the data on the server, even if the client does some validation as well.
fr: Les balises ``input`` utilisent ici l'attribut ``required``. Cela indique au navigateur de ne pas soumettre le formulaire tant que ces champs ne sont pas remplis. Si l'utilisateur utilise un ancien navigateur qui ne prend pas en charge cet attribut, ou s'il utilise autre chose qu'un navigateur pour faire des requêtes, vous devez quand même valider les données dans la vue Flask. Il est important de toujours valider complètement les données sur le serveur, même si le client effectue également une certaine validation.
xd: Las etiquetas ``input`` están usando el atributo ``required`` aquí. Esto le dice al navegador que no envíe el formulario hasta que esos campos sean rellenados. Si el usuario está usando un navegador antiguo que no soporta ese atributo, o si está usando algo más que un navegador para hacer peticiones, todavía quieres validar los datos en la vista Flask. Es importante siempre validar completamente los datos en el servidor, incluso si el cliente hace alguna validación también.

source: Log In
fr: Connexion
xd: Iniciar sesión

source: This is identical to the register template except for the title and submit button.
fr: Ce modèle est identique au modèle pour s'inscrire, à l'exception du titre et du bouton d'envoi.
xd: Es idéntica a la plantilla de registro, excepto por el título y el botón de envío.

source: Register A User
fr: Inscrire un utilisateur
xd: Registrar un usuario

source: Now that the authentication templates are written, you can register a user. Make sure the server is still running (``flask run`` if it's not), then go to http://127.0.0.1:5000/auth/register.
fr: Maintenant que les modèles d'authentification sont écrits, vous pouvez enregistrer un utilisateur. Assurez-vous que le serveur est toujours en cours d'exécution (``flask run`` s'il ne l'est pas), puis allez à http://127.0.0.1:5000/auth/register.
xd: Ahora que las plantillas de autenticación están escritas, puedes registrar un usuario. Asegúrate de que el servidor sigue funcionando (``flask run`` si no lo está), y luego ve a http://127.0.0.1:5000/auth/register.

source: Try clicking the "Register" button without filling out the form and see that the browser shows an error message. Try removing the ``required`` attributes from the ``register.html`` template and click "Register" again. Instead of the browser showing an error, the page will reload and the error from :func:`flash` in the view will be shown.
fr: Essayez de cliquer sur le bouton "Register" sans remplir le formulaire et voyez si le navigateur affiche un message d'erreur. Essayez de supprimer les attributs ``required`` du modèle ``register.html`` et cliquez à nouveau sur "Register". Au lieu que le navigateur affiche une erreur, la page se recharge et l'erreur de :func:`flash` dans la vue s'affiche.
xd: Prueba a hacer clic en el botón "Registrarse" sin rellenar el formulario y comprueba que el navegador muestra un mensaje de error. Prueba a eliminar los atributos ``required`` de la plantilla ``register.html`` y vuelve a hacer clic en "Registrarse". En lugar de que el navegador muestre un error, la página se recargará y se mostrará el error de :func:`flash` en la vista.

source: Fill out a username and password and you'll be redirected to the login page. Try entering an incorrect username, or the correct username and incorrect password. If you log in you'll get an error because there's no ``index`` view to redirect to yet.
fr: Remplissez un nom d'utilisateur et un mot de passe et vous serez redirigé vers la page de connexion. Essayez de saisir un nom d'utilisateur incorrect, ou un nom d'utilisateur correct et un mot de passe incorrect. Si vous vous connectez, vous obtiendrez une erreur car il n'y a pas encore de vue ``index`` vers laquelle rediriger.
xd: Rellena un nombre de usuario y una contraseña y serás redirigido a la página de inicio de sesión. Intenta introducir un nombre de usuario incorrecto, o el nombre de usuario correcto y una contraseña incorrecta. Si te conectas obtendrás un error porque todavía no hay una vista ``index`` a la que redirigir.

source: Continue to :doc:`static`.
fr: Continuer vers :doc:`static`.
xd: Continuar con :doc:`static`.
