Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/blueprints.po
Languages: es

source: Modular Applications with Blueprints
es: Aplicaciones modulares con Blueprints

source: Flask uses a concept of *blueprints* for making application components and supporting common patterns within an application or across applications. Blueprints can greatly simplify how large applications work and provide a central means for Flask extensions to register operations on applications. A :class:`Blueprint` object works similarly to a :class:`Flask` application object, but it is not actually an application. Rather it is a *blueprint* of how to construct or extend an application.
es: Flask utiliza un concepto de *blueprints* para crear componentes de aplicaciones y soportar patrones comunes dentro de una aplicación o entre aplicaciones. Los blueprints pueden simplificar en gran medida el funcionamiento de las grandes aplicaciones y proporcionar un medio central para que las extensiones de Flask registren operaciones en las aplicaciones. Un objeto :class:`Blueprint` funciona de forma similar a un objeto de aplicación :class:`Flask`, pero no es realmente una aplicación. Más bien es un *blueprint* de cómo construir o extender una aplicación.

source: Why Blueprints?
es: ¿Por qué los Blueprints?

source: Blueprints in Flask are intended for these cases:
es: Los Blueprints en Flask están pensados para estos casos:

source: Factor an application into a set of blueprints. This is ideal for larger applications; a project could instantiate an application object, initialize several extensions, and register a collection of blueprints.
es: Factorizar una aplicación en un conjunto de blueprints. Esto es ideal para aplicaciones más grandes; un proyecto podría instanciar un objeto de aplicación, inicializar varias extensiones y registrar una colección de blueprints.

source: Register a blueprint on an application at a URL prefix and/or subdomain. Parameters in the URL prefix/subdomain become common view arguments (with defaults) across all view functions in the blueprint.
es: Registrar un blueprint en una aplicación en un prefijo de URL y/o subdominio. Los parámetros en el prefijo de URL/subdominio se convierten en argumentos comunes de la vista (con valores predeterminados) en todas las funciones de la vista en el blueprint.

source: Register a blueprint multiple times on an application with different URL rules.
es: Registrar un blueprint varias veces en una aplicación con diferentes reglas de URL.

source: Provide template filters, static files, templates, and other utilities through blueprints. A blueprint does not have to implement applications or view functions.
es: Proporcionar filtros de plantilla, archivos estáticos, plantillas y otras utilidades a través de blueprints. Un blueprint no tiene que implementar aplicaciones o funciones de vista.

source: Register a blueprint on an application for any of these cases when initializing a Flask extension.
es: Registrar un blueprint en una aplicación para cualquiera de estos casos al inicializar una extensión de Flask.

source: A blueprint in Flask is not a pluggable app because it is not actually an application -- it's a set of operations which can be registered on an application, even multiple times. Why not have multiple application objects? You can do that (see :doc:`/patterns/appdispatch`), but your applications will have separate configs and will be managed at the WSGI layer.
es: Un blueprint en Flask no es una aplicación enchufable porque no es realmente una aplicación -- es un conjunto de operaciones que pueden ser registradas en una aplicación, incluso múltiples veces. ¿Por qué no tener múltiples objetos de aplicación? Puedes hacerlo (ver :doc:`/patterns/appdispatch`), pero tus aplicaciones tendrán configuraciones separadas y serán gestionadas en la capa WSGI.

source: Blueprints instead provide separation at the Flask level, share application config, and can change an application object as necessary with being registered. The downside is that you cannot unregister a blueprint once an application was created without having to destroy the whole application object.
es: En cambio, los blueprints proporcionan una separación a nivel de Flask, comparten la configuración de la aplicación y pueden cambiar un objeto de la aplicación según sea necesario con estar registrado. El inconveniente es que no se puede anular el registro de un blueprint una vez que se ha creado una aplicación sin tener que destruir todo el objeto de aplicación.

source: The Concept of Blueprints
es: El concepto de Blueprints

source: The basic concept of blueprints is that they record operations to execute when registered on an application. Flask associates view functions with blueprints when dispatching requests and generating URLs from one endpoint to another.
es: El concepto básico de los blueprints es que registran las operaciones a ejecutar cuando se registran en una aplicación. Flask asocia las funciones de vista con los blueprints cuando despacha peticiones y genera URLs de un endpoint a otro.

source: My First Blueprint
es: Mi primer Blueprint

source: This is what a very basic blueprint looks like. In this case we want to implement a blueprint that does simple rendering of static templates::
es: Este es el aspecto de un blueprint muy básico. En este caso queremos implementar un blueprint que haga un simple renderizado de plantillas estáticas::

source: When you bind a function with the help of the ``@simple_page.route`` decorator, the blueprint will record the intention of registering the function ``show`` on the application when it's later registered. Additionally it will prefix the endpoint of the function with the name of the blueprint which was given to the :class:`Blueprint` constructor (in this case also ``simple_page``). The blueprint's name does not modify the URL, only the endpoint.
es: Cuando se vincula una función con la ayuda del decorador ``@simple_page.route``, el blueprint registrará la intención de registrar la función ``show`` en la aplicación cuando se registre posteriormente. Además, antepondrá al punto final de la función el nombre del blueprint que se le dio al constructor :class:`Blueprint` (en este caso también ``simple_page``). El nombre del blueprint no modifica la URL, sólo el endpoint.

source: Registering Blueprints
es: Registro de Blueprints

source: So how do you register that blueprint? Like this::
es: Entonces, ¿cómo se registra ese blueprint? Así::

source: If you check the rules registered on the application, you will find these::
es: Si comprueba las normas registradas en la aplicación, encontrará estas::

source: The first one is obviously from the application itself for the static files. The other two are for the `show` function of the ``simple_page`` blueprint. As you can see, they are also prefixed with the name of the blueprint and separated by a dot (``.``).
es: El primero es obviamente de la propia aplicación para los archivos estáticos. Los otros dos son para la función `show` del blueprint ``simple_page``. Como puedes ver, también están prefijados con el nombre del blueprint y separados por un punto (``.``).

source: Blueprints however can also be mounted at different locations::
es: Sin embargo, los blueprints también se pueden montar en diferentes lugares::

source: And sure enough, these are the generated rules::
es: Y efectivamente, estas son las reglas generadas::

source: On top of that you can register blueprints multiple times though not every blueprint might respond properly to that. In fact it depends on how the blueprint is implemented if it can be mounted more than once.
es: Además, puede registrar los blueprints varias veces, aunque no todos los blueprint pueden responder adecuadamente a ello. De hecho, depende de cómo se implemente el blueprint si se puede montar más de una vez.

source: Nesting Blueprints
es: Anidando blueprints

source: It is possible to register a blueprint on another blueprint.
es: Es posible registrar un blueprints dentro de otro blueprint.

source: The child blueprint will gain the parent's name as a prefix to its name, and child URLs will be prefixed with the parent's URL prefix.
es: El blueprint hijo obtendrá el nombre del padre como prefijo de su nombre, y las URLs hijas llevarán el prefijo de la URL del padre.

source: Blueprint-specific before request functions, etc. registered with the parent will trigger for the child. If a child does not have an error handler that can handle a given exception, the parent's will be tried.
es: Las funciones específicas del blueprint antes de la solicitud, etc. registradas con el padre se activarán para el hijo. Si un hijo no tiene un manejador de errores que pueda manejar una excepción dada, se intentará el del padre.

source: Blueprint Resources
es: Recursos de blueprints

source: Blueprints can provide resources as well. Sometimes you might want to introduce a blueprint only for the resources it provides.
es: Los blueprints también pueden proporcionar recursos. A veces puede querer introducir un blueprint sólo por los recursos que proporciona.

source: Blueprint Resource Folder
es: Carpeta de recursos Blueprint

source: Like for regular applications, blueprints are considered to be contained in a folder. While multiple blueprints can originate from the same folder, it does not have to be the case and it's usually not recommended.
es: Al igual que para las aplicaciones normales, se considera que los blueprints están contenidos en una carpeta. Aunque varios blueprints pueden originarse en la misma carpeta, no tiene por qué ser así y no suele ser recomendable.

source: The folder is inferred from the second argument to :class:`Blueprint` which is usually `__name__`. This argument specifies what logical Python module or package corresponds to the blueprint. If it points to an actual Python package that package (which is a folder on the filesystem) is the resource folder. If it's a module, the package the module is contained in will be the resource folder. You can access the :attr:`Blueprint.root_path` property to see what the resource folder is::
es: La carpeta se infiere del segundo argumento de :class:`Blueprint` que suele ser `__name__`. Este argumento especifica qué módulo o paquete lógico de Python corresponde al blueprint. Si apunta a un paquete real de Python ese paquete (que es una carpeta en el sistema de archivos) es la carpeta de recursos. Si es un módulo, el paquete que contiene el módulo será la carpeta de recursos. Puedes acceder a la propiedad :attr:`Blueprint.root_path` para ver cuál es la carpeta de recursos::

source: To quickly open sources from this folder you can use the :meth:`~Blueprint.open_resource` function::
es: Para abrir rápidamente las fuentes de esta carpeta puedes utilizar la función :meth:`~Blueprint.open_resource`::

source: Static Files
es: Archivos estáticos

source: A blueprint can expose a folder with static files by providing the path to the folder on the filesystem with the ``static_folder`` argument. It is either an absolute path or relative to the blueprint's location::
es: Un blueprint puede exponer una carpeta con archivos estáticos proporcionando la ruta a la carpeta en el sistema de archivos con el argumento ``carpeta_estática``. Es una ruta absoluta o relativa a la ubicación del blueprint::

source: By default the rightmost part of the path is where it is exposed on the web. This can be changed with the ``static_url_path`` argument. Because the folder is called ``static`` here it will be available at the ``url_prefix`` of the blueprint + ``/static``. If the blueprint has the prefix ``/admin``, the static URL will be ``/admin/static``.
es: Por defecto, la parte más a la derecha de la ruta es donde se expone en la web. Esto puede cambiarse con el argumento ``static_url_path``. Como la carpeta se llama ``static`` aquí estará disponible en el ``url_prefix`` del blueprint + ``/static``. Si el blueprint tiene el prefijo ``/admin``, la URL estática será ``/admin/static``.

source: The endpoint is named ``blueprint_name.static``. You can generate URLs to it with :func:`url_for` like you would with the static folder of the application::
es: El endpoint se llama ``nombre_blueprint.static``. Puedes generar URLs hacia él con :func:`url_for` como lo harías con la carpeta static de la aplicación::

source: However, if the blueprint does not have a ``url_prefix``, it is not possible to access the blueprint's static folder. This is because the URL would be ``/static`` in this case, and the application's ``/static`` route takes precedence. Unlike template folders, blueprint static folders are not searched if the file does not exist in the application static folder.
es: Sin embargo, si el blueprint no tiene un ``url_prefix``, no es posible acceder a la carpeta estática del blueprint. Esto se debe a que la URL sería ``/static`` en este caso, y la ruta ``/static`` de la aplicación tiene prioridad. A diferencia de las carpetas de plantillas, las carpetas estáticas de los blueprints no se buscan si el archivo no existe en la carpeta estática de la aplicación.

source: Templates
es: Plantillas

source: If you want the blueprint to expose templates you can do that by providing the `template_folder` parameter to the :class:`Blueprint` constructor::
es: Si quieres que el blueprint exponga plantillas puedes hacerlo proporcionando el parámetro `template_folder` al constructor :class:`Blueprint`::

source: For static files, the path can be absolute or relative to the blueprint resource folder.
es: Para los archivos estáticos, la ruta puede ser absoluta o relativa a la carpeta de recursos del blueprint.

source: The template folder is added to the search path of templates but with a lower priority than the actual application's template folder. That way you can easily override templates that a blueprint provides in the actual application. This also means that if you don't want a blueprint template to be accidentally overridden, make sure that no other blueprint or actual application template has the same relative path. When multiple blueprints provide the same relative template path the first blueprint registered takes precedence over the others.
es: La carpeta de plantillas se añade a la ruta de búsqueda de plantillas, pero con una prioridad menor que la carpeta de plantillas de la aplicación real. De este modo, puede anular fácilmente las plantillas que un blueprint proporciona en la aplicación real. Esto también significa que si no quieres que una plantilla de blueprint sea anulada accidentalmente, asegúrate de que ningún otro blueprint o plantilla de la aplicación real tenga la misma ruta relativa. Cuando varios blueprints proporcionan la misma ruta relativa de la plantilla, el primer blueprint registrado tiene prioridad sobre los demás.

source: So if you have a blueprint in the folder ``yourapplication/admin`` and you want to render the template ``'admin/index.html'`` and you have provided ``templates`` as a `template_folder` you will have to create a file like this: :file:`yourapplication/admin/templates/admin/index.html`. The reason for the extra ``admin`` folder is to avoid getting our template overridden by a template named ``index.html`` in the actual application template folder.
es: Así que si tienes un blueprint en la carpeta ``yourapplication/admin`` y quieres renderizar la plantilla ``'admin/index.html`` y has proporcionado ``templates`` como `carpeta_de_plantillas` tendrás que crear un archivo como este: :file:`yourapplication/admin/templates/admin/index.html`. La razón de la carpeta extra ``admin`` es para evitar que nuestra plantilla sea anulada por una plantilla llamada ``index.html`` en la carpeta de plantillas de la aplicación.

source: To further reiterate this: if you have a blueprint named ``admin`` and you want to render a template called :file:`index.html` which is specific to this blueprint, the best idea is to lay out your templates like this::
es: Para reiterar esto: Si tienes un blueprint llamado ``admin`` y quieres renderizar una plantilla llamada :file:`index.html` que es específica para este blueprint, la mejor idea es diseñar tus plantillas así::

source: And then when you want to render the template, use :file:`admin/index.html` as the name to look up the template by. If you encounter problems loading the correct templates enable the ``EXPLAIN_TEMPLATE_LOADING`` config variable which will instruct Flask to print out the steps it goes through to locate templates on every ``render_template`` call.
es: Y luego, cuando quieras renderizar la plantilla, utiliza :file:`admin/index.html` como nombre para buscar la plantilla. Si tienes problemas para cargar las plantillas correctas, activa la variable de configuración ``EXPLAIN_TEMPLATE_LOADING``, que indicará a Flask que imprima los pasos que sigue para localizar las plantillas en cada llamada a ``render_template``.

source: Building URLs
es: Construcción de URLs

source: If you want to link from one page to another you can use the :func:`url_for` function just like you normally would do just that you prefix the URL endpoint with the name of the blueprint and a dot (``.``)::
es: Si quieres enlazar de una página a otra puedes utilizar la función :func:`url_for` como lo harías normalmente sólo que antepones al punto final de la URL el nombre del blueprint y un punto (``.``)::

source: Additionally if you are in a view function of a blueprint or a rendered template and you want to link to another endpoint of the same blueprint, you can use relative redirects by prefixing the endpoint with a dot only::
es: Además, si estás en una función de vista de un blueprint o una plantilla renderizada y quieres enlazar con otro punto final del mismo blueprint, puedes utilizar redirecciones relativas anteponiendo al punto final sólo un punto::

source: This will link to ``admin.index`` for instance in case the current request was dispatched to any other admin blueprint endpoint.
es: Esto enlazará con ``admin.index``, por ejemplo, en caso de que la solicitud actual haya sido enviada a cualquier otro punto final del blueprint de administración.

source: Blueprint Error Handlers
es: Manejadores de errores de blueprints

source: Blueprints support the ``errorhandler`` decorator just like the :class:`Flask` application object, so it is easy to make Blueprint-specific custom error pages.
es: Los blueprints soportan el decorador ``errorhandler`` al igual que el objeto de aplicación :class:`Flask`, por lo que es fácil hacer páginas de error personalizadas específicas para Blueprint.

source: Here is an example for a "404 Page Not Found" exception::
es: Este es un ejemplo para una excepción "404 Página no encontrada"::

source: Most errorhandlers will simply work as expected; however, there is a caveat concerning handlers for 404 and 405 exceptions. These errorhandlers are only invoked from an appropriate ``raise`` statement or a call to ``abort`` in another of the blueprint's view functions; they are not invoked by, e.g., an invalid URL access. This is because the blueprint does not "own" a certain URL space, so the application instance has no way of knowing which blueprint error handler it should run if given an invalid URL. If you would like to execute different handling strategies for these errors based on URL prefixes, they may be defined at the application level using the ``request`` proxy object::
es: La mayoría de los manejadores de error funcionarán simplemente como se espera; sin embargo, hay una advertencia sobre los manejadores para las excepciones 404 y 405. Estos manejadores de error sólo se invocan desde una sentencia ``raise`` apropiada o una llamada a ``abort`` en otra de las funciones de vista del blueprint; no son invocados por, por ejemplo, un acceso a una URL no válida. Esto se debe a que el blueprint no es "dueño" de un determinado espacio URL, por lo que la instancia de la aplicación no tiene forma de saber qué manejador de errores del blueprint debe ejecutar si se le da una URL inválida. Si quieres ejecutar diferentes estrategias de manejo para estos errores basados en prefijos de URL, pueden ser definidos a nivel de aplicación usando el objeto proxy ``request``::

source: See :doc:`/errorhandling`.
es: Véase :doc:`/errorhandling`.
