Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/cli.po
Languages: es

source: Command Line Interface
es: Interfaz de línea de comandos

source: Installing Flask installs the ``flask`` script, a `Click`_ command line interface, in your virtualenv. Executed from the terminal, this script gives access to built-in, extension, and application-defined commands. The ``--help`` option will give more information about any commands and options.
es: La instalación de Flask instala el script ``flask``, una interfaz de línea de comandos `Click`_, en su virtualenv. Ejecutado desde el terminal, este script da acceso a los comandos incorporados, a las extensiones y a los definidos por la aplicación. La opción ``--help`` dará más información sobre los comandos y opciones.

source: Application Discovery
es: Descubrimiento de aplicaciones

source: (nothing)
es: (nada)

source: The name "app" or "wsgi" is imported (as a ".py" file, or package), automatically detecting an app (``app`` or ``application``) or factory (``create_app`` or ``make_app``).
es: El nombre "app" o "wsgi" se importa (como un archivo ".py", o paquete), detectando automáticamente una aplicación (``app`` o ``application``) o fábrica (``create_app`` o ``make_app``).

source: The given name is imported, automatically detecting an app (``app`` or ``application``) or factory (``create_app`` or ``make_app``).
es: Se importa el nombre dado, detectando automáticamente una aplicación (``app`` o ``application``) o fábrica (``create_app`` o ``make_app``).

source: Sets the current working directory to ``src`` then imports ``hello``.
es: Establece el directorio de trabajo actual en ``src`` y luego importa ``hello``.

source: Uses the ``app2`` Flask instance in ``hello``.
es: Utiliza la instancia de Flask de ``app2`` en ``hello``.

source: The ``create_app`` factory in ``hello`` is called with the string ``'dev'`` as the argument.
es: La fábrica ``create_app`` en ``hello`` es llamada con la cadena ``'dev'`` como argumento.

source: Within the given import, the command looks for an application instance named ``app`` or ``application``, then any application instance. If no instance is found, the command looks for a factory function named ``create_app`` or ``make_app`` that returns an instance.
es: Dentro de la importación dada, el comando busca una instancia de aplicación llamada ``app`` o ``application``, y luego cualquier instancia de aplicación. Si no se encuentra ninguna instancia, el comando busca una función de fábrica llamada ``create_app`` o ``make_app`` que devuelva una instancia.

source: If parentheses follow the factory name, their contents are parsed as Python literals and passed as arguments and keyword arguments to the function. This means that strings must still be in quotes.
es: Si los paréntesis siguen al nombre de la fábrica, su contenido se analiza como literales de Python y se pasa como argumentos y palabras clave a la función. Esto significa que las cadenas deben seguir estando entre comillas.

source: Run the Development Server
es: Ejecutar el servidor de desarrollo

source: The :func:`run <cli.run_command>` command will start the development server. It replaces the :meth:`Flask.run` method in most cases. ::
es: El comando :func:`run <cli.run_command>` iniciará el servidor de desarrollo. Sustituye al método :meth:`Flask.run` en la mayoría de los casos. ::

source: Do not use this command to run your application in production. Only use the development server during development. The development server is provided for convenience, but is not designed to be particularly secure, stable, or efficient. See :doc:`/deploying/index` for how to run in production.
es: No utilice este comando para ejecutar su aplicación en producción. Utilice el servidor de desarrollo sólo durante el desarrollo. El servidor de desarrollo se proporciona por conveniencia, pero no está diseñado para ser particularmente seguro, estable o eficiente. Vea :doc:`/deploying/index` para saber cómo ejecutar en producción.

source: If another program is already using port 5000, you'll see ``OSError: [Errno 98]`` or ``OSError: [WinError 10013]`` when the server tries to start. See :ref:`address-already-in-use` for how to handle that.
es: Si otro programa ya está usando el puerto 5000, verás ``OSError: [Errno 98]`` o ``OSError: [WinError 10013]`` cuando el servidor intente iniciarse. Ver :ref:`address-already-in-use` para saber cómo manejar esto.

source: Open a Shell
es: Abrir un Shell

source: To explore the data in your application, you can start an interactive Python shell with the :func:`shell <cli.shell_command>` command. An application context will be active, and the app instance will be imported. ::
es: Para explorar los datos de tu aplicación, puedes iniciar un shell interactivo de Python con el comando :func:`shell <cli.shell_command>`. Se activará un contexto de aplicación y se importará la instancia de la app ::

source: Use :meth:`~Flask.shell_context_processor` to add other automatic imports.
es: Utilice :meth:`~Flask.shell_context_processor` para añadir otras importaciones automáticas.

source: Environments
es: Entornos

source: If the env is set to ``development``, the ``flask`` command will enable debug mode and ``flask run`` will enable the interactive debugger and reloader.
es: Si el entorno está configurado como ``development``, el comando ``flask`` habilitará el modo de depuración y ``flask run`` habilitará el depurador interactivo y el recargador.

source: Watch Extra Files with the Reloader
es: Vigilar los archivos extra con el Recargador

source: Debug Mode
es: Modo depuración

source: Environment Variables From dotenv
es: Variables de entorno de dotenv

source: Variables set on the command line are used over those set in :file:`.env`, which are used over those set in :file:`.flaskenv`. :file:`.flaskenv` should be used for public variables, such as ``FLASK_APP``, while :file:`.env` should not be committed to your repository so that it can set private variables.
es: Las variables establecidas en la línea de comandos se utilizan sobre las establecidas en :file:`.env`, que se utilizan sobre las establecidas en :file:`.flaskenv`. :file:`.flaskenv` debe utilizarse para las variables públicas, como ``FLASK_APP``, mientras que :file:`.env` no debe confirmarse en su repositorio para que pueda establecer variables privadas.

source: The files are only loaded by the ``flask`` command or calling :meth:`~Flask.run`. If you would like to load these files when running in production, you should call :func:`~cli.load_dotenv` manually.
es: Los archivos sólo se cargan con el comando ``flask`` o llamando a :meth:`~Flask.run`. Si desea cargar estos archivos cuando se ejecuta en producción, debe llamar a :func:`~cli.load_dotenv` manualmente.

source: Setting Command Options
es: Configuración de las opciones de comando

source: Click is configured to load default values for command options from environment variables. The variables use the pattern ``FLASK_COMMAND_OPTION``. For example, to set the port for the run command, instead of ``flask run --port 8000``:
es: Click está configurado para cargar los valores por defecto de las opciones de comando desde las variables de entorno. Las variables utilizan el patrón ``FLASK_COMMAND_OPTION``. Por ejemplo, para establecer el puerto para el comando de ejecución, en lugar de ``flask run --port 8000``:

source: These can be added to the ``.flaskenv`` file just like ``FLASK_APP`` to control default command options.
es: Se pueden añadir al archivo ``.flaskenv`` al igual que ``FLASK_APP`` para controlar las opciones de los comandos por defecto.

source: Disable dotenv
es: Desactivar dotenv

source: The ``flask`` command will show a message if it detects dotenv files but python-dotenv is not installed.
es: El comando ``flask`` mostrará un mensaje si detecta archivos dotenv pero python-dotenv no está instalado.

source: You can tell Flask not to load dotenv files even when python-dotenv is installed by setting the ``FLASK_SKIP_DOTENV`` environment variable. This can be useful if you want to load them manually, or if you're using a project runner that loads them already. Keep in mind that the environment variables must be set before the app loads or it won't configure as expected.
es: Puedes decirle a Flask que no cargue los archivos dotenv incluso cuando python-dotenv está instalado estableciendo la variable de entorno ``FLASK_SKIP_DOTENV``. Esto puede ser útil si quieres cargarlos manualmente, o si estás usando un ejecutor de proyecto que ya los carga. Ten en cuenta que las variables de entorno deben establecerse antes de que la aplicación se cargue o no se configurará como se espera.

source: Environment Variables From virtualenv
es: Variables de entorno de virtualenv

source: If you do not want to install dotenv support, you can still set environment variables by adding them to the end of the virtualenv's :file:`activate` script. Activating the virtualenv will set the variables.
es: Si no quieres instalar el soporte de dotenv, puedes establecer las variables de entorno añadiéndolas al final del script :file:`activate` del virtualenv. Al activar el virtualenv se establecerán las variables.

source: It is preferred to use dotenv support over this, since :file:`.flaskenv` can be committed to the repository so that it works automatically wherever the project is checked out.
es: Es preferible usar el soporte de dotenv sobre esto, ya que :file:`.flaskenv` puede ser comprometido en el repositorio para que funcione automáticamente dondequiera que el proyecto sea revisado.

source: Custom Commands
es: Comandos personalizados

source: The ``flask`` command is implemented using `Click`_. See that project's documentation for full information about writing commands.
es: El comando ``flask`` se implementa usando `Click`_. Consulte la documentación de ese proyecto para obtener información completa sobre la escritura de comandos.

source: This example adds the command ``create-user`` that takes the argument ``name``. ::
es: Este ejemplo añade el comando ``create-user`` que toma el argumento ``name``. ::

source: This example adds the same command, but as ``user create``, a command in a group. This is useful if you want to organize multiple related commands. ::
es: Este ejemplo añade el mismo comando, pero como ``user create``, un comando en un grupo. Esto es útil si quieres organizar múltiples comandos relacionados ::

source: See :ref:`testing-cli` for an overview of how to test your custom commands.
es: Vea :ref:`testing-cli` para una visión general de cómo probar sus comandos personalizados.

source: Registering Commands with Blueprints
es: Registro de comandos con Blueprints

source: If your application uses blueprints, you can optionally register CLI commands directly onto them. When your blueprint is registered onto your application, the associated commands will be available to the ``flask`` command. By default, those commands will be nested in a group matching the name of the blueprint.
es: Si tu aplicación utiliza blueprints, puedes registrar opcionalmente comandos CLI directamente en ellos. Cuando tu blueprint esté registrado en tu aplicación, los comandos asociados estarán disponibles para el comando ``flask``. Por defecto, esos comandos estarán anidados en un grupo que coincide con el nombre del blueprint.

source: You can alter the group name by specifying the ``cli_group`` parameter when creating the :class:`Blueprint` object, or later with :meth:`app.register_blueprint(bp, cli_group='...') <Flask.register_blueprint>`. The following are equivalent:
es: Se puede modificar el nombre del grupo especificando el parámetro ``cli_group`` al crear el objeto :class:`Blueprint`, o posteriormente con :meth:`app.register_blueprint(bp, cli_group='...') <Flask.register_blueprint>`. Los siguientes son equivalentes:

source: Specifying ``cli_group=None`` will remove the nesting and merge the commands directly to the application's level:
es: Especificando ``cli_group=None`` se eliminará el anidamiento y se fusionarán los comandos directamente al nivel de la aplicación:

source: Application Context
es: Contexto de la aplicación

source: Flask will automatically load commands specified in the ``flask.commands`` `entry point`_. This is useful for extensions that want to add commands when they are installed. Entry points are specified in :file:`setup.py` ::
es: Flask cargará automáticamente los comandos especificados en el ``flask.commands`` `entry point`_. Esto es útil para las extensiones que quieren añadir comandos cuando se instalan. Los puntos de entrada se especifican en :file:`setup.py` ::

source: Inside :file:`flask_my_extension/commands.py` you can then export a Click object::
es: Dentro de :file:`flask_my_extension/commands.py` puedes entonces exportar un objeto Click::

source: Once that package is installed in the same virtualenv as your Flask project, you can run ``flask my-command`` to invoke the command.
es: Una vez que ese paquete está instalado en el mismo virtualenv que tu proyecto Flask, puedes ejecutar ``flask my-command`` para invocar el comando.

source: Custom Scripts
es: Scripts personalizados

source: Create an instance of :class:`~cli.FlaskGroup` and pass it the factory::
es: Crea una instancia de :class:`~cli.FlaskGroup` y pásale la fábrica::

source: Define the entry point in :file:`setup.py`::
es: Definir el entry point en :file:`setup.py`::

source: Errors in Custom Scripts
es: Errores en los scripts personalizados

source: When using a custom script, if you introduce an error in your module-level code, the reloader will fail because it can no longer load the entry point.
es: Cuando se utiliza un script personalizado, si se introduce un error en el código a nivel de módulo, el recargador fallará porque ya no puede cargar el punto de entrada.

source: The ``flask`` command, being separate from your code, does not have this issue and is recommended in most cases.
es: El comando ``flask``, al estar separado de su código, no tiene este problema y se recomienda en la mayoría de los casos.

source: PyCharm Integration
es: Integración de PyCharm

source: PyCharm Professional provides a special Flask run configuration. For the Community Edition, we need to configure it to call the ``flask run`` CLI command with the correct environment variables. These instructions should be similar for any other IDE you might want to use.
es: PyCharm Professional proporciona una configuración especial para la ejecución de Flask. Para la Community Edition, necesitamos configurarlo para llamar al comando CLI ``flask run`` con las variables de entorno correctas. Estas instrucciones deberían ser similares para cualquier otro IDE que quieras utilizar.

source: In PyCharm, with your project open, click on *Run* from the menu bar and go to *Edit Configurations*. You'll be greeted by a screen similar to this:
es: En PyCharm, con tu proyecto abierto, haz clic en *Run* de la barra de menú y ve a *Edit Configurations*. Te aparecerá una pantalla similar a esta:

source: There's quite a few options to change, but once we've done it for one command, we can easily copy the entire configuration and make a single tweak to give us access to other commands, including any custom ones you may implement yourself.
es: Hay bastantes opciones para cambiar, pero una vez que lo hayamos hecho para un comando, podemos copiar fácilmente toda la configuración y hacer un solo ajuste para darnos acceso a otros comandos, incluyendo los personalizados que puedas implementar tú mismo.

source: Click the + (*Add New Configuration*) button and select *Python*. Give the configuration a name such as "flask run". For the ``flask run`` command, check "Single instance only" since you can't run the server more than once at the same time.
es: Haz clic en el botón + (*Add New Configuration*) y selecciona *Python*. Dale a la configuración un nombre como "flask run". Para el comando ``flask run``, marca "Single instance only" ya que no puedes ejecutar el servidor más de una vez al mismo tiempo.

source: Select *Module name* from the dropdown (**A**) then input ``flask``.
es: Seleccione *Module name* en el desplegable (**A**) y luego introduzca ``flask``.

source: The *Parameters* field (**B**) is set to the CLI command to execute (with any arguments). In this example we use ``run``, which will run the development server.
es: El campo *Parameters* (**B**) se establece con el comando CLI a ejecutar (con cualquier argumento). En este ejemplo usamos ``run``, que ejecutará el servidor de desarrollo.

source: You can skip this next step if you're using :ref:`dotenv`. We need to add an environment variable (**C**) to identify our application. Click on the browse button and add an entry with ``FLASK_APP`` on the left and the Python import or file on the right (``hello`` for example). Add an entry with ``FLASK_ENV`` and set it to ``development``.
es: Puedes omitir este paso si utilizas :ref:`dotenv`. Necesitamos añadir una variable de entorno (**C**) para identificar nuestra aplicación. Haz clic en el botón Examinar y añade una entrada con ``FLASK_APP`` a la izquierda y la importación o archivo de Python a la derecha (``hello`` por ejemplo). Añade una entrada con ``FLASK_ENV`` y ponla en ``development``.

source: Next we need to set the working directory (**D**) to be the folder where our application resides.
es: A continuación tenemos que establecer el directorio de trabajo (**D**) para que sea la carpeta donde reside nuestra aplicación.

source: If you have installed your project as a package in your virtualenv, you may untick the *PYTHONPATH* options (**E**). This will more accurately match how you deploy the app later.
es: Si has instalado tu proyecto como un paquete en tu virtualenv, puedes desmarcar las opciones *PYTHONPATH* (**E**). Esto se ajustará mejor a la forma de desplegar la aplicación más adelante.

source: Click *Apply* to save the configuration, or *OK* to save and close the window. Select the configuration in the main PyCharm window and click the play button next to it to run the server.
es: Haga clic en *Apply* para guardar la configuración, o en *Aceptar* para guardar y cerrar la ventana. Seleccione la configuración en la ventana principal de PyCharm y haga clic en el botón de reproducción junto a ella para ejecutar el servidor.

source: Now that we have a configuration which runs ``flask run`` from within PyCharm, we can copy that configuration and alter the *Script* argument to run a different CLI command, e.g. ``flask shell``.
es: Ahora que tenemos una configuración que ejecuta ``flask run`` desde PyCharm, podemos copiar esa configuración y alterar el argumento *Script* para ejecutar un comando CLI diferente, por ejemplo ``flask shell``.
