Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/config.po
Languages: es, fr

source: What is very popular in the Django world is to make the import explicit in the config file by adding ``from yourapplication.default_settings import *`` to the top of the file and then overriding the changes by hand. You could also inspect an environment variable like ``YOURAPPLICATION_MODE`` and set that to `production`, `development` etc and import different hard-coded files based on that.
es: Lo que es muy popular en el mundo de Django es hacer la importación explícita en el archivo de configuración añadiendo ``from yourapplication.default_settings import *`` al principio del archivo y luego anulando los cambios a mano. También puedes inspeccionar una variable de entorno como ``YOURAPPLICATION_MODE`` y establecerla como `producción`, `desarrollo`, etc. e importar diferentes archivos codificados en base a eso.
fr: Ce qui est très populaire dans le monde de Django est de rendre l'importation explicite dans le fichier de configuration en ajoutant ``from yourapplication.default_settings import *`` en haut du fichier et ensuite de remplacer les changements à la main. Vous pouvez également inspecter une variable d'environnement comme ``YOURAPPLICATION_MODE`` et la définir sur `production`, `développement`, etc. et importer différents fichiers codés en dur en fonction de cela.

source: An interesting pattern is also to use classes and inheritance for configuration::
es: Un patrón interesante es también utilizar clases y herencia para la configuración::
fr: Un modèle intéressant est également d'utiliser les classes et l'héritage pour la configuration::

source: To enable such a config you just have to call into :meth:`~flask.Config.from_object`::
es: Para habilitar una configuración de este tipo sólo tienes que llamar a :meth:`~flask.Config.from_object`::
fr: Pour activer une telle configuration, il suffit de faire appel à :meth:`~flask.Config.from_object`::

source: Note that :meth:`~flask.Config.from_object` does not instantiate the class object. If you need to instantiate the class, such as to access a property, then you must do so before calling :meth:`~flask.Config.from_object`::
es: Tenga en cuenta que :meth:`~flask.Config.from_object` no instanciará el objeto de la clase. Si necesita instanciar la clase, por ejemplo para acceder a una propiedad, debe hacerlo antes de llamar a :meth:`~flask.Config.from_object`::
fr: Notez que :meth:`~flask.Config.from_object` n'instancie pas l'objet classe. Si vous devez instancier la classe, par exemple pour accéder à une propriété, vous devez le faire avant d'appeler :meth:`~flask.Config.from_object`::

source: Instantiating the configuration object allows you to use ``@property`` in your configuration classes::
es: La instanciación del objeto de configuración le permite utilizar ``@property`` en sus clases de configuración::
fr: L'instanciation de l'objet de configuration vous permet d'utiliser ``@property`` dans vos classes de configuration::

source: There are many different ways and it's up to you how you want to manage your configuration files. However here a list of good recommendations:
es: Hay muchas maneras diferentes y depende de ti cómo quieres gestionar tus archivos de configuración. Sin embargo aquí una lista de buenas recomendaciones:
fr: Il existe de nombreuses méthodes différentes et c'est à vous de décider comment vous voulez gérer vos fichiers de configuration. Voici cependant une liste de bonnes recommandations :

source: Keep a default configuration in version control. Either populate the config with this default configuration or import it in your own configuration files before overriding values.
es: Mantenga una configuración por defecto en el control de versiones. Rellene la configuración con esta configuración por defecto o impórtela en sus propios archivos de configuración antes de anular los valores.
fr: Conservez une configuration par défaut dans le contrôle de version. Vous pouvez soit remplir la configuration avec cette configuration par défaut, soit l'importer dans vos propres fichiers de configuration avant de remplacer les valeurs.

source: Use an environment variable to switch between the configurations. This can be done from outside the Python interpreter and makes development and deployment much easier because you can quickly and easily switch between different configs without having to touch the code at all. If you are working often on different projects you can even create your own script for sourcing that activates a virtualenv and exports the development configuration for you.
es: Utilice una variable de entorno para cambiar entre las configuraciones. Esto se puede hacer desde fuera del intérprete de Python y hace que el desarrollo y el despliegue sean mucho más fáciles porque puedes cambiar rápida y fácilmente entre diferentes configuraciones sin tener que tocar el código en absoluto. Si trabajas a menudo en diferentes proyectos puedes incluso crear tu propio script para el sourcing que active un virtualenv y exporte la configuración de desarrollo por ti.
fr: Utilisez une variable d'environnement pour passer d'une configuration à l'autre. Cela peut se faire depuis l'extérieur de l'interpréteur Python et facilite grandement le développement et le déploiement car vous pouvez rapidement et facilement passer d'une configuration à l'autre sans avoir à toucher au code. Si vous travaillez souvent sur différents projets, vous pouvez même créer votre propre script pour le *sourcing* qui active un virtualenv et exporte la configuration de développement pour vous.

source: Use a tool like `fabric`_ in production to push code and configurations separately to the production server(s). For some details about how to do that, head over to the :doc:`/patterns/fabric` pattern.
es: Utiliza una herramienta como `fabric`_ en producción para enviar el código y las configuraciones por separado a los servidores de producción. Para algunos detalles sobre cómo hacerlo, dirígete al patrón :doc:`/patterns/fabric`.
fr: Utilisez un outil comme `fabric`_ en production pour pousser le code et les configurations séparément sur le(s) serveur(s) de production. Pour plus de détails sur la façon de procéder, consultez le modèle :doc:`/patterns/fabric`.

source: Instance Folders
es: Carpetas de instancias
fr: Dossiers d'instance

source: Flask 0.8 introduces instance folders. Flask for a long time made it possible to refer to paths relative to the application's folder directly (via :attr:`Flask.root_path`). This was also how many developers loaded configurations stored next to the application. Unfortunately however this only works well if applications are not packages in which case the root path refers to the contents of the package.
es: Flask 0.8 introduce las carpetas de instancia. Durante mucho tiempo Flask hizo posible referirse a rutas relativas a la carpeta de la aplicación directamente (a través de :attr:`Flask.root_path`). Así era también como muchos desarrolladores cargaban las configuraciones almacenadas junto a la aplicación. Sin embargo, lamentablemente esto sólo funciona bien si las aplicaciones no son paquetes, en cuyo caso la ruta raíz se refiere al contenido del paquete.
fr: Flask 0.8 introduit les dossiers d'instance. Pendant longtemps, Flask permettait de se référer directement aux chemins relatifs au dossier de l'application (via :attr:`Flask.root_path`). C'était aussi la façon dont de nombreux développeurs chargeaient les configurations stockées à côté de l'application. Malheureusement, cela ne fonctionne bien que si les applications ne sont pas des paquets, auquel cas le chemin racine fait référence au contenu du paquet.

source: With Flask 0.8 a new attribute was introduced: :attr:`Flask.instance_path`. It refers to a new concept called the “instance folder”. The instance folder is designed to not be under version control and be deployment specific. It's the perfect place to drop things that either change at runtime or configuration files.
es: Con Flask 0.8 se introdujo un nuevo atributo: :attr:`Flask.instance_path`. Hace referencia a un nuevo concepto llamado “carpeta de instancia”. La carpeta de instancia está diseñada para no estar bajo control de versiones y ser específica para el despliegue. Es el lugar perfecto para dejar cosas que cambian en tiempo de ejecución o archivos de configuración.
fr: Avec Flask 0.8, un nouvel attribut a été introduit::attr:`Flask.instance_path`. Il fait référence à un nouveau concept appelé "dossier d'instance". Le dossier d'instance est conçu pour ne pas être sous contrôle de version et être spécifique au déploiement. C'est l'endroit parfait pour déposer des choses qui changent au moment de l'exécution ou des fichiers de configuration.

source: You can either explicitly provide the path of the instance folder when creating the Flask application or you can let Flask autodetect the instance folder. For explicit configuration use the `instance_path` parameter::
es: Puedes proporcionar explícitamente la ruta de la carpeta de instancia cuando creas la aplicación Flask o puedes dejar que Flask autodetecte la carpeta de instancia. Para la configuración explícita utilice el parámetro `instance_path`::
fr: Vous pouvez soit fournir explicitement le chemin du dossier de l'instance lors de la création de l'application Flask ou vous pouvez laisser Flask détecter automatiquement le dossier de l'instance. Pour une configuration explicite, utilisez le paramètre `instance_path`::

source: Please keep in mind that this path *must* be absolute when provided.
es: Por favor, tenga en cuenta que esta ruta *debe* ser absoluta cuando se proporciona.
fr: Gardez à l'esprit que ce chemin *doit* être absolu lorsqu'il est fourni.

source: If the `instance_path` parameter is not provided the following default locations are used:
es: Si no se proporciona el parámetro `instance_path` se utilizan las siguientes ubicaciones por defecto:
fr: Si le paramètre `instance_path` n'est pas fourni, les emplacements par défaut suivants sont utilisés :

source: Uninstalled module::
es: Módulo desinstalado::
fr: Module désinstallé::

source: Uninstalled package::
es: Paquete desinstalado::
fr: Paquet désinstallé::

source: Installed module or package::
es: Módulo o paquete instalado::
fr: Module ou paquet installé::

source: ``$PREFIX`` is the prefix of your Python installation. This can be ``/usr`` or the path to your virtualenv. You can print the value of ``sys.prefix`` to see what the prefix is set to.
es: ``$PREFIX`` es el prefijo de tu instalación de Python. Puede ser ``/usr`` o la ruta de tu virtualenv. Puedes imprimir el valor de ``sys.prefix`` para ver cuál es el prefijo establecido.
fr: ``$PREFIX`` est le préfixe de votre installation Python. Cela peut être ``/usr`` ou le chemin vers votre virtualenv. Vous pouvez afficher la valeur de ``sys.prefix`` pour voir à quoi correspond le préfixe.

source: Since the config object provided loading of configuration files from relative filenames we made it possible to change the loading via filenames to be relative to the instance path if wanted. The behavior of relative paths in config files can be flipped between “relative to the application root” (the default) to “relative to instance folder” via the `instance_relative_config` switch to the application constructor::
es: Dado que el objeto config proporcionaba la carga de archivos de configuración a partir de nombres de archivo relativos, hemos hecho posible cambiar la carga a través de los nombres de archivo para que sea relativa a la ruta de la instancia si se desea. El comportamiento de las rutas relativas en los archivos de configuración puede cambiarse entre "relativo a la raíz de la aplicación" (por defecto) y "relativo a la carpeta de la instancia" a través del interruptor `instance_relative_config` del constructor de la aplicación::
fr: Puisque l'objet config permet le chargement de fichiers de configuration à partir de noms de fichiers relatifs, nous avons fait en sorte qu'il soit possible de changer le chargement via les noms de fichiers pour qu'il soit relatif au chemin de l'instance si on le souhaite. Le comportement des chemins relatifs dans les fichiers de configuration peut être basculé entre "relatif à la racine de l'application" (par défaut) et "relatif au dossier de l'instance" via le commutateur `instance_relative_config` du constructeur de l'application::

source: Here is a full example of how to configure Flask to preload the config from a module and then override the config from a file in the instance folder if it exists::
es: Aquí hay un ejemplo completo de cómo configurar Flask para precargar la configuración de un módulo y luego anular la configuración de un archivo en la carpeta de instancia si existe::
fr: Voici un exemple complet de la façon de configurer Flask pour précharger la configuration d'un module et ensuite remplacer la configuration d'un fichier dans le dossier de l'instance s'il existe::

source: The path to the instance folder can be found via the :attr:`Flask.instance_path`. Flask also provides a shortcut to open a file from the instance folder with :meth:`Flask.open_instance_resource`.
es: La ruta de acceso a la carpeta de instancias se puede encontrar a través de :attr:`Flask.instance_path`. Flask también proporciona un acceso directo para abrir un archivo de la carpeta de instancia con :meth:`Flask.open_instance_resource`.
fr: Le chemin d'accès au dossier de l'instance peut être trouvé via l'attribut :attr:`Flask.instance_path`. Flask fournit également un raccourci pour ouvrir un fichier depuis le dossier d'instance avec :meth:`Flask.open_instance_resource`.

source: Example usage for both::
es: Ejemplo de uso de ambos::
fr: Exemple d'utilisation pour les deux::
