Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/config.po
Languages: es, fr

source: When serving files, set the cache control max age to this number of seconds. Can be a :class:`datetime.timedelta` or an ``int``. Override this value on a per-file basis using :meth:`~flask.Flask.get_send_file_max_age` on the application or blueprint.
es: Cuando se sirven archivos, establece la edad máxima del control de la caché a este número de segundos. Puede ser un :class:`datetime.timedelta` o un ``int``. Anula este valor en base a cada archivo usando :meth:`~flask.Flask.get_send_file_max_age` en la aplicación o blueprint.
fr: Lorsque vous servez des fichiers, définissez l'âge maximal du contrôle du cache à ce nombre de secondes. Peut être une :class:`datetime.timedelta` ou un ``int``. Remplacez cette valeur pour chaque fichier en utilisant :meth:`~flask.Flask.get_send_file_max_age` sur l'application ou le *blueprint*.

source: If ``None``, ``send_file`` tells the browser to use conditional requests will be used instead of a timed cache, which is usually preferable.
es: Si es ``None``, ``send_file`` indica al navegador que se utilizarán peticiones condicionales en lugar de una caché temporizada, lo que suele ser preferible.
fr: Si ``None``, ``send_file`` indique au navigateur d'utiliser des requêtes conditionnelles qui seront utilisées au lieu d'un cache temporisé, ce qui est généralement préférable.

source: Inform the application what host and port it is bound to. Required for subdomain route matching support.
es: Informa a la aplicación de a qué host y puerto está vinculada. Necesario para el soporte de coincidencia de rutas de subdominio.
fr: Indique à l'application à quel hôte et à quel port elle est liée. Nécessaire pour la prise en charge de la correspondance des routes entre les sous-domaines.

source: If set, will be used for the session cookie domain if :data:`SESSION_COOKIE_DOMAIN` is not set. Modern web browsers will not allow setting cookies for domains without a dot. To use a domain locally, add any names that should route to the app to your ``hosts`` file. ::
es: Si se establece, se utilizará para el dominio de la cookie de sesión si :data:`SESSION_COOKIE_DOMAIN` no se establece. Los navegadores web modernos no permiten establecer cookies para dominios sin un punto. Para utilizar un dominio localmente, añada cualquier nombre que deba dirigirse a la aplicación a su archivo ``hosts``. ::
fr: S'il est défini, il sera utilisé pour le domaine du cookie de session si :data:`SESSION_COOKIE_DOMAIN` n'est pas défini. Les navigateurs Web modernes ne permettent pas de définir des cookies pour les domaines sans point. Pour utiliser un domaine localement, ajoutez tous les noms qui doivent être dirigés vers l'application à votre fichier ``hosts``.::

source: If set, ``url_for`` can generate external URLs with only an application context instead of a request context.
es: Si se establece, ``url_for`` puede generar URLs externas con sólo un contexto de aplicación en lugar de un contexto de solicitud.
fr: S'il est défini, ``url_for`` peut générer des URLs externes avec seulement un contexte d'application au lieu d'un contexte de requête.

source: Inform the application what path it is mounted under by the application / web server. This is used for generating URLs outside the context of a request (inside a request, the dispatcher is responsible for setting ``SCRIPT_NAME`` instead; see :doc:`/patterns/appdispatch` for examples of dispatch configuration).
es: Informa a la aplicación de la ruta en la que está montada por la aplicación/servidor web. Esto se utiliza para generar URLs fuera del contexto de una solicitud (dentro de una solicitud, el despachador es responsable de establecer ``SCRIPT_NAME`` en su lugar; ver :doc:`/patterns/appdispatch` para ejemplos de configuración de despachos)
fr: Informe l'application du chemin sous lequel elle est montée par l'application / le serveur web. Ceci est utilisé pour générer des URL en dehors du contexte d'une requête (à l'intérieur d'une requête, le distributeur est responsable de la définition de ``SCRIPT_NAME`` à la place ; voir :doc:`/patterns/appdispatch` pour des exemples de configuration du distributeur).

source: Will be used for the session cookie path if ``SESSION_COOKIE_PATH`` is not set.
es: Se utilizará para la ruta de la cookie de sesión si ``SESSION_COOKIE_PATH`` no se establece.
fr: Sera utilisé pour le chemin du cookie de session si ``SESSION_COOKIE_PATH`` n'est pas défini.

source: Default: ``'/'``
es: Por defecto: ``'/'``
fr: Valeur par défaut : ``'/'``

source: Use this scheme for generating external URLs when not in a request context.
es: Utilice este esquema para generar URLs externas cuando no esté en un contexto de solicitud.
fr: Utilisez ce schéma pour générer des URL externes lorsqu'elles ne sont pas dans un contexte de demande.

source: Default: ``'http'``
es: Por defecto: ``'http'``
fr: Valeur par défaut : ``'http'``

source: Don't read more than this many bytes from the incoming request data. If not set and the request does not specify a ``CONTENT_LENGTH``, no data will be read for security.
es: No leer más de esta cantidad de bytes de los datos de la solicitud entrante. Si no se establece y la solicitud no especifica un ``CONTENT_LENGTH``, no se leerá ningún dato por seguridad.
fr: Ne pas lire plus de ce nombre d'octets dans les données de la requête entrante. S'il n'est pas défini et que la requête ne spécifie pas de ``CONTENT_LENGTH``, aucune donnée ne sera lue par sécurité.

source: Serialize objects to ASCII-encoded JSON. If this is disabled, the JSON returned from ``jsonify`` will contain Unicode characters. This has security implications when rendering the JSON into JavaScript in templates, and should typically remain enabled.
es: Serializa objetos a JSON codificado en ASCII. Si se desactiva, el JSON devuelto por ``jsonify`` contendrá caracteres Unicode. Esto tiene implicaciones de seguridad al renderizar el JSON en JavaScript en las plantillas, y normalmente debería permanecer activado.
fr: Sérialise les objets en JSON encodé en ASCII. Si cette option est désactivée, le JSON renvoyé par ``jsonify`` contiendra des caractères Unicode. Cela a des implications en matière de sécurité lors du rendu du JSON en JavaScript dans les modèles, et devrait typiquement rester activé.

source: Sort the keys of JSON objects alphabetically. This is useful for caching because it ensures the data is serialized the same way no matter what Python's hash seed is. While not recommended, you can disable this for a possible performance improvement at the cost of caching.
es: Ordena las claves de los objetos JSON alfabéticamente. Esto es útil para el almacenamiento en caché porque asegura que los datos se serializan de la misma manera sin importar cuál es la semilla hash de Python. Aunque no se recomienda, se puede deshabilitar para una posible mejora del rendimiento a costa del almacenamiento en caché.
fr: Trie les clés des objets JSON par ordre alphabétique. Cette fonction est utile pour la mise en cache car elle garantit que les données sont sérialisées de la même manière, quelle que soit la graine de hachage de Python. Bien que cela ne soit pas recommandé, vous pouvez désactiver cette fonction pour améliorer les performances au détriment de la mise en cache.

source: ``jsonify`` responses will be output with newlines, spaces, and indentation for easier reading by humans. Always enabled in debug mode.
es: Las respuestas de ``jsonify`` serán emitidas con nuevas líneas, espacios y sangría para facilitar la lectura por parte de los humanos. Siempre se activa en modo de depuración.
fr: Les réponses ``jsonify`` seront affichées avec des nouvelles lignes, des espaces et des indentations pour une lecture plus facile par les humains. Toujours activé en mode débogage.

source: The mimetype of ``jsonify`` responses.
es: El mimetype de las respuestas ``jsonify``.
fr: Le mimetype des réponses ``jsonify``.

source: Default: ``'application/json'``
es: Por defecto: ``'application/json'``
fr: Valeur par défaut : ``application/json``

source: Reload templates when they are changed. If not set, it will be enabled in debug mode.
es: Recarga las plantillas cuando se modifican. Si no se establece, se habilitará en modo de depuración.
fr: Recharge les modèles lorsqu'ils sont modifiés. Si elle n'est pas définie, elle sera activée en mode débogage.

source: Log debugging information tracing how a template file was loaded. This can be useful to figure out why a template was not loaded or the wrong file appears to be loaded.
es: Registra la información de depuración que rastrea cómo se cargó un archivo de plantilla. Esto puede ser útil para averiguar por qué no se ha cargado una plantilla o parece que se ha cargado un archivo incorrecto.
fr: Journalise les informations de débogage retraçant la façon dont un fichier modèle a été chargé. Cela peut être utile pour comprendre pourquoi un modèle n'a pas été chargé ou pourquoi le mauvais fichier semble avoir été chargé.

source: Warn if cookie headers are larger than this many bytes. Defaults to ``4093``. Larger cookies may be silently ignored by browsers. Set to ``0`` to disable the warning.
es: Avisa si las cabeceras de las cookies son mayores que esta cantidad de bytes. Por defectos a ``4093``. Las cookies más grandes pueden ser ignoradas silenciosamente por los navegadores. Establezca ``0`` para desactivar la advertencia.
fr: Averti si les en-têtes de cookie sont plus grands que ce nombre d'octets. La valeur par défaut est ``4093``. Les cookies de grande taille peuvent être ignorés en silence par les navigateurs. Définissez cette valeur à "0" pour désactiver l'avertissement.

source: ``LOGGER_NAME`` and ``LOGGER_HANDLER_POLICY`` were removed. See :doc:`/logging` for information about configuration.
es: Se han eliminado ``LOGGER_NAME`` y ``LOGGER_HANDLER_POLICY``. Consulte :doc:`/logging` para obtener información sobre la configuración.
fr: ``LOGGER_NAME`` et ``LOGGER_HANDLER_POLICY`` ont été supprimés. Voir :doc:`/logging` pour des informations sur la configuration.

source: Added :data:`ENV` to reflect the :envvar:`FLASK_ENV` environment variable.
es: Se ha añadido :data:`ENV` para reflejar la variable de entorno :envvar:`FLASK_ENV`.
fr: Ajout de :data:`ENV` pour refléter la variable d'environnement :envvar:`FLASK_ENV`.

source: Added :data:`SESSION_COOKIE_SAMESITE` to control the session cookie's ``SameSite`` option.
es: Añadido :data:`SESSION_COOKIE_SAMESITE` para controlar la opción ``SameSite`` de la cookie de sesión.
fr: Ajout de :data:`SESSION_COOKIE_SAMESITE` pour contrôler l'option ``SameSite`` du cookie de session.

source: Added :data:`MAX_COOKIE_SIZE` to control a warning from Werkzeug.
es: Añadido :data:`MAX_COOKIE_SIZE` para controlar un aviso de Werkzeug.
fr: Ajouté :data:`MAX_COOKIE_SIZE` pour contrôler un avertissement de Werkzeug.

source: ``PREFERRED_URL_SCHEME``
fr: SCHÉMA D'URL PRÉFÉRÉE

source: Configuring from Python Files
es: Configuración desde archivos Python
fr: Configuration à partir de fichiers Python

source: Configuration becomes more useful if you can store it in a separate file, ideally located outside the actual application package. This makes packaging and distributing your application possible via various package handling tools (:doc:`/patterns/distribute`) and finally modifying the configuration file afterwards.
es: La configuración se vuelve más útil si puedes almacenarla en un archivo separado, idealmente ubicado fuera del paquete de la aplicación real. Esto hace posible empaquetar y distribuir tu aplicación a través de varias herramientas de manejo de paquetes (:doc:`/patterns/distribute`) y finalmente modificar el archivo de configuración después.
fr: La configuration devient plus utile si vous pouvez la stocker dans un fichier séparé, idéalement situé en dehors du paquet réel de l'application. Cela rend possible l'empaquetage et la distribution de votre application via divers outils de gestion de paquets (:doc:`/patterns/distribute`) et enfin la modification du fichier de configuration par la suite.

source: So a common pattern is this::
es: Así que un patrón común es este::
fr: Un modèle commun est donc le suivant::

source: This first loads the configuration from the `yourapplication.default_settings` module and then overrides the values with the contents of the file the :envvar:`YOURAPPLICATION_SETTINGS` environment variable points to. This environment variable can be set in the shell before starting the server:
es: Primero se carga la configuración del módulo `tuaplicacion.default_settings` y luego se sustituyen los valores por el contenido del archivo al que apunta la variable de entorno :envvar:`TUAPLICACION_SETTINGS`. Esta variable de entorno se puede establecer en el shell antes de iniciar el servidor:
fr: Il charge d'abord la configuration du module `yourapplication.default_settings`, puis remplace les valeurs par le contenu du fichier vers lequel pointe la variable d'environnement :envvar:`YOURAPPLICATION_SETTINGS`. Cette variable d'environnement peut être définie dans le shell avant de démarrer le serveur :

source: The configuration files themselves are actual Python files. Only values in uppercase are actually stored in the config object later on. So make sure to use uppercase letters for your config keys.
es: Los propios archivos de configuración son archivos reales de Python. Sólo los valores en mayúsculas se almacenan en el objeto config más tarde. Así que asegúrese de usar letras mayúsculas para sus claves de configuración.
fr: Les fichiers de configuration eux-mêmes sont de véritables fichiers Python. Seules les valeurs en majuscules sont stockées dans l'objet config par la suite. Veillez donc à utiliser des lettres majuscules pour vos clés de configuration.

source: Here is an example of a configuration file::
es: Aquí hay un ejemplo de un archivo de configuración::
fr: Voici un exemple de fichier de configuration::

source: Make sure to load the configuration very early on, so that extensions have the ability to access the configuration when starting up. There are other methods on the config object as well to load from individual files. For a complete reference, read the :class:`~flask.Config` object's documentation.
es: Asegúrese de cargar la configuración muy pronto, para que las extensiones tengan la capacidad de acceder a la configuración cuando se inicie. También hay otros métodos en el objeto config para cargar desde archivos individuales. Para una referencia completa, lea la documentación del objeto :class:`~flask.Config`.
fr: Veillez à charger la configuration très tôt, afin que les extensions aient la possibilité d'y accéder au démarrage. Il existe d'autres méthodes sur l'objet config pour charger des fichiers individuels. Pour une référence complète, lisez la documentation de l'objet :class:`~flask.Config`.

source: Configuring from Data Files
es: Configuración a partir de archivos de datos
fr: Configuration à partir de fichiers de données

source: It is also possible to load configuration from a file in a format of your choice using :meth:`~flask.Config.from_file`. For example to load from a TOML file:
es: También es posible cargar la configuración desde un archivo en un formato de su elección utilizando :meth:`~flask.Config.from_file`. Por ejemplo, para cargar desde un archivo TOML:
fr: Il est également possible de charger la configuration depuis un fichier dans le format de votre choix en utilisant :meth:`~flask.Config.from_file`. Par exemple, pour charger depuis un fichier TOML :

source: Or from a JSON file:
es: O desde un archivo JSON:
fr: Ou à partir d'un fichier JSON :

source: Configuring from Environment Variables
es: Configuración desde las variables de entorno
fr: Configuration à partir de variables d'environnement

source: In addition to pointing to configuration files using environment variables, you may find it useful (or necessary) to control your configuration values directly from the environment.
es: Además de apuntar a los archivos de configuración utilizando variables de entorno, puede resultar útil (o necesario) controlar sus valores de configuración directamente desde el entorno.
fr: En plus de pointer vers des fichiers de configuration à l'aide de variables d'environnement, vous pouvez trouver utile (ou nécessaire) de contrôler vos valeurs de configuration directement depuis l'environnement.

source: Environment variables can be set in the shell before starting the server:
es: Las variables de entorno pueden establecerse en el shell antes de iniciar el servidor:
fr: Les variables d'environnement peuvent être définies dans le shell avant de démarrer le serveur :

source: While this approach is straightforward to use, it is important to remember that environment variables are strings -- they are not automatically deserialized into Python types.
es: Aunque este enfoque es sencillo de utilizar, es importante recordar que las variables de entorno son cadenas de texto, no se deserializan automáticamente en tipos de Python.
fr: Bien que cette approche soit simple à utiliser, il est important de se rappeler que les variables d'environnement sont des chaînes de caractères -- elles ne sont pas automatiquement désérialisées en types Python.

source: Here is an example of a configuration file that uses environment variables::
es: Este es un ejemplo de un archivo de configuración que utiliza variables de entorno::
fr: Voici un exemple de fichier de configuration qui utilise des variables d'environnement::

source: Notice that any value besides an empty string will be interpreted as a boolean ``True`` value in Python, which requires care if an environment explicitly sets values intended to be ``False``.
es: Tenga en cuenta que cualquier valor que no sea una cadena vacía se interpretará como un valor booleano ``True`` en Python, lo que requiere cuidado si un entorno establece explícitamente valores destinados a ser ``False``.
fr: Notez que toute valeur autre qu'une chaîne vide sera interprétée comme une valeur booléenne ``True`` en Python, ce qui nécessite de faire attention si un environnement définit explicitement des valeurs destinées à être ``False``.

source: Make sure to load the configuration very early on, so that extensions have the ability to access the configuration when starting up. There are other methods on the config object as well to load from individual files. For a complete reference, read the :class:`~flask.Config` class documentation.
es: Asegúrese de cargar la configuración muy pronto, para que las extensiones tengan la capacidad de acceder a la configuración cuando se inicie. También hay otros métodos en el objeto config para cargar desde archivos individuales. Para una referencia completa, lea la documentación de la clase :class:`~flask.Config`.
fr: Veillez à charger la configuration très tôt, afin que les extensions aient la possibilité d'y accéder au démarrage. Il existe d'autres méthodes sur l'objet config pour charger des fichiers individuels. Pour une référence complète, lisez la documentation de la classe :class:`~flask.Config`.

source: Configuration Best Practices
es: Mejores prácticas de configuración
fr: Meilleures pratiques de configuration

source: The downside with the approach mentioned earlier is that it makes testing a little harder. There is no single 100% solution for this problem in general, but there are a couple of things you can keep in mind to improve that experience:
es: El inconveniente del enfoque mencionado anteriormente es que hace que las pruebas sean un poco más difíciles. No hay una solución única al 100% para este problema en general, pero hay un par de cosas que puedes tener en cuenta para mejorar esa experiencia:
fr: L'inconvénient de l'approche mentionnée plus haut est qu'elle rend les tests un peu plus difficiles. Il n'y a pas de solution unique pour ce problème en général, mais il y a quelques éléments que vous pouvez garder à l'esprit pour améliorer cette expérience :

source: Create your application in a function and register blueprints on it. That way you can create multiple instances of your application with different configurations attached which makes unit testing a lot easier. You can use this to pass in configuration as needed.
es: Cree su aplicación en una función y registre los blueprints en ella. De esta manera puedes crear múltiples instancias de tu aplicación con diferentes configuraciones adjuntas lo que hace que las pruebas unitarias sean mucho más fáciles. Puedes usar esto para pasar la configuración según sea necesario.
fr: Créez votre application dans une fonction et enregistrez des blueprints sur celle-ci. De cette façon, vous pouvez créer plusieurs instances de votre application avec différentes configurations attachées, ce qui facilite grandement les tests unitaires. Vous pouvez utiliser cette fonction pour transmettre la configuration si nécessaire.

source: Do not write code that needs the configuration at import time. If you limit yourself to request-only accesses to the configuration you can reconfigure the object later on as needed.
es: No escriba código que necesite la configuración en el momento de la importación. Si te limitas a los accesos de sólo petición a la configuración, puedes reconfigurar el objeto más tarde según sea necesario.
fr: N'écrivez pas de code qui a besoin de la configuration au moment de l'importation. Si vous vous limitez à des accès sur demande à la configuration, vous pourrez reconfigurer l'objet ultérieurement si nécessaire.

source: Development / Production
es: Desarrollo / Producción
fr: Développement / Production

source: Most applications need more than one configuration. There should be at least separate configurations for the production server and the one used during development. The easiest way to handle this is to use a default configuration that is always loaded and part of the version control, and a separate configuration that overrides the values as necessary as mentioned in the example above::
es: La mayoría de las aplicaciones necesitan más de una configuración. Debería haber al menos configuraciones separadas para el servidor de producción y el utilizado durante el desarrollo. La forma más fácil de manejar esto es utilizar una configuración por defecto que siempre se carga y forma parte del control de versiones, y una configuración separada que anula los valores según sea necesario como se menciona en el ejemplo anterior::
fr: La plupart des applications nécessitent plus d'une configuration. Il doit y avoir au moins des configurations distinctes pour le serveur de production et celui utilisé pendant le développement. La manière la plus simple de gérer cela est d'utiliser une configuration par défaut qui est toujours chargée et fait partie du contrôle de version, et une configuration séparée qui remplace les valeurs si nécessaire comme mentionné dans l'exemple ci-dessus::

source: Then you just have to add a separate :file:`config.py` file and export ``YOURAPPLICATION_SETTINGS=/path/to/config.py`` and you are done. However there are alternative ways as well. For example you could use imports or subclassing.
es: Entonces sólo tienes que añadir un archivo :file:`config.py` separado y exportar ``TUAPLICACION_SETTINGS=/ruta/al/config.py`` y ya está. Sin embargo, también hay formas alternativas. Por ejemplo, puedes usar importaciones o subclases.
fr: Il vous suffit alors d'ajouter un fichier séparé :file:`config.py` et d'exporter ``YOURAPPLICATION_SETTINGS=/path/to/config.py`` et vous avez terminé. Cependant, il existe aussi d'autres moyens. Par exemple, vous pouvez utiliser les importations ou les sous-classes.
