Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/config.po
Languages: es, fr

source: Configuration Handling
es: Manejo de la configuración
fr: Gestion de la configuration

source: Applications need some kind of configuration. There are different settings you might want to change depending on the application environment like toggling the debug mode, setting the secret key, and other such environment-specific things.
es: Las aplicaciones necesitan algún tipo de configuración. Hay diferentes configuraciones que puedes querer cambiar dependiendo del entorno de la aplicación, como activar el modo de depuración, establecer la clave secreta, y otras cosas específicas del entorno.
fr: Les applications ont besoin d'une certaine forme de configuration. Il existe différents paramètres que vous pouvez vouloir modifier en fonction de l'environnement de l'application, comme l'activation du mode de débogage, la définition de la clé secrète et d'autres éléments spécifiques à l'environnement.

source: The way Flask is designed usually requires the configuration to be available when the application starts up. You can hard code the configuration in the code, which for many small applications is not actually that bad, but there are better ways.
es: La forma en que Flask está diseñado normalmente requiere que la configuración esté disponible cuando la aplicación se inicia. Puedes codificar la configuración en el código, lo que para muchas aplicaciones pequeñas no es realmente tan malo, pero hay mejores maneras.
fr: La façon dont Flask est conçu nécessite généralement que la configuration soit disponible au démarrage de l'application. Vous pouvez coder en dur la configuration dans le code, ce qui, pour de nombreuses petites applications, n'est pas si mal, mais il existe de meilleures méthodes.

source: Independent of how you load your config, there is a config object available which holds the loaded configuration values: The :attr:`~flask.Flask.config` attribute of the :class:`~flask.Flask` object. This is the place where Flask itself puts certain configuration values and also where extensions can put their configuration values. But this is also where you can have your own configuration.
es: Independientemente de cómo se cargue la configuración, hay un objeto config disponible que contiene los valores de configuración cargados: El atributo :attr:`~flask.Flask.config` del objeto :class:`~flask.Flask`. Este es el lugar donde Flask mismo pone ciertos valores de configuración y también donde las extensiones pueden poner sus valores de configuración. Pero también es donde puedes tener tu propia configuración.
fr: Indépendamment de la façon dont vous chargez votre configuration, il y a un objet config disponible qui contient les valeurs de la configuration chargée: l'attribut :attr:`~flask.Flask.config` de l'objet :class:`~flask.Flask`. C'est l'endroit où Flask lui-même met certaines valeurs de configuration et aussi où les extensions peuvent mettre leurs valeurs de configuration. Mais c'est aussi l'endroit où vous pouvez avoir votre propre configuration.

source: Configuration Basics
es: Conceptos básicos de configuración
fr: Principes de base de la configuration

source: The :attr:`~flask.Flask.config` is actually a subclass of a dictionary and can be modified just like any dictionary::
es: El :attr:`~flask.Flask.config` es en realidad una subclase de un diccionario y puede ser modificado como cualquier diccionario::
fr: La :attr:`~flask.Flask.config` est en fait une sous-classe d'un dictionnaire et peut être modifiée comme tout dictionnaire::

source: Certain configuration values are also forwarded to the :attr:`~flask.Flask` object so you can read and write them from there::
es: Ciertos valores de configuración también se envían al objeto :attr:`~flask.Flask` para que puedas leerlos y escribirlos desde allí::
fr: Certaines valeurs de configuration sont également transmises à l'objet :attr:`~flask.Flask` afin que vous puissiez les lire et les écrire à partir de là::

source: To update multiple keys at once you can use the :meth:`dict.update` method::
es: Para actualizar varias claves a la vez se puede utilizar el método :meth:`dict.update`::
fr: Pour mettre à jour plusieurs clés à la fois, vous pouvez utiliser la méthode :meth:`dict.update`::

source: Environment and Debug Features
es: Características de entorno y depuración
fr: Environnement et fonctions de débogage

source: The :data:`ENV` and :data:`DEBUG` config values are special because they may behave inconsistently if changed after the app has begun setting up. In order to set the environment and debug mode reliably, Flask uses environment variables.
es: Los valores de configuración :data:`ENV` y :data:`DEBUG` son especiales porque pueden comportarse de forma inconsistente si se cambian después de que la aplicación haya empezado a configurarse. Para establecer el entorno y el modo de depuración de forma fiable, Flask utiliza variables de entorno.
fr: Les valeurs de configuration :data:`ENV` et :data:`DEBUG` sont spéciales car elles peuvent se comporter de manière incohérente si elles sont modifiées après le début de l'installation de l'application. Afin de définir l'environnement et le mode de débogage de manière fiable, Flask utilise des variables d'environnement.

source: The environment is used to indicate to Flask, extensions, and other programs, like Sentry, what context Flask is running in. It is controlled with the :envvar:`FLASK_ENV` environment variable and defaults to ``production``.
es: El entorno se utiliza para indicar a Flask, las extensiones y otros programas, como Sentry, en qué contexto se está ejecutando Flask. Se controla con la variable de entorno :envvar:`FLASK_ENV` y por defecto es ``producción``.
fr: L'environnement est utilisé pour indiquer à Flask, aux extensions et aux autres programmes, comme Sentry, dans quel contexte Flask est exécuté. Il est contrôlé par la variable d'environnement :envvar:`FLASK_ENV` et a pour valeur par défaut ``production``.

source: Setting :envvar:`FLASK_ENV` to ``development`` will enable debug mode. ``flask run`` will use the interactive debugger and reloader by default in debug mode. To control this separately from the environment, use the :envvar:`FLASK_DEBUG` flag.
es: Poniendo :envvar:`FLASK_ENV` en ``desarrollo`` se activará el modo de depuración. ``flask run`` utilizará el depurador interactivo y el recargador por defecto en modo de depuración. Para controlar esto por separado del entorno, utilice la bandera :envvar:`FLASK_DEBUG`.
fr: Définir :envvar:`FLASK_ENV` à ``développement`` activera le mode débogage. ``flask run`` utilisera le débogueur interactif et le *reloader* par défaut en mode débogage. Pour contrôler cela séparément de l'environnement, utilisez l'option :envvar:`FLASK_DEBUG`.

source: Added :envvar:`FLASK_ENV` to control the environment separately from debug mode. The development environment enables debug mode.
es: Se ha añadido :envvar:`FLASK_ENV` para controlar el entorno por separado del modo de depuración. El entorno de desarrollo habilita el modo de depuración.
fr: Ajout de :envvar:`FLASK_ENV` pour contrôler l'environnement séparément du mode de débogage. L'environnement de développement active le mode de débogage.

source: To switch Flask to the development environment and enable debug mode, set :envvar:`FLASK_ENV`:
es: Para cambiar Flask al entorno de desarrollo y habilitar el modo de depuración, establezca :envvar:`FLASK_ENV`:
fr: Pour basculer Flask dans l'environnement de développement et activer le mode débogage, définissez :envvar:`FLASK_ENV` :

source: Using the environment variables as described above is recommended. While it is possible to set :data:`ENV` and :data:`DEBUG` in your config or code, this is strongly discouraged. They can't be read early by the ``flask`` command, and some systems or extensions may have already configured themselves based on a previous value.
es: Se recomienda utilizar las variables de entorno como se ha descrito anteriormente. Aunque es posible establecer :data:`ENV` y :data:`DEBUG` en su configuración o código, se desaconseja encarecidamente hacerlo. No pueden ser leídas antes por el comando ``flask``, y algunos sistemas o extensiones pueden haberse configurado ya en base a un valor anterior.
fr: Il est recommandé d'utiliser les variables d'environnement comme décrit ci-dessus. Bien qu'il soit possible de définir :data:`ENV` et :data:`DEBUG` dans votre configuration ou votre code, cela est fortement déconseillé. Elles ne peuvent pas être lues précocement par la commande ``flask``, et certains systèmes ou extensions peuvent s'être déjà configurés sur la base d'une valeur précédente.

source: Builtin Configuration Values
es: Valores de configuración incorporados
fr: Valeurs de configuration intégrées

source: The following configuration values are used internally by Flask:
es: Los siguientes valores de configuración son utilizados internamente por Flask:
fr: Les valeurs de configuration suivantes sont utilisées en interne par Flask :

source: What environment the app is running in. Flask and extensions may enable behaviors based on the environment, such as enabling debug mode. The :attr:`~flask.Flask.env` attribute maps to this config key. This is set by the :envvar:`FLASK_ENV` environment variable and may not behave as expected if set in code.
es: En qué entorno se está ejecutando la aplicación. Flask y las extensiones pueden habilitar comportamientos basados en el entorno, como habilitar el modo de depuración. El atributo :attr:`~flask.Flask.env` se asigna a esta clave de configuración. Esto es establecido por la variable de entorno :envvar:`FLASK_ENV` y puede no comportarse como se espera si se establece en el código.
fr: L'environnement dans lequel l'application est exécutée. Flask et les extensions peuvent activer des comportements basés sur l'environnement, comme l'activation du mode débogage. L'attribut :attr:`~flask.Flask.env` correspond à cette clé de configuration. Elle est définie par la variable d'environnement :envvar:`FLASK_ENV` et peut ne pas se comporter comme prévu si elle est définie dans le code.

source: **Do not enable development when deploying in production.**
es: **No activar el desarrollo cuando se despliega en producción.**
fr: **Ne pas activer le mode développement lors du déploiement en production.**

source: Default: ``'production'``
es: Por defecto: ``'producción'``
fr: Valeur par défaut : ``production``

source: Whether debug mode is enabled. When using ``flask run`` to start the development server, an interactive debugger will be shown for unhandled exceptions, and the server will be reloaded when code changes. The :attr:`~flask.Flask.debug` attribute maps to this config key. This is enabled when :data:`ENV` is ``'development'`` and is overridden by the ``FLASK_DEBUG`` environment variable. It may not behave as expected if set in code.
es: Si el modo de depuración está activado. Cuando se utiliza ``flask run`` para iniciar el servidor de desarrollo, se mostrará un depurador interactivo para las excepciones no manejadas, y el servidor se recargará cuando el código cambie. El atributo :attr:`~flask.Flask.debug` se asigna a esta clave de configuración. Se activa cuando :data:`ENV` es ``'development'`` y se anula con la variable de entorno ``FLASK_DEBUG``. Puede que no se comporte como se espera si se establece en el código.
fr: Si le mode de débogage est activé. Lorsque vous utilisez ``flask run`` pour démarrer le serveur de développement, un débogueur interactif sera affiché pour les exceptions non gérées, et le serveur sera rechargé lorsque le code sera modifié. L'attribut :attr:`~flask.Flask.debug` correspond à cette clé de configuration. Ceci est activé lorsque :data:`ENV` est ``'development'`` et est surchargé par la variable d'environnement ``FLASK_DEBUG``. Elle peut ne pas se comporter comme prévu si elle est définie dans le code.

source: **Do not enable debug mode when deploying in production.**
es: **No active el modo de depuración cuando se despliegue en producción.**
fr: **Ne pas activer le mode débogage lors du déploiement en production.**

source: Default: ``True`` if :data:`ENV` is ``'development'``, or ``False`` otherwise.
es: Por defecto: ``True`` si :data:`ENV` es ``'development'``, o ``False`` en caso contrario.
fr: Valeur par défaut : ``True`` si :data:`ENV` est ``'development'``, ou ``False`` sinon.

source: Enable testing mode. Exceptions are propagated rather than handled by the the app's error handlers. Extensions may also change their behavior to facilitate easier testing. You should enable this in your own tests.
es: Activar el modo de prueba. Las excepciones se propagan en lugar de ser manejadas por los manejadores de errores de la aplicación. Las extensiones también pueden cambiar su comportamiento para facilitar las pruebas. Deberías habilitar esto en tus propias pruebas.
fr: Activez le mode de test. Les exceptions sont propagées plutôt que d'être traitées par les gestionnaires d'erreurs de l'application. Les extensions peuvent également modifier leur comportement pour faciliter les tests. Vous devriez activer ce mode dans vos propres tests.

source: Default: ``False``
es: Por defecto: ``False``
fr: Valeur par défaut : ``False``

source: Exceptions are re-raised rather than being handled by the app's error handlers. If not set, this is implicitly true if ``TESTING`` or ``DEBUG`` is enabled.
es: Las excepciones se vuelven a lanzar en lugar de ser manejadas por los manejadores de errores de la aplicación. Si no se establece, esto es implícitamente cierto si ``TESTING`` o ``DEBUG`` está activado.
fr: Les exceptions sont re-levées plutôt que d'être gérées par les gestionnaires d'erreurs de l'application. Si elle n'est pas définie, elle est implicitement vraie si ``TESTING`` ou ``DEBUG`` est activé.

source: Default: ``None``
es: Por defecto: ``None``
fr: Valeur par défaut : ``None``

source: Don't pop the request context when an exception occurs. If not set, this is true if ``DEBUG`` is true. This allows debuggers to introspect the request data on errors, and should normally not need to be set directly.
es: No hacer saltar el contexto de la petición cuando se produce una excepción. Si no se establece, es verdadero si ``DEBUG`` es verdadero. Esto permite a los depuradores introspeccionar los datos de la petición en caso de error, y normalmente no debería ser necesario establecerlo directamente.
fr: Ne pas ouvrir le contexte de la requête lorsqu'une exception se produit. Si elle n'est pas définie, elle est vraie si ``DEBUG`` est vrai. Cela permet aux débogueurs d'introspecter les données de la requête en cas d'erreur, et ne devrait normalement pas avoir besoin d'être défini directement.

source: If there is no handler for an ``HTTPException``-type exception, re-raise it to be handled by the interactive debugger instead of returning it as a simple error response.
es: Si no hay un manejador para una excepción de tipo ``HTTPException``, vuelve a lanzarla para que sea manejada por el depurador interactivo en lugar de devolverla como una simple respuesta de error.
fr: S'il n'y a pas de gestionnaire pour une exception de type ``HTTPException``, relancez-la pour qu'elle soit gérée par le débogueur interactif au lieu de la renvoyer comme une simple réponse d'erreur.

source: Trying to access a key that doesn't exist from request dicts like ``args`` and ``form`` will return a 400 Bad Request error page. Enable this to treat the error as an unhandled exception instead so that you get the interactive debugger. This is a more specific version of ``TRAP_HTTP_EXCEPTIONS``. If unset, it is enabled in debug mode.
es: Intentar acceder a una clave que no existe desde los dicts de petición como ``args`` y ``form`` devolverá una página de error 400 Bad Request. Habilita esto para tratar el error como una excepción no manejada en su lugar para que obtengas el depurador interactivo. Esta es una versión más específica de ``TRAP_HTTP_EXCEPTIONS``. Si no se activa, se habilita en modo de depuración.
fr: Essayer d'accéder à une clé qui n'existe pas à partir des dictionnaires de requêtes comme ``args`` et ``form`` retournera une page d'erreur 400 Bad Request. Activez cette option pour traiter l'erreur comme une exception non gérée afin d'obtenir le débogueur interactif. C'est une version plus spécifique de ``TRAP_HTTP_EXCEPTIONS``. Si elle n'est pas définie, elle est activée en mode débogage.

source: A secret key that will be used for securely signing the session cookie and can be used for any other security related needs by extensions or your application. It should be a long random ``bytes`` or ``str``. For example, copy the output of this to your config::
es: Una clave secreta que se utilizará para firmar de forma segura la cookie de sesión y puede ser utilizada para cualquier otra necesidad relacionada con la seguridad por las extensiones o su aplicación. Debe ser un ``bytes`` o ``str`` largo y aleatorio. Por ejemplo, copie la salida de esto a su config::
fr: Une clé secrète qui sera utilisée pour signer de manière sécurisée le cookie de session et qui peut être utilisée pour tout autre besoin lié à la sécurité par les extensions ou votre application. Ce doit être un long ``bytes`` ou ``str`` aléatoire. Par exemple, copiez la sortie de ceci dans votre config::

source: **Do not reveal the secret key when posting questions or committing code.**
es: **No reveles la clave secreta al publicar las preguntas o comprometer el código.**
fr: **Ne révélez pas la clé secrète lorsque vous posez des questions ou commettez le code.**

source: The name of the session cookie. Can be changed in case you already have a cookie with the same name.
es: El nombre de la cookie de sesión. Se puede cambiar en caso de que ya tenga una cookie con el mismo nombre.
fr: Le nom du cookie de session. Peut être modifié dans le cas où vous avez déjà un cookie avec le même nom.

source: Default: ``'session'``
es: Por defecto: ``'session'``
fr: Valeur par défaut : ``session``

source: The domain match rule that the session cookie will be valid for. If not set, the cookie will be valid for all subdomains of :data:`SERVER_NAME`. If ``False``, the cookie's domain will not be set.
es: La regla de coincidencia de dominio para la que será válida la cookie de sesión. Si no se establece, la cookie será válida para todos los subdominios de :data:`SERVER_NAME`. Si es ``False``, el dominio de la cookie no se establecerá.
fr: La règle de correspondance de domaine pour laquelle le cookie de session sera valide. Si elle n'est pas définie, le cookie sera valable pour tous les sous-domaines de :data:`SERVER_NAME`. Si elle est définie sur ``False``, le domaine du cookie ne sera pas défini.

source: The path that the session cookie will be valid for. If not set, the cookie will be valid underneath ``APPLICATION_ROOT`` or ``/`` if that is not set.
es: La ruta para la que será válida la cookie de sesión. Si no se establece, la cookie será válida bajo ``APPLICATION_ROOT`` o ``/`` si no se establece.
fr: Le chemin pour lequel le cookie de session sera valide. S'il n'est pas défini, le cookie sera valide sous ``APPLICATION_ROOT`` ou ``/`` si celui-ci n'est pas défini.

source: Browsers will not allow JavaScript access to cookies marked as "HTTP only" for security.
es: Los navegadores no permiten el acceso de JavaScript a las cookies marcadas como "sólo HTTP" por seguridad.
fr: Pour des raisons de sécurité, les navigateurs ne permettent pas à JavaScript d'accéder aux cookies marqués "HTTP uniquement".

source: Default: ``True``
es: Por defecto: ``True``
fr: Valeur par défaut : ``True``

source: Browsers will only send cookies with requests over HTTPS if the cookie is marked "secure". The application must be served over HTTPS for this to make sense.
es: Los navegadores sólo enviarán las cookies con solicitudes a través de HTTPS si la cookie está marcada como "segura". La aplicación debe ser servida a través de HTTPS para que esto tenga sentido.
fr: Les navigateurs n'enverront des cookies avec les demandes sur HTTPS que si le cookie est marqué "secure". L'application doit être servie via HTTPS pour que cela ait un sens.

source: Restrict how cookies are sent with requests from external sites. Can be set to ``'Lax'`` (recommended) or ``'Strict'``. See :ref:`security-cookie`.
es: Restringe cómo se envían las cookies con las solicitudes de sitios externos. Puede establecerse como ``'Lax'`` (recomendado) o ``'Strict'``. Ver :ref:`security-cookie`.
fr: Limite la façon dont les cookies sont envoyés avec les requêtes provenant de sites externes. Peut être défini sur ``'Lax'`` (recommandé) ou ``'Strict'``. Voir :ref:`security-cookie`.

source: If ``session.permanent`` is true, the cookie's expiration will be set this number of seconds in the future. Can either be a :class:`datetime.timedelta` or an ``int``.
es: Si ``session.permanent`` es verdadero, la expiración de la cookie se establecerá este número de segundos en el futuro. Puede ser un :class:`datetime.timedelta` o un ``int``.
fr: Si ``session.permanent`` est vrai, l'expiration du cookie sera fixée à ce nombre de secondes dans le futur. Peut être soit un :class:`datetime.timedelta` ou un ``int``.

source: Flask's default cookie implementation validates that the cryptographic signature is not older than this value.
es: La implementación de cookies por defecto de Flask valida que la firma criptográfica no sea más antigua que este valor.
fr: L'implémentation par défaut des cookies de Flask valide que la signature cryptographique n'est pas plus ancienne que cette valeur.

source: Default: ``timedelta(days=31)`` (``2678400`` seconds)
es: Por defecto: ``timedelta(days=31)`` (``2678400`` seconds)
fr: Valeur par défaut : ``timedelta(days=31)`` (``2678400`` secondes)

source: Control whether the cookie is sent with every response when ``session.permanent`` is true. Sending the cookie every time (the default) can more reliably keep the session from expiring, but uses more bandwidth. Non-permanent sessions are not affected.
es: Controla si la cookie se envía con cada respuesta cuando ``session.permanent`` es verdadero. Enviar la cookie cada vez (el valor por defecto) puede evitar que la sesión expire de forma más fiable, pero utiliza más ancho de banda. Las sesiones no permanentes no se ven afectadas.
fr: Contrôle si le cookie est envoyé avec chaque réponse lorsque ``session.permanent`` est vrai. L'envoi du cookie à chaque fois (par défaut) peut empêcher de façon plus fiable la session d'expirer, mais utilise plus de bande passante. Les sessions non permanentes ne sont pas affectées.

source: When serving files, set the ``X-Sendfile`` header instead of serving the data with Flask. Some web servers, such as Apache, recognize this and serve the data more efficiently. This only makes sense when using such a server.
es: Cuando sirvas archivos, establece la cabecera ``X-Sendfile`` en lugar de servir los datos con Flask. Algunos servidores web, como Apache, reconocen esto y sirven los datos de manera más eficiente. Esto sólo tiene sentido cuando se utiliza un servidor de este tipo.
fr: Lorsque vous servez des fichiers, définissez l'en-tête ``X-Sendfile`` au lieu de servir les données avec Flask. Certains serveurs web, comme Apache, reconnaissent cela et servent les données plus efficacement. Cela n'a de sens que si vous utilisez un tel serveur.
