Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/errorhandling.po
Languages: fr

source: Using the same techniques as above and :func:`~flask.json.jsonify` we can return JSON responses to API errors. :func:`~flask.abort` is called with a ``description`` parameter. The error handler will use that as the JSON error message, and set the status code to 404.
fr: En utilisant les mêmes techniques que ci-dessus et :func:`~flask.json.jsonify`, nous pouvons renvoyer des réponses JSON aux erreurs d'API. :func:`~flask.abort` est appelé avec un paramètre ``description``. Le gestionnaire d'erreur l'utilisera comme message d'erreur JSON, et définira le code d'état à 404.

source: We can also create custom exception classes. For instance, we can introduce a new custom exception for an API that can take a proper human readable message, a status code for the error and some optional payload to give more context for the error.
fr: Nous pouvons également créer des classes d'exceptions personnalisées. Par exemple, nous pouvons introduire une nouvelle exception personnalisée pour une API qui peut prendre un message lisible par l'homme, un code d'état pour l'erreur et des données utiles facultatives pour donner plus de contexte à l'erreur.

source: This is a simple example:
fr: Il s'agit d'un exemple simple :

source: A view can now raise that exception with an error message. Additionally some extra payload can be provided as a dictionary through the `payload` parameter.
fr: Une vue peut maintenant lever cette exception avec un message d'erreur. De plus, des données supplémentaires peuvent être fournies sous forme de dictionnaire via le paramètre `payload`.

source: Logging
fr: Journalisation

source: See :doc:`/logging` for information about how to log exceptions, such as by emailing them to admins.
fr: Voir :doc:`/logging` pour des informations sur la façon d'enregistrer les exceptions, par exemple en les envoyant par courriel aux administrateurs.

source: Debugging
fr: Débogage

source: See :doc:`/debugging` for information about how to debug errors in development and production.
fr: Voir :doc:`/debugging` pour des informations sur la façon de déboguer les erreurs en développement et en production.
