Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/extensiondev.po
Languages: es

source: Flask Extension Development
es: Desarrollo de extensiones de Flask

source: Extensions are extra packages that add functionality to a Flask application. While `PyPI`_ contains many Flask extensions, you may not find one that fits your need. If this is the case, you can create your own, and publish it for others to use as well.
es: Las extensiones son paquetes adicionales que añaden funcionalidad a una aplicación Flask. Aunque `PyPI`_ contiene muchas extensiones de Flask, puede que no encuentres ninguna que se ajuste a tus necesidades. Si este es el caso, puedes crear la tuya propia, y publicarla para que otros la usen también.

source: This guide will show how to create a Flask extension, and some of the common patterns and requirements involved. Since extensions can do anything, this guide won't be able to cover every possibility.
es: Esta guía mostrará cómo crear una extensión de Flask, y algunos de los patrones y requisitos comunes involucrados. Como las extensiones pueden hacer cualquier cosa, esta guía no podrá cubrir todas las posibilidades.

source: The best ways to learn about extensions are to look at how other extensions you use are written, and discuss with others. Discuss your design ideas with others on our `Discord Chat`_ or `GitHub Discussions`_.
es: La mejor manera de aprender sobre las extensiones es mirar cómo están escritas otras extensiones que utilizas, y discutir con otros. Discute tus ideas de diseño con otros en nuestro `Discord Chat`_ o `GitHub Discussions`_.

source: The best extensions share common patterns, so that anyone familiar with using one extension won't feel completely lost with another. This can only work if collaboration happens early.
es: Las mejores extensiones comparten patrones comunes, de modo que quien esté familiarizado con el uso de una extensión no se sienta completamente perdido con otra. Esto sólo puede funcionar si la colaboración se produce desde el principio.

source: Naming
es: Nombramiento

source: A Flask extension typically has ``flask`` in its name as a prefix or suffix. If it wraps another library, it should include the library name as well. This makes it easy to search for extensions, and makes their purpose clearer.
es: Una extensión de Flask normalmente tiene ``flask`` en su nombre como prefijo o sufijo. Si envuelve otra biblioteca, debería incluir el nombre de la biblioteca también. Esto facilita la búsqueda de extensiones, y hace que su propósito sea más claro.

source: A general Python packaging recommendation is that the install name from the package index and the name used in ``import`` statements should be related. The import name is lowercase, with words separated by underscores (``_``). The install name is either lower case or title case, with words separated by dashes (``-``). If it wraps another library, prefer using the same case as that library's name.
es: Una recomendación general de empaquetado de Python es que el nombre de instalación del índice del paquete y el nombre utilizado en las declaraciones ``import`` deben estar relacionados. El nombre de importación está en minúsculas, con palabras separadas por guiones bajos (``_``). El nombre de instalación va en minúsculas o en mayúsculas, con las palabras separadas por guiones (``-``). Si envuelve a otra biblioteca, es preferible utilizar el mismo caso que el nombre de esa biblioteca.

source: Here are some example install and import names:
es: Estos son algunos ejemplos de nombres de instalación e importación:

source: ``Flask-Name`` imported as ``flask_name``
es: ``Flask-Name`` importado como ``flask_name``

source: ``flask-name-lower`` imported as ``flask_name_lower``
es: ``flask-name-lower`` importado como ``flask_name_lower``

source: ``Flask-ComboName`` imported as ``flask_comboname``
es: ``Flask-ComboName`` importado como ``flask_comboname``

source: ``Name-Flask`` imported as ``name_flask``
es: ``Name-Flask`` importado como ``name_flask``

source: The Extension Class and Initialization
es: La clase de extensión y la inicialización

source: All extensions will need some entry point that initializes the extension with the application. The most common pattern is to create a class that represents the extension's configuration and behavior, with an ``init_app`` method to apply the extension instance to the given application instance.
es: Todas las extensiones necesitarán algún punto de entrada que inicialice la extensión con la aplicación. El patrón más común es crear una clase que represente la configuración y el comportamiento de la extensión, con un método ``init_app`` para aplicar la instancia de la extensión a la instancia de la aplicación dada.

source: It is important that the app is not stored on the extension, don't do ``self.app = app``. The only time the extension should have direct access to an app is during ``init_app``, otherwise it should use :data:`current_app`.
es: Es importante que la aplicación no se almacene en la extensión, no hagas ``self.app = app``. La única vez que la extensión debe tener acceso directo a una aplicación es durante ``init_app``, de lo contrario debe utilizar :data:`current_app``.

source: This allows the extension to support the application factory pattern, avoids circular import issues when importing the extension instance elsewhere in a user's code, and makes testing with different configurations easier.
es: Esto permite que la extensión sea compatible con el patrón de fábrica de la aplicación, evita problemas de importación circular cuando se importa la instancia de la extensión en otra parte del código de un usuario, y facilita las pruebas con diferentes configuraciones.

source: Above, the ``hello`` extension instance exists independently of the application. This means that other modules in a user's project can do ``from project import hello`` and use the extension in blueprints before the app exists.
es: Arriba, la instancia de la extensión ``hello`` existe independientemente de la aplicación. Esto significa que otros módulos en el proyecto de un usuario pueden hacer ``from project import hello`` y utilizar la extensión en los blueprints antes de que la aplicación exista.

source: The :attr:`Flask.extensions` dict can be used to store a reference to the extension on the application, or some other state specific to the application. Be aware that this is a single namespace, so use a name unique to your extension, such as the extension's name without the "flask" prefix.
es: El dict :attr:`Flask.extensions` puede utilizarse para almacenar una referencia a la extensión en la aplicación, o algún otro estado específico de la aplicación. Ten en cuenta que se trata de un espacio de nombres único, así que utiliza un nombre único para tu extensión, como el nombre de la extensión sin el prefijo "flask".

source: Adding Behavior
es: Añadir comportamiento

source: There are many ways that an extension can add behavior. Any setup methods that are available on the :class:`Flask` object can be used during an extension's ``init_app`` method.
es: Hay muchas maneras de que una extensión pueda añadir comportamiento. Cualquier método de configuración que esté disponible en el objeto :class:`Flask` puede utilizarse durante el método ``init_app`` de una extensión.

source: A common pattern is to use :meth:`~Flask.before_request` to initialize some data or a connection at the beginning of each request, then :meth:`~Flask.teardown_request` to clean it up at the end. This can be stored on :data:`g`, discussed more below.
es: Un patrón común es utilizar :meth:`~Flask.before_request` para inicializar algunos datos o una conexión al principio de cada petición, y luego :meth:`~Flask.teardown_request` para limpiarla al final. Esto puede ser almacenado en :data:`g`, discutido más adelante.

source: A more lazy approach is to provide a method that initializes and caches the data or connection. For example, a ``ext.get_db`` method could create a database connection the first time it's called, so that a view that doesn't use the database doesn't create a connection.
es: Un enfoque más perezoso es proporcionar un método que inicialice y almacene en caché los datos o la conexión. Por ejemplo, un método ``ext.get_db`` podría crear una conexión a la base de datos la primera vez que se llama, para que una vista que no utilice la base de datos no cree una conexión.

source: Besides doing something before and after every view, your extension might want to add some specific views as well. In this case, you could define a :class:`Blueprint`, then call :meth:`~Flask.register_blueprint` during ``init_app`` to add the blueprint to the app.
es: Además de hacer algo antes y después de cada vista, tu extensión podría querer añadir también algunas vistas específicas. En este caso, podrías definir un :class:`Blueprint`, y luego llamar a :meth:`~Flask.register_blueprint` durante ``init_app`` para añadir el blueprint a la aplicación.

source: Configuration Techniques
es: Técnicas de configuración

source: There can be multiple levels and sources of configuration for an extension. You should consider what parts of your extension fall into each one.
es: Puede haber múltiples niveles y fuentes de configuración para una extensión. Debes considerar qué partes de tu extensión entran en cada uno de ellos.

source: Configuration per application instance, through ``app.config`` values. This is configuration that could reasonably change for each deployment of an application. A common example is a URL to an external resource, such as a database. Configuration keys should start with the extension's name so that they don't interfere with other extensions.
es: Configuración por instancia de aplicación, a través de los valores de ``app.config``. Se trata de una configuración que podría cambiar razonablemente en cada despliegue de una aplicación. Un ejemplo común es una URL a un recurso externo, como una base de datos. Las claves de configuración deben comenzar con el nombre de la extensión para que no interfieran con otras extensiones.

source: Configuration per extension instance, through ``__init__`` arguments. This configuration usually affects how the extension is used, such that it wouldn't make sense to change it per deployment.
es: Configuración por instancia de la extensión, a través de los argumentos ``__init__``. Esta configuración suele afectar al uso de la extensión, por lo que no tendría sentido cambiarla por cada despliegue.

source: Configuration per extension instance, through instance attributes and decorator methods. It might be more ergonomic to assign to ``ext.value``, or use a ``@ext.register`` decorator to register a function, after the extension instance has been created.
es: Configuración por instancia de extensión, a través de atributos de instancia y métodos de decorador. Podría ser más ergonómico asignar a ``ext.value``, o utilizar un decorador ``@ext.register`` para registrar una función, después de que la instancia de la extensión haya sido creada.

source: Global configuration through class attributes. Changing a class attribute like ``Ext.connection_class`` can customize default behavior without making a subclass. This could be combined per-extension configuration to override defaults.
es: Configuración global a través de atributos de clase. Cambiando un atributo de clase como ``Ext.connection_class`` se puede personalizar el comportamiento por defecto sin hacer una subclase. Esto podría combinarse con la configuración por extensión para anular los valores predeterminados.

source: Subclassing and overriding methods and attributes. Making the API of the extension itself something that can be overridden provides a very powerful tool for advanced customization.
es: Subclasificación y anulación de métodos y atributos. Hacer que la API de la propia extensión sea algo que se pueda sobrescribir proporciona una herramienta muy poderosa para la personalización avanzada.

source: The :class:`~flask.Flask` object itself uses all of these techniques.
es: El propio objeto :class:`~flask.Flask` utiliza todas estas técnicas.

source: It's up to you to decide what configuration is appropriate for your extension, based on what you need and what you want to support.
es: Depende de ti decidir qué configuración es la adecuada para tu extensión, en función de lo que necesites y de lo que quieras soportar.

source: Configuration should not be changed after the application setup phase is complete and the server begins handling requests. Configuration is global, any changes to it are not guaranteed to be visible to other workers.
es: La configuración no debe ser modificada una vez que la fase de configuración de la aplicación se ha completado y el servidor comienza a manejar las solicitudes. La configuración es global, cualquier cambio en ella no se garantiza que sea visible para otros trabajadores.

source: Data During a Request
es: Datos durante una solicitud

source: When writing a Flask application, the :data:`~flask.g` object is used to store information during a request. For example the :doc:`tutorial <tutorial/database>` stores a connection to a SQLite database as ``g.db``. Extensions can also use this, with some care. Since ``g`` is a single global namespace, extensions must use unique names that won't collide with user data. For example, use the extension name as a prefix, or as a namespace.
es: Al escribir una aplicación Flask, el objeto :data:`~flask.g` se utiliza para almacenar información durante una petición. Por ejemplo el :doc:`tutorial <tutorial/database>` almacena una conexión a una base de datos SQLite como ``g.db``. Las extensiones también pueden usar esto, con cierto cuidado. Dado que ``g`` es un único espacio de nombres global, las extensiones deben utilizar nombres únicos que no colisionen con los datos del usuario. Por ejemplo, utilizar el nombre de la extensión como prefijo, o como espacio de nombres.

source: The data in ``g`` lasts for an application context. An application context is active when a request context is, or when a CLI command is run. If you're storing something that should be closed, use :meth:`~flask.Flask.teardown_appcontext` to ensure that it gets closed when the application context ends. If it should only be valid during a request, or would not be used in the CLI outside a reqeust, use :meth:`~flask.Flask.teardown_request`.
es: Los datos de ``g`` duran para un contexto de aplicación. Un contexto de aplicación está activo cuando un contexto de solicitud lo está, o cuando se ejecuta un comando CLI. Si estás almacenando algo que debe ser cerrado, utiliza :meth:`~flask.Flask.teardown_appcontext` para asegurarte de que se cierra cuando el contexto de aplicación termina. Si sólo debe ser válido durante una solicitud, o no se utilizará en la CLI fuera de una solicitud, utilice :meth:`~flask.Flask.teardown_request`.

source: Views and Models
es: Vistas y modelos

source: Your extension views might want to interact with specific models in your database, or some other extension or data connected to your application. For example, let's consider a ``Flask-SimpleBlog`` extension that works with Flask-SQLAlchemy to provide a ``Post`` model and views to write and read posts.
es: Las vistas de tu extensión pueden querer interactuar con modelos específicos de tu base de datos, o con alguna otra extensión o datos conectados a tu aplicación. Por ejemplo, consideremos una extensión ``Flask-SimpleBlog`` que trabaja con Flask-SQLAlchemy para proporcionar un modelo ``Post`` y vistas para escribir y leer posts.

source: The ``Post`` model needs to subclass the Flask-SQLAlchemy ``db.Model`` object, but that's only available once you've created an instance of that extension, not when your extension is defining its views. So how can the view code, defined before the model exists, access the model?
es: El modelo ``Post`` necesita subclasificar el objeto ``db.Model`` de Flask-SQLAlchemy, pero eso sólo está disponible una vez que has creado una instancia de esa extensión, no cuando tu extensión está definiendo sus vistas. Entonces, ¿cómo puede el código de la vista, definido antes de que el modelo exista, acceder al modelo?

source: One method could be to use :doc:`views`. During ``__init__``, create the model, then create the views by passing the model to the view class's :meth:`~views.View.as_view` method.
es: Un método podría ser utilizar :doc:`views`. Durante ``__init__``, crea el modelo, luego crea las vistas pasando el modelo al método :meth:`~views.View.as_view` de la clase vista.

source: Another technique could be to use an attribute on the extension, such as ``self.post_model`` from above. Add the extension to ``app.extensions`` in ``init_app``, then access ``current_app.extensions["simple_blog"].post_model`` from views.
es: Otra técnica podría ser utilizar un atributo en la extensión, como ``self.post_model`` de arriba. Añade la extensión a ``app.extensions`` en ``init_app``, y luego accede a ``current_app.extensions["simple_blog"].post_model`` desde views.

source: You may also want to provide base classes so that users can provide their own ``Post`` model that conforms to the API your extension expects. So they could implement ``class Post(blog.BasePost)``, then set it as ``blog.post_model``.
es: También puede querer proporcionar clases base para que los usuarios puedan proporcionar su propio modelo ``Post`` que se ajuste a la API que su extensión espera. Así que podrían implementar ``class Post(blog.BasePost)``, y luego establecerlo como ``blog.post_model``.

source: As you can see, this can get a bit complex. Unfortunately, there's no perfect solution here, only different strategies and tradeoffs depending on your needs and how much customization you want to offer. Luckily, this sort of resource dependency is not a common need for most extensions. Remember, if you need help with design, ask on our `Discord Chat`_ or `GitHub Discussions`_.
es: Como puedes ver, esto puede ser un poco complejo. Desafortunadamente, no hay una solución perfecta aquí, sólo diferentes estrategias y compensaciones dependiendo de tus necesidades y de cuánta personalización quieras ofrecer. Afortunadamente, este tipo de dependencia de recursos no es una necesidad común para la mayoría de las extensiones. Recuerda, si necesitas ayuda con el diseño, pregunta en nuestro `Chat de Discord`_ o `GitHub Discussions`_.

source: Recommended Extension Guidelines
es: Directrices de extensión recomendadas

source: Flask previously had the concept of "approved extensions", where the Flask maintainers evaluated the quality, support, and compatibility of the extensions before listing them. While the list became too difficult to maintain over time, the guidelines are still relevant to all extensions maintained and developed today, as they help the Flask ecosystem remain consistent and compatible.
es: Anteriormente, Flask tenía el concepto de "extensiones aprobadas", donde los mantenedores de Flask evaluaban la calidad, el soporte y la compatibilidad de las extensiones antes de listarlas. Aunque la lista se volvió demasiado difícil de mantener con el tiempo, las directrices siguen siendo relevantes para todas las extensiones mantenidas y desarrolladas hoy en día, ya que ayudan a que el ecosistema de Flask siga siendo consistente y compatible.

source: An extension requires a maintainer. In the event an extension author would like to move beyond the project, the project should find a new maintainer and transfer access to the repository, documentation, PyPI, and any other services. The `Pallets-Eco`_ organization on GitHub allows for community maintenance with oversight from the Pallets maintainers.
es: Una extensión requiere un mantenedor. En el caso de que el autor de una extensión quiera dejar el proyecto, el proyecto debe encontrar un nuevo mantenedor y transferir el acceso al repositorio, la documentación, PyPI y cualquier otro servicio. La organización `Pallets-Eco`_ en GitHub permite el mantenimiento comunitario con la supervisión de los mantenedores de Pallets.

source: The naming scheme is *Flask-ExtensionName* or *ExtensionName-Flask*. It must provide exactly one package or module named ``flask_extension_name``.
es: El esquema de nomenclatura es *Flask-ExtensionName* o *ExtensionName-Flask*. Debe proporcionar exactamente un paquete o módulo llamado ``nombre_de_la_extensión``.

source: The extension must use an open source license. The Python web ecosystem tends to prefer BSD or MIT. It must be open source and publicly available.
es: La extensión debe utilizar una licencia de código abierto. El ecosistema web de Python tiende a preferir BSD o MIT. Debe ser de código abierto y estar disponible públicamente.

source: The extension's API must have the following characteristics:
es: La API de la extensión debe tener las siguientes características:

source: It must support multiple applications running in the same Python process. Use ``current_app`` instead of ``self.app``, store configuration and state per application instance.
es: Debe soportar múltiples aplicaciones que se ejecuten en el mismo proceso de Python. Usar ``current_app`` en lugar de ``self.app``, almacenar la configuración y el estado por instancia de aplicación.

source: It must be possible to use the factory pattern for creating applications. Use the ``ext.init_app()`` pattern.
es: Debe ser posible utilizar el patrón de fábrica para crear aplicaciones. Utiliza el patrón ``ext.init_app()``.

source: From a clone of the repository, an extension with its dependencies must be installable in editable mode with ``pip install -e .``.
es: Desde un clon del repositorio, una extensión con sus dependencias debe ser instalable en modo editable con ``pip install -e .``.

source: It must ship tests that can be invoked with a common tool like ``tox -e py``, ``nox -s test`` or ``pytest``. If not using ``tox``, the test dependencies should be specified in a requirements file. The tests must be part of the sdist distribution.
es: Debe enviar pruebas que puedan ser invocadas con una herramienta común como ``tox -e py``, ``nox -s test`` o ``pytest``. Si no se utiliza ``tox``, las dependencias de las pruebas deben especificarse en un archivo de requisitos. Las pruebas deben formar parte de la distribución de sdist.

source: A link to the documentation or project website must be in the PyPI metadata or the readme. The documentation should use the Flask theme from the `Official Pallets Themes`_.
es: Debe haber un enlace a la documentación o al sitio web del proyecto en los metadatos de PyPI o en el readme. La documentación debe utilizar el tema de Flask de los `Temas Oficiales de Pallets`_.

source: The extension's dependencies should not use upper bounds or assume any particular version scheme, but should use lower bounds to indicate minimum compatibility support. For example, ``sqlalchemy>=1.4``.
es: Las dependencias de la extensión no deben usar límites superiores ni asumir ningún esquema de versión en particular, sino que deben usar límites inferiores para indicar el soporte mínimo de compatibilidad. Por ejemplo, ``sqlalchemy>=1.4``.

source: Indicate the versions of Python supported using ``python_requires=">=version"``. Flask itself supports Python >=3.7 as of December 2021, but this will update over time.
es: Indicar las versiones de Python soportadas usando ``python_requires=">=version"``. Flask soporta Python >=3.7 desde diciembre de 2021, pero esto se actualizará con el tiempo.
