Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/foreword.po
Languages: es, fr

source: Foreword
es: Prólogo
fr: Avant-propos

source: Read this before you get started with Flask. This hopefully answers some questions about the purpose and goals of the project, and when you should or should not be using it.
es: Lee esto antes de empezar con Flask. Es de esperar que responda a algunas preguntas sobre el propósito y los objetivos del proyecto, y cuándo debe o no debe utilizarlo.
fr: Lisez ceci avant de vous lancer dans l'utilisation de Flask. Il répondra, nous l'espérons, à certaines questions sur l'objet et les objectifs du projet, et sur le moment où vous devez ou non l'utiliser.

source: What does "micro" mean?
es: ¿Qué significa "micro"?
fr: Que signifie "micro" ?

source: “Micro” does not mean that your whole web application has to fit into a single Python file (although it certainly can), nor does it mean that Flask is lacking in functionality. The "micro" in microframework means Flask aims to keep the core simple but extensible. Flask won't make many decisions for you, such as what database to use. Those decisions that it does make, such as what templating engine to use, are easy to change. Everything else is up to you, so that Flask can be everything you need and nothing you don't.
es: “Micro” no significa que toda tu aplicación web tenga que caber en un solo archivo de Python (aunque ciertamente puede), ni significa que Flask carezca de funcionalidad. El "micro" en microframework significa que Flask pretende mantener el núcleo simple pero extensible. Flask no tomará muchas decisiones por usted, como qué base de datos utilizar. Aquellas decisiones que sí toma, como el motor de plantillas a utilizar, son fáciles de cambiar. Todo lo demás depende de usted, de modo que Flask puede ser todo lo que necesite y nada que no necesite.
fr: "Micro" ne signifie pas que l'ensemble de votre application web doit tenir dans un seul fichier Python (bien que ce soit certainement possible), ni que Flask manque de fonctionnalités. Le "micro" de micro-infrastructure logicielle signifie que Flask vise à garder le noyau simple mais extensible. Flask ne prendra pas beaucoup de décisions pour vous, comme le choix de la base de données à utiliser. Les décisions qu'il prend, comme le moteur de modèle à utiliser, sont faciles à modifier. Tout le reste dépend de vous, de sorte que Flask puisse être tout ce dont vous avez besoin et rien que vous n'ayez besoin.

source: By default, Flask does not include a database abstraction layer, form validation or anything else where different libraries already exist that can handle that. Instead, Flask supports extensions to add such functionality to your application as if it was implemented in Flask itself. Numerous extensions provide database integration, form validation, upload handling, various open authentication technologies, and more. Flask may be "micro", but it's ready for production use on a variety of needs.
es: Por defecto, Flask no incluye una capa de abstracción de base de datos, validación de formularios o cualquier otra cosa donde ya existen diferentes bibliotecas que pueden manejar eso. En su lugar, Flask soporta extensiones para añadir dicha funcionalidad a tu aplicación como si estuviera implementada en el propio Flask. Numerosas extensiones proporcionan integración de bases de datos, validación de formularios, manejo de cargas, varias tecnologías de autenticación abierta, y más. Flask puede ser "micro", pero está listo para su uso en producción en una variedad de necesidades.
fr: Par défaut, Flask n'inclut pas de couche d'abstraction de base de données, de validation de formulaire ou quoi que ce soit d'autre là où il existe déjà des bibliothèques différentes qui peuvent gérer cela. Au lieu de cela, Flask supporte des extensions pour ajouter de telles fonctionnalités à votre application comme si elles étaient implémentées dans Flask lui-même. De nombreuses extensions permettent l'intégration de bases de données, la validation de formulaires, la gestion des téléchargements, diverses technologies d'authentification ouverte, etc. Flask est peut-être "micro", mais il est prêt à être utilisé en production pour une variété de besoins.

source: Configuration and Conventions
es: Configuración y convenciones
fr: Configuration et conventions

source: Flask has many configuration values, with sensible defaults, and a few conventions when getting started. By convention, templates and static files are stored in subdirectories within the application's Python source tree, with the names :file:`templates` and :file:`static` respectively. While this can be changed, you usually don't have to, especially when getting started.
es: Flask tiene muchos valores de configuración, con valores por defecto razonables, y unas cuantas convenciones al empezar. Por convención, las plantillas y los archivos estáticos se almacenan en subdirectorios dentro del árbol de fuentes de Python de la aplicación, con los nombres :file:`templates` y :file:`static` respectivamente. Aunque esto puede cambiarse, normalmente no es necesario, especialmente cuando se empieza.
fr: Flask possède de nombreuses valeurs de configuration, avec des valeurs par défaut judicieuses, et quelques conventions lors de la prise en main. Par convention, les modèles et les fichiers statiques sont stockés dans des sous-répertoires dans l'arbre source Python de l'application, avec les noms :file:`templates` et :file:`static` respectivement. Bien que cela puisse être modifié, vous n'avez généralement pas besoin de le faire, surtout au début.

source: Growing with Flask
es: Crecer con Flask
fr: Se développer avec Flask

source: Once you have Flask up and running, you'll find a variety of extensions available in the community to integrate your project for production.
es: Una vez que tenga Flask en funcionamiento, encontrará una variedad de extensiones disponibles en la comunidad para integrar su proyecto para la producción.
fr: Une fois que vous avez mis en place Flask, vous trouverez une variété d'extensions disponibles dans la communauté pour intégrer votre projet pour la production.

source: As your codebase grows, you are free to make the design decisions appropriate for your project. Flask will continue to provide a very simple glue layer to the best that Python has to offer. You can implement advanced patterns in SQLAlchemy or another database tool, introduce non-relational data persistence as appropriate, and take advantage of framework-agnostic tools built for WSGI, the Python web interface.
es: A medida que su base de código crece, usted es libre de tomar las decisiones de diseño apropiadas para su proyecto. Flask continuará proporcionando una capa de pegamento muy simple a lo mejor que Python tiene para ofrecer. Puedes implementar patrones avanzados en SQLAlchemy u otra herramienta de base de datos, introducir persistencia de datos no relacionales según sea apropiado, y aprovechar las herramientas agnósticas de marco construidas para WSGI, la interfaz web de Python.
fr: Au fur et à mesure que votre base de code se développe, vous êtes libre de prendre les décisions de conception appropriées à votre projet. Flask continuera à fournir une couche adaptative très simple à ce que Python a de mieux à offrir. Vous pouvez mettre en œuvre des modèles avancés dans SQLAlchemy ou un autre outil de base de données, introduire la persistance des données non relationnelles, le cas échéant, et tirer parti des outils agnostiques construits pour WSGI, l'interface web Python.

source: Flask includes many hooks to customize its behavior. Should you need more customization, the Flask class is built for subclassing. If you are interested in that, check out the :doc:`becomingbig` chapter. If you are curious about the Flask design principles, head over to the section about :doc:`design`.
fr: Flask inclut de nombreux crochets pour personnaliser son comportement. Si vous avez besoin de plus de personnalisation, la classe Flask est construite pour être sous-classée. Si cela vous intéresse, consultez le chapitre :doc:`becomingbig`. Si vous êtes curieux de connaître les principes de conception de Flask, allez voir la section sur la :doc:`design`.
