Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/htmlfaq.po
Languages: es

source: HTML/XHTML FAQ
es: Preguntas frecuentes sobre html/xhtml

source: The Flask documentation and example applications are using HTML5. You may notice that in many situations, when end tags are optional they are not used, so that the HTML is cleaner and faster to load. Because there is much confusion about HTML and XHTML among developers, this document tries to answer some of the major questions.
es: La documentación y las aplicaciones de ejemplo de Flask utilizan HTML5. Puedes notar que en muchas situaciones, cuando las etiquetas finales son opcionales no se usan, para que el HTML sea más limpio y más rápido de cargar. Debido a que hay mucha confusión sobre HTML y XHTML entre los desarrolladores, este documento intenta responder a algunas de las principales preguntas.

source: History of XHTML
es: Historia de XHTML

source: For a while, it appeared that HTML was about to be replaced by XHTML. However, barely any websites on the Internet are actual XHTML (which is HTML processed using XML rules). There are a couple of major reasons why this is the case. One of them is Internet Explorer's lack of proper XHTML support. The XHTML spec states that XHTML must be served with the MIME type :mimetype:`application/xhtml+xml`, but Internet Explorer refuses to read files with that MIME type. While it is relatively easy to configure Web servers to serve XHTML properly, few people do. This is likely because properly using XHTML can be quite painful.
es: Durante un tiempo, parecía que el HTML iba a ser sustituido por el XHTML. Sin embargo, apenas hay sitios web en Internet que sean realmente XHTML (que es HTML procesado con reglas XML). Hay un par de razones importantes para que esto sea así. Una de ellas es la falta de soporte de XHTML en Internet Explorer. La especificación XHTML establece que el XHTML debe servirse con el tipo MIME :mimetype:`application/xhtml+xml`, pero Internet Explorer se niega a leer archivos con ese tipo MIME. Aunque es relativamente fácil configurar los servidores web para que sirvan XHTML correctamente, poca gente lo hace. Esto se debe probablemente a que el uso adecuado de XHTML puede ser bastante doloroso.

source: One of the most important causes of pain is XML's draconian (strict and ruthless) error handling. When an XML parsing error is encountered, the browser is supposed to show the user an ugly error message, instead of attempting to recover from the error and display what it can. Most of the (X)HTML generation on the web is based on non-XML template engines (such as Jinja, the one used in Flask) which do not protect you from accidentally creating invalid XHTML. There are XML based template engines, such as Kid and the popular Genshi, but they often come with a larger runtime overhead and are not as straightforward to use because they have to obey XML rules.
es: Una de las causas más importantes del dolor es el draconiano (estricto y despiadado) manejo de errores de XML. Cuando se encuentra un error de análisis de XML, el navegador debe mostrar al usuario un feo mensaje de error, en lugar de intentar recuperarse del error y mostrar lo que pueda. La mayor parte de la generación de (X)HTML en la web se basa en motores de plantillas no XML (como Jinja, el utilizado en Flask) que no protegen de la creación accidental de XHTML no válido. Hay motores de plantillas basados en XML, como Kid y el popular Genshi, pero a menudo vienen con una mayor sobrecarga de tiempo de ejecución y no son tan sencillos de usar porque tienen que obedecer las reglas XML.

source: The majority of users, however, assumed they were properly using XHTML. They wrote an XHTML doctype at the top of the document and self-closed all the necessary tags (``<br>`` becomes ``<br/>`` or ``<br></br>`` in XHTML). However, even if the document properly validates as XHTML, what really determines XHTML/HTML processing in browsers is the MIME type, which as said before is often not set properly. So the valid XHTML was being treated as invalid HTML.
es: La mayoría de los usuarios, sin embargo, asumían que estaban utilizando correctamente el XHTML. Escribían un doctype XHTML en la parte superior del documento y autocerraban todas las etiquetas necesarias (``<br>`` se convierte en ``<br/>`` o ``<br></br>`` en XHTML). Sin embargo, incluso si el documento se valida correctamente como XHTML, lo que realmente determina el procesamiento de XHTML/HTML en los navegadores es el tipo MIME, que como se ha dicho antes, a menudo no está configurado correctamente. Así que el XHTML válido estaba siendo tratado como HTML inválido.

source: XHTML also changed the way JavaScript is used. To properly work with XHTML, programmers have to use the namespaced DOM interface with the XHTML namespace to query for HTML elements.
es: XHTML también ha cambiado la forma de utilizar JavaScript. Para trabajar correctamente con XHTML, los programadores tienen que utilizar la interfaz DOM con espacio de nombres con el espacio de nombres XHTML para consultar los elementos HTML.

source: History of HTML5
es: Historia de HTML5

source: Development of the HTML5 specification was started in 2004 under the name "Web Applications 1.0" by the Web Hypertext Application Technology Working Group, or WHATWG (which was formed by the major browser vendors Apple, Mozilla, and Opera) with the goal of writing a new and improved HTML specification, based on existing browser behavior instead of unrealistic and backwards-incompatible specifications.
es: El desarrollo de la especificación HTML5 se inició en 2004 con el nombre de "Web Applications 1.0" por parte del "Web Hypertext Application Technology Working Group", o WHATWG (formado por los principales proveedores de navegadores, Apple, Mozilla y Opera) con el objetivo de escribir una especificación HTML nueva y mejorada, basada en el comportamiento de los navegadores existentes en lugar de especificaciones poco realistas y retrocompatibles.

source: For example, in HTML4 ``<title/Hello/`` theoretically parses exactly the same as ``<title>Hello</title>``. However, since people were using XHTML-like tags along the lines of ``<link />``, browser vendors implemented the XHTML syntax over the syntax defined by the specification.
es: Por ejemplo, en HTML4 ``<title/Hello/`` teóricamente se analiza exactamente igual que ``<title>Hello</title>``. Sin embargo, como la gente utilizaba etiquetas similares a las de XHTML, como ``<link />``, los proveedores de navegadores implementaron la sintaxis de XHTML sobre la sintaxis definida por la especificación.

source: In 2007, the specification was adopted as the basis of a new HTML specification under the umbrella of the W3C, known as HTML5. Currently, it appears that XHTML is losing traction, as the XHTML 2 working group has been disbanded and HTML5 is being implemented by all major browser vendors.
es: En 2007, la especificación fue adoptada como base de una nueva especificación HTML bajo el paraguas del W3C, conocida como HTML5. En la actualidad, parece que el XHTML está perdiendo tracción, ya que el grupo de trabajo XHTML 2 se ha disuelto y el HTML5 está siendo implementado por todos los principales proveedores de navegadores.

source: HTML versus XHTML
es: HTML frente a XHTML

source: The following table gives you a quick overview of features available in HTML 4.01, XHTML 1.1 and HTML5. (XHTML 1.0 is not included, as it was superseded by XHTML 1.1 and the barely-used XHTML5.)
es: La siguiente tabla ofrece un rápido resumen de las características disponibles en HTML 4.01, XHTML 1.1 y HTML5. (No se incluye XHTML 1.0, ya que fue sustituido por XHTML 1.1 y el apenas utilizado XHTML5).

source: ``<tag/value/`` == ``<tag>value</tag>``
es: ``<tag/valor/`` == ``<tag>valor</tag>``

source: ``<br/>`` supported
es: ``<br/>`` soportado

source: ``<script/>`` supported
es: ``<script/>`` soportado

source: should be served as `text/html`
es: debe servirse como `text/html`

source: should be served as `application/xhtml+xml`
es: debe servirse como `application/xhtml+xml`

source: strict error handling
es: tratamiento estricto de los errores

source: inline SVG
es: SVG en línea

source: inline MathML
es: MathML en línea

source: ``<video>`` tag
es: etiqueta ``<video>``

source: ``<audio>`` tag
es: etiqueta ``<audio>``

source: New semantic tags like ``<article>``
es: Nuevas etiquetas semánticas como ``<article>``

source: This is an obscure feature inherited from SGML. It is usually not supported by browsers, for reasons detailed above.
es: Se trata de una oscura característica heredada del SGML. Por lo general, los navegadores no la soportan, por las razones detalladas anteriormente.

source: This is for compatibility with server code that generates XHTML for tags such as ``<br>``. It should not be used in new code.
es: Esto es para la compatibilidad con el código del servidor que genera XHTML para etiquetas como ``<br>``. No debe utilizarse en código nuevo.

source: XHTML 1.0 is the last XHTML standard that allows to be served as `text/html` for backwards compatibility reasons.
es: XHTML 1.0 es el último estándar XHTML que permite ser servido como `text/html` por razones de retrocompatibilidad.

source: What does "strict" mean?
es: ¿Qué significa "estricto"?

source: HTML5 has strictly defined parsing rules, but it also specifies exactly how a browser should react to parsing errors - unlike XHTML, which simply states parsing should abort. Some people are confused by apparently invalid syntax that still generates the expected results (for example, missing end tags or unquoted attribute values).
es: HTML5 tiene reglas de análisis estrictamente definidas, pero también especifica exactamente cómo debe reaccionar un navegador ante los errores de análisis, a diferencia de XHTML, que simplemente establece que el análisis debe abortarse. Algunas personas se sienten confundidas por una sintaxis aparentemente no válida que sigue generando los resultados esperados (por ejemplo, la falta de etiquetas finales o valores de atributos no citados).

source: Some of these work because of the lenient error handling most browsers use when they encounter a markup error, others are actually specified. The following constructs are optional in HTML5 by standard, but have to be supported by browsers:
es: Algunos de ellos funcionan debido al manejo indulgente de errores que la mayoría de los navegadores utilizan cuando encuentran un error de marcado, otros están realmente especificados. Las siguientes construcciones son opcionales en HTML5 por norma, pero tienen que ser soportadas por los navegadores:

source: Wrapping the document in an ``<html>`` tag
es: Envolver el documento en una etiqueta ``<html>``

source: Wrapping header elements in ``<head>`` or the body elements in ``<body>``
es: Envolver los elementos de la cabecera en ``<head>``

source: Closing the ``<p>``, ``<li>``, ``<dt>``, ``<dd>``, ``<tr>``, ``<td>``, ``<th>``, ``<tbody>``, ``<thead>``, or ``<tfoot>`` tags.
es: Cerrar las etiquetas ``<p>``, ``<li>``, ``<dt>``, ``<dd>``, ``<tr>``, ``<td>``, ``<th>``, ``<tbody>``, ``<thead>``, o ``<tfoot>``.

source: Quoting attributes, so long as they contain no whitespace or special characters (like ``<``, ``>``, ``'``, or ``"``).
es: Citar atributos, siempre que no contengan espacios en blanco o caracteres especiales (como ``<``, ``>``, ``'``, o ``"``).

source: Requiring boolean attributes to have a value.
es: Exigir que los atributos booleanos tengan un valor.

source: This means the following page in HTML5 is perfectly valid:
es: Esto significa que la siguiente página en HTML5 es perfectamente válida:

source: New technologies in HTML5
es: Nuevas tecnologías en HTML5

source: HTML5 adds many new features that make Web applications easier to write and to use.
es: HTML5 añade muchas características nuevas que hacen que las aplicaciones web sean más fáciles de escribir y utilizar.

source: The ``<audio>`` and ``<video>`` tags provide a way to embed audio and video without complicated add-ons like QuickTime or Flash.
es: Las etiquetas ``<audio>`` y ``<video>`` permiten incrustar audio y vídeo sin necesidad de complicados complementos como QuickTime o Flash.

source: Semantic elements like ``<article>``, ``<header>``, ``<nav>``, and ``<time>`` that make content easier to understand.
es: Elementos semánticos como ``<article>``, ``<header>``, ``<nav>`` y ``<time>`` que facilitan la comprensión del contenido.

source: The ``<canvas>`` tag, which supports a powerful drawing API, reducing the need for server-generated images to present data graphically.
es: La etiqueta ``<canvas>``, que soporta una potente API de dibujo, reduciendo la necesidad de imágenes generadas por el servidor para presentar los datos gráficamente.

source: New form control types like ``<input type="date">`` that allow user agents to make entering and validating values easier.
es: Nuevos tipos de control de formularios como ``<input type="date">`` que permiten a los agentes de usuario facilitar la introducción y validación de valores.

source: Advanced JavaScript APIs like Web Storage, Web Workers, Web Sockets, geolocation, and offline applications.
es: APIs avanzadas de JavaScript como Web Storage, Web Workers, Web Sockets, geolocalización y aplicaciones sin conexión.

source: Many other features have been added, as well. A good guide to new features in HTML5 is Mark Pilgrim's book, `Dive Into HTML5`_. Not all of them are supported in browsers yet, however, so use caution.
es: También se han añadido muchas otras características. Una buena guía de las nuevas características de HTML5 es el libro de Mark Pilgrim, `Sumérgete en HTML5`_. Sin embargo, no todas son compatibles con los navegadores, así que hay que tener cuidado.

source: What should be used?
es: ¿Qué hay que utilizar?

source: Currently, the answer is HTML5. There are very few reasons to use XHTML considering the latest developments in Web browsers. To summarize the reasons given above:
es: Actualmente, la respuesta es HTML5. Hay muy pocas razones para utilizar XHTML teniendo en cuenta los últimos avances en los navegadores web. Para resumir las razones expuestas anteriormente:

source: Internet Explorer has poor support for XHTML.
es: Internet Explorer no soporta bien el XHTML.

source: Many JavaScript libraries also do not support XHTML, due to the more complicated namespacing API it requires.
es: Muchas bibliotecas de JavaScript tampoco admiten XHTML, debido a la complicada API de espaciado de nombres que requiere.

source: HTML5 adds several new features, including semantic tags and the long-awaited ``<audio>`` and ``<video>`` tags.
es: HTML5 añade varias características nuevas, como las etiquetas semánticas y las tan esperadas etiquetas ``<audio>`` y ``<video>``.

source: It has the support of most browser vendors behind it.
es: Cuenta con el soporte de la mayoría de los proveedores de navegadores.

source: It is much easier to write, and more compact.
es: Es mucho más fácil de escribir y más compacto.

source: For most applications, it is undoubtedly better to use HTML5 than XHTML.
es: Para la mayoría de las aplicaciones, es sin duda mejor utilizar HTML5 que XHTML.
