Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/index.po
Languages: es, fr

source: Welcome to Flask
es: Bienvenido a Flask
fr: Bienvenue sur Flask

source: Flask: web development, one drop at a time
es: Flask: desarrollo web, una gota a la vez
fr: Flask : le développement web, une goutte à la fois

source: Welcome to Flask's documentation. Get started with :doc:`installation` and then get an overview with the :doc:`quickstart`. There is also a more detailed :doc:`tutorial/index` that shows how to create a small but complete application with Flask. Common patterns are described in the :doc:`patterns/index` section. The rest of the docs describe each component of Flask in detail, with a full reference in the :doc:`api` section.
es: Bienvenido a la documentación de Flask. Empieza con la :doc:`installation` y luego obtén una visión general con el :doc:`quickstart`. También hay un :doc:`tutorial/index` más detallado que muestra cómo crear una aplicación pequeña pero completa con Flask. Los patrones comunes se describen en la sección :doc:`patterns/index`. El resto de los documentos describen cada componente de Flask en detalle, con una referencia completa en la sección :doc:`api`.
fr: Bienvenue dans la documentation de Flask. Commencez avec l\':doc:`installation` et obtenez un aperçu avec la section :doc:`quickstart`. Il existe également un :doc:`tutorial/index` plus détaillé qui montre comment créer une application petite mais complète avec Flask. Les structures communes sont décrites dans la section :doc:`patterns/index`. Le reste de la documentation décrit chaque composant de Flask en détail, avec une référence complète dans la section :doc:`api`.

source: Flask depends on the `Jinja`_ template engine and the `Werkzeug`_ WSGI toolkit. The documentation for these libraries can be found at:
es: Flask depende del motor de plantillas `Jinja`_ y del kit de herramientas `Werkzeug`_ WSGI. La documentación de estas bibliotecas se puede encontrar en:
fr: Flask dépend du moteur de modèles `Jinja`_ et de la boîte à outils WSGI `Werkzeug`_. La documentation de ces bibliothèques peut être trouvée aux adresses suivantes :

source: `Jinja documentation <https://jinja.palletsprojects.com/>`_
es: `Documentación de Jinja <https://jinja.palletsprojects.com/>`_
fr: `Documentation Jinja <https://jinja.palletsprojects.com/>`_

source: `Werkzeug documentation <https://werkzeug.palletsprojects.com/>`_
es: `Documentación de Werkzeug <https://werkzeug.palletsprojects.com/>`_

source: User's Guide
es: Guía del usuario
fr: Guide de l'utilisateur

source: This part of the documentation, which is mostly prose, begins with some background information about Flask, then focuses on step-by-step instructions for web development with Flask.
es: Esta parte de la documentación, que es en su mayor parte prosa, comienza con algo de información de fondo sobre Flask, y luego se centra en las instrucciones paso a paso para el desarrollo web con Flask.
fr: Cette partie de la documentation, qui est principalement constituée de prose, commence par des informations générales sur Flask, puis se concentre sur des instructions étape par étape pour le développement Web avec Flask.

source: API Reference
es: Referencia de la API
fr: Référence API

source: If you are looking for information on a specific function, class or method, this part of the documentation is for you.
es: Si busca información sobre una función, clase o método específico, esta parte de la documentación es para usted.
fr: Si vous recherchez des informations sur une fonction, une classe ou une méthode spécifique, cette partie de la documentation est faite pour vous.

source: Additional Notes
es: Notas adicionales
fr: Notes supplémentaires

source: Design notes, legal information and changelog are here for the interested.
es: Las notas de diseño, la información legal y el registro de cambios están aquí para los interesados.
fr: Les notes de conception, les informations légales et le journal des modifications sont ici pour les intéressés.
