Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/logging.po
Languages: es, fr

source: Logging
es: Registro
fr: Journalisation

source: Flask uses standard Python :mod:`logging`. Messages about your Flask application are logged with :meth:`app.logger <flask.Flask.logger>`, which takes the same name as :attr:`app.name <flask.Flask.name>`. This logger can also be used to log your own messages.
es: Flask utiliza el estándar de Python :mod:`logging`. Los mensajes sobre tu aplicación Flask se registran con :meth:`app.logger <flask.Flask.logger>`, que toma el mismo nombre que :attr:`app.name <flask.Flask.name>`. Este registrador también se puede utilizar para registrar sus propios mensajes.
fr: Flask utilise le module Python :mod:`logging` standard. Les messages de votre application Flask sont transmis via la méthode :meth:`app.logger <flask.Flask.logger>` qui utilise le même nom que :attr:`app.name <flask.Flask.name>`. Ce logger peut également être utilisé pour enregistrer vos propres messages.

source: If you don't configure logging, Python's default log level is usually 'warning'. Nothing below the configured level will be visible.
es: Si no configuras el registro, el nivel de registro por defecto de Python suele ser 'warning'. Nada por debajo del nivel configurado será visible.
fr: Si vous ne configurez pas la journalisation, le niveau de log par défaut de Python est généralement "warning". Aucun message dont le niveau est situé sous celui configuré ne sera enregistré.

source: Basic Configuration
es: Configuración básica
fr: Configuration de base

source: When you want to configure logging for your project, you should do it as soon as possible when the program starts. If :meth:`app.logger <flask.Flask.logger>` is accessed before logging is configured, it will add a default handler. If possible, configure logging before creating the application object.
es: Cuando quieras configurar el logging para tu proyecto, debes hacerlo lo antes posible al iniciar el programa. Si se accede a :meth:`app.logger <flask.Flask.logger>` antes de configurar el registro, se añadirá un manejador por defecto. Si es posible, configure el registro antes de crear el objeto de la aplicación.
fr: Lorsque vous souhaitez configurer la journalisation de votre projet, vous devez le faire dès que possible lorsque l'application démarre. Si la méthode :meth:`app.logger <flask.Flask.logger>` est appelée avant que la journalisation soit configurée, elle utilisera le gestionnaire par défaut. Il est donc recommandé de configurer la journalisation avant même la création de l'objet application.

source: This example uses :func:`~logging.config.dictConfig` to create a logging configuration similar to Flask's default, except for all logs::
es: Este ejemplo utiliza :func:`~logging.config.dictConfig` para crear una configuración de registro similar a la predeterminada de Flask, excepto para todos los registros::
fr: Cet exemple utilise :func:`~logging.config.dictConfig` afin de créer une configuration similaire à celle par défaut de Flask pour l'ensemble de la journalisation::

source: Default Configuration
es: Configuración por defecto
fr: Configuration par défaut

source: If you do not configure logging yourself, Flask will add a :class:`~logging.StreamHandler` to :meth:`app.logger <flask.Flask.logger>` automatically. During requests, it will write to the stream specified by the WSGI server in ``environ['wsgi.errors']`` (which is usually :data:`sys.stderr`). Outside a request, it will log to :data:`sys.stderr`.
es: Si no configuras el registro tú mismo, Flask añadirá un :class:`~logging.StreamHandler` a :meth:`app.logger <flask.Flask.logger>` automáticamente. Durante las peticiones, escribirá en el flujo especificado por el servidor WSGI en ``environ['wsgi.errors']`` (que suele ser :data:`sys.stderr`). Fuera de una petición, se registrará en :data:`sys.stderr`.
fr: Si vous ne configurez pas la journalisation, Flask ajoutera automatiquement un :class:`~logging.StreamHandler` à la méthode :meth:`app.logger <flask.Flask.logger>`. Lors de chaque appel à une requête, il écrira alors dans le flux spécifié par le serveur WSGI via ``environ['wsgi.errors']`` (qui vaut en général :data:`sys.stderr`). Hors des appels aux requêtes, il écrira sur :data:`sys.stderr`.

source: Removing the Default Handler
es: Eliminación del manejador por defecto
fr: Supprimer le gestionnaire par défaut

source: If you configured logging after accessing :meth:`app.logger <flask.Flask.logger>`, and need to remove the default handler, you can import and remove it::
es: Si has configurado el registro después de acceder a :meth:`app.logger <flask.Flask.logger>`, y necesitas eliminar el manejador por defecto, puedes importarlo y eliminarlo::
fr: Si vous configurez la journalisation après avoir accédé à la méthode :meth:`app.logger <flask.Flask.logger>`, et que vous souhaitez retirer le gestionnaire par défaut, vous pouvez l'importez pour le supprimer::

source: Email Errors to Admins
es: Errores de correo electrónico a los administradores
fr: Envoyer les erreurs par mail aux admins

source: When running the application on a remote server for production, you probably won't be looking at the log messages very often. The WSGI server will probably send log messages to a file, and you'll only check that file if a user tells you something went wrong.
es: Cuando se ejecuta la aplicación en un servidor remoto para producción, probablemente no mirará los mensajes de registro muy a menudo. El servidor WSGI probablemente enviará los mensajes de registro a un archivo, y usted sólo revisará ese archivo si un usuario le dice que algo salió mal.
fr: Lorsque l'application est exécutée sur un serveur de production, il est sans doute peu vraisemblable que vous regarderez les messages de logs régulièrement. Le serveur WSGI enverra probablement les messages dans un fichier qui ne sera alors exploité que lorsqu'un utilisateur signalera qu'un problème est survenu.

source: To be proactive about discovering and fixing bugs, you can configure a :class:`logging.handlers.SMTPHandler` to send an email when errors and higher are logged. ::
es: Para ser proactivo a la hora de descubrir y arreglar errores, puedes configurar un :class:`logging.handlers.SMTPHandler` para que envíe un correo electrónico cuando se registren errores y superiores ::
fr: Afin d'être proactif sur les problèmes, vous pouvez configurer un gestionnaire SMTP :class:`logging.handlers.SMTPHandler` afin de transmettre les messages de niveau "erreur" et plus par mail. ::

source: This requires that you have an SMTP server set up on the same server. See the Python docs for more information about configuring the handler.
es: Esto requiere que tengas un servidor SMTP configurado en el mismo servidor. Consulte los documentos de Python para obtener más información sobre la configuración del gestorr.
fr: Cela nécessite un serveur SMTP configuré sur le même serveur. Voir la documentation Python pour plus d'informations sur la configuration de ce gestionnaire.

source: Injecting Request Information
es: Solicitud de información sobre inyecciones
fr: Ajouter des informations de la Requête

source: Seeing more information about the request, such as the IP address, may help debugging some errors. You can subclass :class:`logging.Formatter` to inject your own fields that can be used in messages. You can change the formatter for Flask's default handler, the mail handler defined above, or any other handler. ::
es: Ver más información sobre la solicitud, como la dirección IP, puede ayudar a depurar algunos errores. Puedes subclasificar :class:`logging.Formatter` para inyectar tus propios campos que pueden ser utilizados en los mensajes. Puedes cambiar el formateador por el manejador por defecto de Flask, el manejador de correo definido arriba, o cualquier otro manejador. ::
fr: Avoir plus d'information à propos de la requête traitée, comme une adresse IP, peut vous aider à résoudre vos problèmes. Vous pouvez créer une sous-classe de :class:`logging.Formatter` afin d'injecter vos propres données dans les messages. Vous pouvez adapter le formatage du gestionnaire par défaut de Flask, le gestionnaire par mail défini ci-dessus, ou n'importe quel autre. ::

source: Other Libraries
es: Otras bibliotecas
fr: Autres librairies

source: Other libraries may use logging extensively, and you want to see relevant messages from those logs too. The simplest way to do this is to add handlers to the root logger instead of only the app logger. ::
es: Otras bibliotecas pueden utilizar el registro extensivamente, y usted quiere ver los mensajes relevantes de esos registros también. La forma más sencilla de hacerlo es añadir manejadores al logger raíz en lugar de sólo al logger de la aplicación. ::
fr: D'autres librairies peuvent utiliser la journalisation et il est alors nécessaire de récupérer leurs messages. La manière la plus simple est d'ajouter des gestionnaires au logger racine en plus de celui de l'application. ::

source: Depending on your project, it may be more useful to configure each logger you care about separately, instead of configuring only the root logger. ::
es: Dependiendo de su proyecto, puede ser más útil configurar cada registrador que le interese por separado, en lugar de configurar sólo el registrador raíz. ::
fr: Cependant, et suivant votre projet, il peut être plus intéressant de configurer chaque logger séparément au lieu d'utiliser seulement le logger racine. ::

source: Werkzeug logs basic request/response information to the ``'werkzeug'`` logger. If the root logger has no handlers configured, Werkzeug adds a :class:`~logging.StreamHandler` to its logger.
es: Werkzeug registra la información básica de solicitud/respuesta en el logger ``'werkzeug'``. Si el logger raíz no tiene configurado ningún manejador, Werkzeug añade un :class:`~logging.StreamHandler` a su logger.
fr: Werkzeug utilise son propre logger ``'werkzeug'`` pour écrire les informations basiques des requêtes et des réponses. Si le logger racine n'a pas de gestionnaire configuré, Werkzeug ajoute une classe :class:`~logging.StreamHandler` à son logger.

source: Flask Extensions
es: Extensiones de Flask
fr: Les extensions Flask

source: Depending on the situation, an extension may choose to log to :meth:`app.logger <flask.Flask.logger>` or its own named logger. Consult each extension's documentation for details.
es: Dependiendo de la situación, una extensión puede elegir registrar en :meth:`app.logger <flask.Flask.logger>` o en su propio logger con nombre. Consulte la documentación de cada extensión para más detalles.
fr: Certaines extensions peuvent choisir d'utiliser la méthode :meth:`app.logger <flask.Flask.logger>` ou bien leur propre logger pour leur journalisation. Il est nécessaire de vérifier la documentation de chaque extension pour les détails à ce sujet.
