Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/quickstart.po
Languages: es

source: You may still want to log that something fishy happened. This is where loggers come in handy. As of Flask 0.3 a logger is preconfigured for you to use.
es: Puede que aún así quieras registrar que ha ocurrido algo sospechoso. Aquí es donde los registradores son útiles. A partir de la versión 0.3 de Flask, se ha preconfigurado un registrador para su uso.

source: Here are some example log calls::
es: Aquí hay algunos ejemplos de llamadas de registro::

source: The attached :attr:`~flask.Flask.logger` is a standard logging :class:`~logging.Logger`, so head over to the official :mod:`logging` docs for more information.
es: El :attr:`~flask.Flask.logger` adjunto es un :class:`~logging.Logger` estándar de registro, así que dirígete a la documentación oficial de :mod:`logging` para más información.

source: See :doc:`errorhandling`.
es: Ver :doc:`errorhandling`.

source: Hooking in WSGI Middleware
es: Hooking en el WSGI middleware

source: To add WSGI middleware to your Flask application, wrap the application's ``wsgi_app`` attribute. For example, to apply Werkzeug's :class:`~werkzeug.middleware.proxy_fix.ProxyFix` middleware for running behind Nginx:
es: Para añadir WSGI middleware a tu aplicación Flask, envuelve el atributo ``wsgi_app`` de la aplicación. Por ejemplo, para aplicar el middleware :class:`~werkzeug.middleware.proxy_fix.ProxyFix` de Werkzeug para ejecutar detrás de Nginx:

source: Wrapping ``app.wsgi_app`` instead of ``app`` means that ``app`` still points at your Flask application, not at the middleware, so you can continue to use and configure ``app`` directly.
es: Envolver ``app.wsgi_app`` en lugar de ``app`` significa que ``app`` sigue apuntando a tu aplicación Flask, no al middleware, por lo que puedes seguir utilizando y configurando ``app`` directamente.

source: Using Flask Extensions
es: Uso de las extensiones de Flask

source: Extensions are packages that help you accomplish common tasks. For example, Flask-SQLAlchemy provides SQLAlchemy support that makes it simple and easy to use with Flask.
es: Las extensiones son paquetes que ayudan a realizar tareas comunes. Por ejemplo, Flask-SQLAlchemy proporciona soporte para SQLAlchemy que lo hace simple y fácil de usar con Flask.

source: For more on Flask extensions, see :doc:`extensions`.
es: Para más información sobre las extensiones de Flask, véase :doc:`extensions`.

source: Deploying to a Web Server
es: Despliegue en un servidor web

source: Ready to deploy your new Flask app? See :doc:`deploying/index`.
es: ¿Listo para desplegar tu nueva aplicación Flask? Consulte :doc:`deploying/index`.
