Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/quickstart.po
Languages: es

source: Eager to get started? This page gives a good introduction to Flask. Follow :doc:`installation` to set up a project and install Flask first.
es: ¿Ansioso por empezar? Esta página ofrece una buena introducción a Flask. Sigue :doc:`installation` para configurar un proyecto e instalar Flask primero.

source: A Minimal Application
es: Una aplicación sencilla

source: A minimal Flask application looks something like this:
es: Una aplicación Flask sencilla se parece a esto:

source: So what did that code do?
es: ¿Y qué hacía ese código?

source: First we imported the :class:`~flask.Flask` class. An instance of this class will be our WSGI application.
es: Primero importamos la clase :class:`~flask.Flask`. Una instancia de esta clase será nuestra aplicación WSGI.

source: Next we create an instance of this class. The first argument is the name of the application's module or package. ``__name__`` is a convenient shortcut for this that is appropriate for most cases. This is needed so that Flask knows where to look for resources such as templates and static files.
es: A continuación creamos una instancia de esta clase. El primer argumento es el nombre del módulo o paquete de la aplicación. ``__name__`` es un atajo conveniente para esto que es apropiado para la mayoría de los casos. Esto es necesario para que Flask sepa dónde buscar recursos como plantillas y archivos estáticos.

source: We then use the :meth:`~flask.Flask.route` decorator to tell Flask what URL should trigger our function.
es: A continuación, utilizamos el decorador :meth:`~flask.Flask.route` para indicar a Flask qué URL debe activar nuestra función.

source: The function returns the message we want to display in the user's browser. The default content type is HTML, so HTML in the string will be rendered by the browser.
es: La función devuelve el mensaje que queremos mostrar en el navegador del usuario. El tipo de contenido por defecto es HTML, por lo que el HTML de la cadena será renderizado por el navegador.

source: Save it as :file:`hello.py` or something similar. Make sure to not call your application :file:`flask.py` because this would conflict with Flask itself.
es: Guárdalo como :file:`hello.py` o algo similar. Asegúrate de no llamar a tu aplicación :file:`flask.py` porque esto entraría en conflicto con el propio Flask.

source: To run the application, use the :command:`flask` command or :command:`python -m flask`. Before you can do that you need to tell your terminal the application to work with by exporting the ``FLASK_APP`` environment variable:
es: Para ejecutar la aplicación, utiliza el comando :command:`flask` o :command:`python -m flask`. Antes de que puedas hacer eso necesitas decirle a tu terminal la aplicación con la que debe trabajar exportando la variable de entorno ``FLASK_APP``:

source: Application Discovery Behavior
es: Comportamiento del descubrimiento de aplicaciones

source: As a shortcut, if the file is named ``app.py`` or ``wsgi.py``, you don't have to set the ``FLASK_APP`` environment variable. See :doc:`/cli` for more details.
es: Como atajo, si el archivo se llama ``app.py`` o ``wsgi.py``, no es necesario establecer la variable de entorno ``FLASK_APP``. Para más detalles, véase :doc:`/cli`.

source: This launches a very simple builtin server, which is good enough for testing but probably not what you want to use in production. For deployment options see :doc:`deploying/index`.
es: Esto lanza un servidor incorporado muy simple, que es lo suficientemente bueno para las pruebas, pero probablemente no es lo que quieres usar en producción. Para ver las opciones de despliegue vea :doc:`deploying/index`.

source: Now head over to http://127.0.0.1:5000/, and you should see your hello world greeting.
es: Ahora dirígete a http://127.0.0.1:5000/, y deberías ver tu saludo de hola mundo.

source: Externally Visible Server
es: Servidor visible desde el exterior

source: If you run the server you will notice that the server is only accessible from your own computer, not from any other in the network. This is the default because in debugging mode a user of the application can execute arbitrary Python code on your computer.
es: Si ejecutas el servidor notarás que el servidor sólo es accesible desde tu propio ordenador, no desde ningún otro de la red. Este es el valor por defecto porque en el modo de depuración un usuario de la aplicación puede ejecutar código Python arbitrario en su ordenador.

source: If you have the debugger disabled or trust the users on your network, you can make the server publicly available simply by adding ``--host=0.0.0.0`` to the command line::
es: Si tienes el depurador desactivado o confías en los usuarios de tu red, puedes hacer que el servidor esté disponible públicamente simplemente añadiendo ``--host=0.0.0`` a la línea de comandos::

source: This tells your operating system to listen on all public IPs.
es: Esto le dice a su sistema operativo que escuche en todas las IPs públicas.

source: What to do if the Server does not Start
es: Qué hacer si el servidor no se inicia

source: In case the :command:`python -m flask` fails or :command:`flask` does not exist, there are multiple reasons this might be the case. First of all you need to look at the error message.
es: En caso de que el :command:`python -m flask` falle o el :command:`flask` no exista, hay múltiples razones por las que puede ser así. En primer lugar hay que mirar el mensaje de error.

source: Old Version of Flask
es: Versión antigua de Flask

source: Versions of Flask older than 0.11 used to have different ways to start the application. In short, the :command:`flask` command did not exist, and neither did :command:`python -m flask`. In that case you have two options: either upgrade to newer Flask versions or have a look at :doc:`/server` to see the alternative method for running a server.
es: Las versiones de Flask anteriores a la 0.11 solían tener diferentes formas de iniciar la aplicación. En resumen, el comando :command:`flask` no existía, y tampoco :command:`python -m flask`. En ese caso tienes dos opciones: O actualizar a versiones más recientes de Flask o echar un vistazo a :doc:`/server` para ver el método alternativo para ejecutar un servidor.

source: Invalid Import Name
es: Nombre de importación inválido

source: The ``FLASK_APP`` environment variable is the name of the module to import at :command:`flask run`. In case that module is incorrectly named you will get an import error upon start (or if debug is enabled when you navigate to the application). It will tell you what it tried to import and why it failed.
es: La variable de entorno ``FLASK_APP`` es el nombre del módulo a importar en :command:`flask run`. En caso de que ese módulo tenga un nombre incorrecto, obtendrá un error de importación al iniciarse (o si la depuración está activada al navegar por la aplicación). Te dirá qué ha intentado importar y por qué ha fallado.

source: The most common reason is a typo or because you did not actually create an ``app`` object.
es: La razón más común es un error tipográfico o porque no has creado un objeto ``app``.

source: Debug Mode
es: Modo de depuración

source: The ``flask run`` command can do more than just start the development server. By enabling debug mode, the server will automatically reload if code changes, and will show an interactive debugger in the browser if an error occurs during a request.
es: El comando ``flask run`` puede hacer algo más que iniciar el servidor de desarrollo. Al activar el modo de depuración, el servidor se recargará automáticamente si el código cambia, y mostrará un depurador interactivo en el navegador si se produce un error durante una solicitud.

source: The debugger allows executing arbitrary Python code from the browser. It is protected by a pin, but still represents a major security risk. Do not run the development server or debugger in a production environment.
es: El depurador permite ejecutar código Python arbitrario desde el navegador. Está protegido por un pin, pero sigue representando un riesgo de seguridad importante. No ejecute el servidor de desarrollo o el depurador en un entorno de producción.

source: To enable all development features, set the ``FLASK_ENV`` environment variable to ``development`` before calling ``flask run``.
es: Para habilitar todas las funciones de desarrollo, establece la variable de entorno ``FLASK_ENV`` como ``development`` antes de llamar a ``flask run``.

source: See also:
es: Vea también:

source: :doc:`/server` and :doc:`/cli` for information about running in development mode.
es: :doc:`/server` y :doc:`/cli` para información sobre la ejecución en modo de desarrollo.

source: :doc:`/debugging` for information about using the built-in debugger and other debuggers.
es: :doc:`/debugging` para información sobre el uso del depurador incorporado y otros depuradores.

source: :doc:`/logging` and :doc:`/errorhandling` to log errors and display nice error pages.
es: :doc:`/logging` y :doc:`/errorhandling` para registrar errores y mostrar páginas de error agradables.

source: HTML Escaping
es: Escape de HTML

source: When returning HTML (the default response type in Flask), any user-provided values rendered in the output must be escaped to protect from injection attacks. HTML templates rendered with Jinja, introduced later, will do this automatically.
es: Cuando se devuelve HTML (el tipo de respuesta por defecto en Flask), cualquier valor proporcionado por el usuario en la salida debe ser escapado para protegerlo de ataques de inyección. Las plantillas HTML renderizadas con Jinja, introducidas más tarde, harán esto automáticamente.

source: :func:`~markupsafe.escape`, shown here, can be used manually. It is omitted in most examples for brevity, but you should always be aware of how you're using untrusted data.
es: :func:`~markupsafe.escape`, que se muestra aquí, puede utilizarse manualmente. Se omite en la mayoría de los ejemplos por razones de brevedad, pero siempre debes ser consciente de cómo estás utilizando datos no confiables.

source: If a user managed to submit the name ``<script>alert("bad")</script>``, escaping causes it to be rendered as text, rather than running the script in the user's browser.
es: Si un usuario logró enviar el nombre ``<script>alert("bad")</script>``, el escape hace que se renderice como texto, en lugar de ejecutar el script en el navegador del usuario.

source: ``<name>`` in the route captures a value from the URL and passes it to the view function. These variable rules are explained below.
es: La variable ``<name>`` en la ruta captura un valor de la URL y lo pasa a la función de la vista. Estas reglas de las variables se explican a continuación.

source: Routing
es: Enrutamiento

source: Modern web applications use meaningful URLs to help users. Users are more likely to like a page and come back if the page uses a meaningful URL they can remember and use to directly visit a page.
es: Las aplicaciones web modernas utilizan URLs significativas para ayudar a los usuarios. Es más probable que a los usuarios les guste una página y vuelvan si la página utiliza una URL significativa que puedan recordar y utilizar para visitar directamente una página.

source: Use the :meth:`~flask.Flask.route` decorator to bind a function to a URL. ::
es: Utilice el decorador :meth:`~flask.Flask.route` para vincular una función a una URL. ::

source: You can do more! You can make parts of the URL dynamic and attach multiple rules to a function.
es: Puedes hacer más. Puedes hacer que partes de la URL sean dinámicas y adjuntar múltiples reglas a una función.

source: Variable Rules
es: Normas variables

source: You can add variable sections to a URL by marking sections with ``<variable_name>``. Your function then receives the ``<variable_name>`` as a keyword argument. Optionally, you can use a converter to specify the type of the argument like ``<converter:variable_name>``. ::
es: Puedes añadir secciones variables a una URL marcando las secciones con ``<nombre_de_variable>``. Su función recibe entonces el ``<nombre_de_variable>`` como argumento de palabra clave. Opcionalmente, puedes usar un convertidor para especificar el tipo de argumento como ``<converter:nombre_de_variable>``. ::

source: Converter types:
es: Tipos de convertidores:

source: (default) accepts any text without a slash
es: (Por defecto) acepta cualquier texto sin barra

source: accepts positive integers
es: acepta números enteros positivos

source: accepts positive floating point values
es: acepta valores positivos en coma flotante

source: like ``string`` but also accepts slashes
es: como ``string`` pero también acepta barras inclinadas

source: accepts UUID strings
es: acepta cadenas (string) UUID

source: Unique URLs / Redirection Behavior
es: URLs únicas / Comportamiento de la redirección

source: The following two rules differ in their use of a trailing slash. ::
es: Las dos reglas siguientes difieren en el uso de la barra diagonal final::

source: The canonical URL for the ``projects`` endpoint has a trailing slash. It's similar to a folder in a file system. If you access the URL without a trailing slash (``/projects``), Flask redirects you to the canonical URL with the trailing slash (``/projects/``).
es: La URL canónica del endpoint ``projects`` tiene una barra al final. Es similar a una carpeta en un sistema de archivos. Si accedes a la URL sin la barra final (``/projects``), Flask te redirige a la URL canónica con la barra final (``/projects/``).

source: The canonical URL for the ``about`` endpoint does not have a trailing slash. It's similar to the pathname of a file. Accessing the URL with a trailing slash (``/about/``) produces a 404 "Not Found" error. This helps keep URLs unique for these resources, which helps search engines avoid indexing the same page twice.
es: La URL canónica para el endpoint ``about`` no tiene una barra al final. Es similar a la ruta de un archivo. El acceso a la URL con una barra al final (``/about/``) produce un error 404 "Not Found". Esto ayuda a mantener las URLs únicas para estos recursos, lo que ayuda a los motores de búsqueda a evitar indexar la misma página dos veces.

source: URL Building
es: Construcción de URLs

source: To build a URL to a specific function, use the :func:`~flask.url_for` function. It accepts the name of the function as its first argument and any number of keyword arguments, each corresponding to a variable part of the URL rule. Unknown variable parts are appended to the URL as query parameters.
es: Para construir una URL a una función específica, utilice la función :func:`~flask.url_for`. Acepta el nombre de la función como primer argumento y cualquier número de argumentos de palabra clave, cada uno correspondiente a una parte variable de la regla de la URL. Las partes variables desconocidas se añaden a la URL como parámetros de consulta.

source: Why would you want to build URLs using the URL reversing function :func:`~flask.url_for` instead of hard-coding them into your templates?
es: ¿Por qué querrías construir URLs usando la función de inversión de URLs :func:`~flask.url_for` en lugar de codificarlas en tus plantillas?

source: Reversing is often more descriptive than hard-coding the URLs.
es: La inversión suele ser más descriptiva que la codificación de las URL.

source: You can change your URLs in one go instead of needing to remember to manually change hard-coded URLs.
es: Puedes cambiar tus URLs de una sola vez en lugar de tener que recordar cambiar manualmente las URLs codificadas.

source: URL building handles escaping of special characters transparently.
es: La construcción de URLs maneja el escape de caracteres especiales de forma transparente.

source: The generated paths are always absolute, avoiding unexpected behavior of relative paths in browsers.
es: Las rutas generadas son siempre absolutas, evitando el comportamiento inesperado de las rutas relativas en los navegadores.

source: If your application is placed outside the URL root, for example, in ``/myapplication`` instead of ``/``, :func:`~flask.url_for` properly handles that for you.
es: Si tu aplicación está situada fuera de la raíz de la URL, por ejemplo, en ``/mi_aplicacion`` en lugar de ``/``, :func:`~flask.url_for` lo gestiona adecuadamente.

source: For example, here we use the :meth:`~flask.Flask.test_request_context` method to try out :func:`~flask.url_for`. :meth:`~flask.Flask.test_request_context` tells Flask to behave as though it's handling a request even while we use a Python shell. See :ref:`context-locals`.
es: Por ejemplo, aquí usamos el método :meth:`~flask.Flask.test_request_context` para probar :func:`~flask.url_for`. :meth:`~flask.Flask.test_request_context` le dice a Flask que se comporte como si estuviera manejando una petición incluso mientras usamos un shell de Python. Ver :ref:`context-locals`.

source: HTTP Methods
es: Métodos HTTP

source: Web applications use different HTTP methods when accessing URLs. You should familiarize yourself with the HTTP methods as you work with Flask. By default, a route only answers to ``GET`` requests. You can use the ``methods`` argument of the :meth:`~flask.Flask.route` decorator to handle different HTTP methods. ::
es: Las aplicaciones web utilizan diferentes métodos HTTP para acceder a las URL. Debes familiarizarte con los métodos HTTP mientras trabajas con Flask. Por defecto, una ruta sólo responde a peticiones ``GET``. Puedes utilizar el argumento ``methods`` del decorador :meth:`~flask.Flask.route` para manejar diferentes métodos HTTP::

source: If ``GET`` is present, Flask automatically adds support for the ``HEAD`` method and handles ``HEAD`` requests according to the `HTTP RFC`_. Likewise, ``OPTIONS`` is automatically implemented for you.
es: Si ``GET`` está presente, Flask añade automáticamente soporte para el método ``HEAD`` y maneja las peticiones ``HEAD`` de acuerdo con el `HTTP RFC`_. Del mismo modo, ``OPTIONS`` se implementa automáticamente por ti.

source: Static Files
es: Archivos estáticos

source: Dynamic web applications also need static files. That's usually where the CSS and JavaScript files are coming from. Ideally your web server is configured to serve them for you, but during development Flask can do that as well. Just create a folder called :file:`static` in your package or next to your module and it will be available at ``/static`` on the application.
es: Las aplicaciones web dinámicas también necesitan archivos estáticos. Por lo general, de ahí vienen los archivos CSS y JavaScript. Idealmente tu servidor web está configurado para servirlos por ti, pero durante el desarrollo Flask puede hacerlo también. Simplemente crea una carpeta llamada :file:`static` en tu paquete o junto a tu módulo y estará disponible en ``/static`` en la aplicación.

source: To generate URLs for static files, use the special ``'static'`` endpoint name::
es: Para generar URLs para archivos estáticos, utilice el nombre de endpoint especial ``'static'``::

source: The file has to be stored on the filesystem as :file:`static/style.css`.
es: El archivo debe ser almacenado en el sistema de archivos como :file:`static/style.css`.

source: Rendering Templates
es: Plantillas de renderizado

source: Generating HTML from within Python is not fun, and actually pretty cumbersome because you have to do the HTML escaping on your own to keep the application secure. Because of that Flask configures the `Jinja2 <https://palletsprojects.com/p/jinja/>`_ template engine for you automatically.
es: Generar HTML desde Python no es divertido, y en realidad es bastante engorroso porque tienes que hacer el escape de HTML por tu cuenta para mantener la aplicación segura. Por eso Flask configura el motor de plantillas `Jinja2 <https://palletsprojects.com/p/jinja/>`_ por ti automáticamente.

source: To render a template you can use the :func:`~flask.render_template` method. All you have to do is provide the name of the template and the variables you want to pass to the template engine as keyword arguments. Here's a simple example of how to render a template::
es: Para renderizar una plantilla puedes utilizar el método :func:`~flask.render_template`. Todo lo que tienes que hacer es proporcionar el nombre de la plantilla y las variables que quieres pasar al motor de plantillas como argumentos de palabra clave. Este es un ejemplo sencillo de cómo renderizar una plantilla::

source: Flask will look for templates in the :file:`templates` folder. So if your application is a module, this folder is next to that module, if it's a package it's actually inside your package:
es: Flask buscará las plantillas en la carpeta :file:`templates`. Así que si su aplicación es un módulo, esta carpeta está al lado de ese módulo, si es un paquete está realmente dentro de su paquete:

source: **Case 1**: a module::
es: **Caso 1**: Un módulo::

source: **Case 2**: a package::
es: **Caso 2**: Un paquete::

source: For templates you can use the full power of Jinja2 templates. Head over to the official `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ for more information.
es: Para las plantillas puedes utilizar toda la potencia de las plantillas de Jinja2. Dirígete a la documentación oficial de `Jinja2 Template Documentation <https://jinja.palletsprojects.com/templates/>`_ para más información.

source: Here is an example template:
es: Aquí tiene una plantilla de ejemplo:

source: Inside templates you also have access to the :class:`~flask.request`, :class:`~flask.session` and :class:`~flask.g` [#]_ objects as well as the :func:`~flask.get_flashed_messages` function.
es: Dentro de las plantillas también tienes acceso a los objetos :class:`~flask.request`, :class:`~flask.session` y :class:`~flask.g` [#]_ así como a la función :func:`~flask.get_flashed_messages`.

source: Templates are especially useful if inheritance is used. If you want to know how that works, see :doc:`patterns/templateinheritance`. Basically template inheritance makes it possible to keep certain elements on each page (like header, navigation and footer).
es: Las plantillas son especialmente útiles si se utiliza la herencia. Si quieres saber cómo funciona, consulta :doc:`patterns/templateinheritance`. Básicamente la herencia de plantillas permite mantener ciertos elementos en cada página (como la cabecera, la navegación y el pie de página).

source: Automatic escaping is enabled, so if ``name`` contains HTML it will be escaped automatically. If you can trust a variable and you know that it will be safe HTML (for example because it came from a module that converts wiki markup to HTML) you can mark it as safe by using the :class:`~markupsafe.Markup` class or by using the ``|safe`` filter in the template. Head over to the Jinja 2 documentation for more examples.
es: El escape automático está activado, así que si ``name`` contiene HTML será escapado automáticamente. Si puedes confiar en una variable y sabes que será HTML seguro (por ejemplo, porque proviene de un módulo que convierte el marcado wiki en HTML) puedes marcarla como segura usando la clase :class:`~markupsafe.Markup` o usando el filtro ``|safe`` en la plantilla. Dirígete a la documentación de Jinja 2 para ver más ejemplos.

source: Here is a basic introduction to how the :class:`~markupsafe.Markup` class works::
es: He aquí una introducción básica al funcionamiento de la clase :class:`~markupsafe.Markup`::
