Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/quickstart.po
Languages: es

source: Autoescaping is no longer enabled for all templates. The following extensions for templates trigger autoescaping: ``.html``, ``.htm``, ``.xml``, ``.xhtml``. Templates loaded from a string will have autoescaping disabled.
es: El autoescapado ya no está activado para todas las plantillas. Las siguientes extensiones de plantillas activan el autoescapado: ``.html``, ``.htm``, ``.xml``, ``.xhtml``. Las plantillas cargadas desde una cadena tendrán el autoescapado desactivado.

source: Unsure what that :class:`~flask.g` object is? It's something in which you can store information for your own needs. See the documentation for :class:`flask.g` and :doc:`patterns/sqlite3`.
es: ¿No sabes qué es ese objeto :class:`~flask.g`? Es algo en lo que puedes almacenar información para tus propias necesidades. Consulta la documentación de :class:`flask.g` y :doc:`patterns/sqlite3`.

source: Accessing Request Data
es: Acceso a los datos de la solicitud

source: For web applications it's crucial to react to the data a client sends to the server. In Flask this information is provided by the global :class:`~flask.request` object. If you have some experience with Python you might be wondering how that object can be global and how Flask manages to still be threadsafe. The answer is context locals:
es: Para las aplicaciones web es crucial reaccionar a los datos que un cliente envía al servidor. En Flask esta información la proporciona el objeto global :class:`~flask.request`. Si tienes algo de experiencia con Python te preguntarás cómo puede ser global ese objeto y cómo consigue Flask seguir siendo threadsafe. La respuesta es el contexto local:

source: Context Locals
es: Contextos locales

source: Insider Information
es: Información privilegiada

source: If you want to understand how that works and how you can implement tests with context locals, read this section, otherwise just skip it.
es: Si quieres entender cómo funciona esto y cómo puedes implementar pruebas con locales de contexto, lee esta sección, de lo contrario sólo sáltatela.

source: Certain objects in Flask are global objects, but not of the usual kind. These objects are actually proxies to objects that are local to a specific context. What a mouthful. But that is actually quite easy to understand.
es: Algunos objetos en Flask son objetos globales, pero no del tipo habitual. Estos objetos son en realidad proxies de objetos que son locales a un contexto específico. Menudo trabalenguas. Pero en realidad es bastante fácil de entender.

source: Imagine the context being the handling thread. A request comes in and the web server decides to spawn a new thread (or something else, the underlying object is capable of dealing with concurrency systems other than threads). When Flask starts its internal request handling it figures out that the current thread is the active context and binds the current application and the WSGI environments to that context (thread). It does that in an intelligent way so that one application can invoke another application without breaking.
es: Imagina que el contexto es el hilo de manejo. Llega una petición y el servidor web decide generar un nuevo hilo (o algo más, el objeto subyacente es capaz de tratar con sistemas de concurrencia distintos de los hilos). Cuando Flask inicia su gestión interna de peticiones, averigua que el hilo actual es el contexto activo y vincula la aplicación actual y los entornos WSGI a ese contexto (hilo). Lo hace de una manera inteligente para que una aplicación pueda invocar a otra sin romperse.

source: So what does this mean to you? Basically you can completely ignore that this is the case unless you are doing something like unit testing. You will notice that code which depends on a request object will suddenly break because there is no request object. The solution is creating a request object yourself and binding it to the context. The easiest solution for unit testing is to use the :meth:`~flask.Flask.test_request_context` context manager. In combination with the ``with`` statement it will bind a test request so that you can interact with it. Here is an example::
es: ¿Qué significa esto para ti? Básicamente puedes ignorar por completo que esto es así a menos que estés haciendo algo como pruebas unitarias. Te darás cuenta de que el código que depende de un objeto request se romperá de repente porque no hay un objeto request. La solución es crear un objeto request y vincularlo al contexto. La solución más fácil para las pruebas unitarias es utilizar el gestor de contexto :meth:`~flask.Flask.test_request_context`. En combinación con la sentencia ``with`` vinculará una petición de prueba para que puedas interactuar con ella. Aquí hay un ejemplo::

source: The other possibility is passing a whole WSGI environment to the :meth:`~flask.Flask.request_context` method::
es: La otra posibilidad es pasar todo un entorno WSGI al método :meth:`~flask.Flask.request_context`::

source: The Request Object
es: El objeto Request

source: The request object is documented in the API section and we will not cover it here in detail (see :class:`~flask.Request`). Here is a broad overview of some of the most common operations. First of all you have to import it from the ``flask`` module::
es: El objeto request está documentado en la sección API y no lo cubriremos aquí en detalle (ver :class:`~flask.Request`). A continuación, un amplio resumen de algunas de las operaciones más comunes. En primer lugar tienes que importarlo desde el módulo ``flask``::

source: The current request method is available by using the :attr:`~flask.Request.method` attribute. To access form data (data transmitted in a ``POST`` or ``PUT`` request) you can use the :attr:`~flask.Request.form` attribute. Here is a full example of the two attributes mentioned above::
es: El método de solicitud actual está disponible utilizando el atributo :attr:`~flask.Request.method`. Para acceder a los datos del formulario (datos transmitidos en una petición ``POST`` o ``PUT``) se puede utilizar el atributo :attr:`~flask.Request.form`. He aquí un ejemplo completo de los dos atributos mencionados anteriormente::

source: What happens if the key does not exist in the ``form`` attribute? In that case a special :exc:`KeyError` is raised. You can catch it like a standard :exc:`KeyError` but if you don't do that, a HTTP 400 Bad Request error page is shown instead. So for many situations you don't have to deal with that problem.
es: ¿Qué ocurre si la clave no existe en el atributo ``form``? En ese caso se produce un :exc:`KeyError` especial. Puedes cogerlo como un :exc:`KeyError` estándar, pero si no lo haces, se muestra una página de error HTTP 400 Bad Request en su lugar. Así que para muchas situaciones no tienes que lidiar con ese problema.

source: To access parameters submitted in the URL (``?key=value``) you can use the :attr:`~flask.Request.args` attribute::
es: Para acceder a los parámetros enviados en la URL (``?key=value``) puede utilizar el atributo :attr:`~flask.Request.args`::

source: We recommend accessing URL parameters with `get` or by catching the :exc:`KeyError` because users might change the URL and presenting them a 400 bad request page in that case is not user friendly.
es: Recomendamos acceder a los parámetros de la URL con `get` o capturando el :exc:`KeyError` porque los usuarios podrían cambiar la URL y presentarles una página 400 de solicitud incorrecta en ese caso no es amigable para el usuario.

source: For a full list of methods and attributes of the request object, head over to the :class:`~flask.Request` documentation.
es: Para una lista completa de métodos y atributos del objeto request, dirígete a la documentación de :class:`~flask.Request`.

source: File Uploads
es: Carga de archivos

source: You can handle uploaded files with Flask easily. Just make sure not to forget to set the ``enctype="multipart/form-data"`` attribute on your HTML form, otherwise the browser will not transmit your files at all.
es: Puedes manejar los archivos subidos con Flask fácilmente. Sólo asegúrese de no olvidar establecer el atributo ``enctype="multipart/form-data"`` en su formulario HTML, de lo contrario el navegador no transmitirá sus archivos en absoluto.

source: Uploaded files are stored in memory or at a temporary location on the filesystem. You can access those files by looking at the :attr:`~flask.request.files` attribute on the request object. Each uploaded file is stored in that dictionary. It behaves just like a standard Python :class:`file` object, but it also has a :meth:`~werkzeug.datastructures.FileStorage.save` method that allows you to store that file on the filesystem of the server. Here is a simple example showing how that works::
es: Los archivos subidos se almacenan en la memoria o en una ubicación temporal en el sistema de archivos. Puede acceder a esos archivos mirando el atributo :attr:`~flask.request.files` del objeto request. Cada archivo subido se almacena en ese diccionario. Se comporta como un objeto :class:`file` estándar de Python, pero también tiene un método :meth:`~werkzeug.datastructures.FileStorage.save` que permite almacenar ese fichero en el sistema de ficheros del servidor. Aquí hay un ejemplo sencillo que muestra cómo funciona::

source: If you want to know how the file was named on the client before it was uploaded to your application, you can access the :attr:`~werkzeug.datastructures.FileStorage.filename` attribute. However please keep in mind that this value can be forged so never ever trust that value. If you want to use the filename of the client to store the file on the server, pass it through the :func:`~werkzeug.utils.secure_filename` function that Werkzeug provides for you::
es: Si quieres saber cómo se nombró el archivo en el cliente antes de subirlo a tu aplicación, puedes acceder al atributo :attr:`~werkzeug.datastructures.FileStorage.filename`. Sin embargo, ten en cuenta que este valor puede ser falsificado, así que nunca confíes en él. Si quieres utilizar el nombre de archivo del cliente para almacenar el archivo en el servidor, pásalo a través de la función :func:`~werkzeug.utils.secure_filename` que te proporciona Werkzeug::

source: For some better examples, see :doc:`patterns/fileuploads`.
es: Para ver algunos ejemplos mejores, consulte :doc:`patterns/fileuploads`.

source: To access cookies you can use the :attr:`~flask.Request.cookies` attribute. To set cookies you can use the :attr:`~flask.Response.set_cookie` method of response objects. The :attr:`~flask.Request.cookies` attribute of request objects is a dictionary with all the cookies the client transmits. If you want to use sessions, do not use the cookies directly but instead use the :ref:`sessions` in Flask that add some security on top of cookies for you.
es: Para acceder a las cookies se puede utilizar el atributo :attr:`~flask.Request.cookies`. Para establecer las cookies se puede utilizar el método :attr:`~flask.Response.set_cookie` de los objetos de respuesta. El atributo :attr:`~flask.Request.cookies` de los objetos request es un diccionario con todas las cookies que transmite el cliente. Si quieres utilizar sesiones, no utilices las cookies directamente, sino que utiliza la :ref:`sessions` de Flask que añade algo de seguridad sobre las cookies por ti.

source: Reading cookies::
es: Leyendo cookies::

source: Storing cookies::
es: Almacenando cookies::

source: Note that cookies are set on response objects. Since you normally just return strings from the view functions Flask will convert them into response objects for you. If you explicitly want to do that you can use the :meth:`~flask.make_response` function and then modify it.
es: Tenga en cuenta que las cookies se establecen en los objetos de respuesta. Como normalmente sólo devuelves cadenas desde las funciones de la vista, Flask las convertirá en objetos de respuesta por ti. Si quieres hacerlo explícitamente puedes usar la función :meth:`~flask.make_response` y luego modificarla.

source: Sometimes you might want to set a cookie at a point where the response object does not exist yet. This is possible by utilizing the :doc:`patterns/deferredcallbacks` pattern.
es: A veces puede querer establecer una cookie en un punto en el que el objeto de respuesta aún no existe. Esto es posible utilizando el patrón :doc:`patterns/deferredcallbacks`.

source: For this also see :ref:`about-responses`.
es: Para ello, consulte también :ref:`about-responses`.

source: Redirects and Errors
es: Redirecciones y errores

source: To redirect a user to another endpoint, use the :func:`~flask.redirect` function; to abort a request early with an error code, use the :func:`~flask.abort` function::
es: Para redirigir a un usuario a otro endpoint, utilice la función :func:`~flask.redirect`; para abortar una solicitud antes de tiempo con un código de error, utilice la función :func:`~flask.abort`::

source: This is a rather pointless example because a user will be redirected from the index to a page they cannot access (401 means access denied) but it shows how that works.
es: Este es un ejemplo bastante inútil porque un usuario será redirigido desde el índice a una página a la que no puede acceder (401 significa acceso denegado) pero muestra cómo funciona.

source: By default a black and white error page is shown for each error code. If you want to customize the error page, you can use the :meth:`~flask.Flask.errorhandler` decorator::
es: Por defecto se muestra una página de error en blanco y negro para cada código de error. Si quieres personalizar la página de error, puedes usar el decorador :meth:`~flask.Flask.errorhandler`::

source: Note the ``404`` after the :func:`~flask.render_template` call. This tells Flask that the status code of that page should be 404 which means not found. By default 200 is assumed which translates to: all went well.
es: Observa el ``404`` después de la llamada :func:`~flask.render_template`. Esto le dice a Flask que el código de estado de esa página debe ser 404 que significa no encontrado. Por defecto se asume 200 que se traduce en: todo ha ido bien.

source: See :doc:`errorhandling` for more details.
es: Consulte :doc:`errorhandling` para más detalles.

source: About Responses
es: Acerca de las respuestas

source: The return value from a view function is automatically converted into a response object for you. If the return value is a string it's converted into a response object with the string as response body, a ``200 OK`` status code and a :mimetype:`text/html` mimetype. If the return value is a dict, :func:`jsonify` is called to produce a response. The logic that Flask applies to converting return values into response objects is as follows:
es: El valor de retorno de una función de la vista se convierte automáticamente en un objeto de respuesta. Si el valor devuelto es una cadena, se convierte en un objeto de respuesta con la cadena como cuerpo de la respuesta, un código de estado ``200 OK`` y un mimetype:`text/html`. Si el valor de retorno es un dict, se llama a :func:`jsonify` para producir una respuesta. La lógica que aplica Flask para convertir los valores de retorno en objetos de respuesta es la siguiente:

source: If a response object of the correct type is returned it's directly returned from the view.
es: Si se devuelve un objeto response del tipo correcto se devuelve directamente desde la vista.

source: If it's a string, a response object is created with that data and the default parameters.
es: Si es una cadena, se crea un objeto response con esos datos y los parámetros por defecto.

source: If it's a dict, a response object is created using ``jsonify``.
es: Si es un dict, se crea un objeto response usando ``jsonify``.

source: If a tuple is returned the items in the tuple can provide extra information. Such tuples have to be in the form ``(response, status)``, ``(response, headers)``, or ``(response, status, headers)``. The ``status`` value will override the status code and ``headers`` can be a list or dictionary of additional header values.
es: Si se devuelve una tupla, los elementos de la tupla pueden proporcionar información extra. Estas tuplas tienen que tener la forma ``(response, state)``, ``(response, headers)``, o ``(response, state, headers)``. El valor ``status`` anulará el código de state y ``headers`` puede ser una lista o diccionario de valores de cabecera adicionales.

source: If none of that works, Flask will assume the return value is a valid WSGI application and convert that into a response object.
es: Si nada de esto funciona, Flask asumirá que el valor de retorno es una aplicación WSGI válida y lo convertirá en un objeto response.

source: If you want to get hold of the resulting response object inside the view you can use the :func:`~flask.make_response` function.
es: Si quieres obtener el objeto respuesta resultante dentro de la vista puedes utilizar la función :func:`~flask.make_response`.

source: Imagine you have a view like this::
es: Imagina que tienes una vista como esta::

source: You just need to wrap the return expression with :func:`~flask.make_response` and get the response object to modify it, then return it::
es: Sólo tienes que envolver la expresión de retorno con :func:`~flask.make_response` y obtener el objeto de respuesta para modificarlo, luego devolverlo::

source: APIs with JSON
es: APIs con JSON

source: A common response format when writing an API is JSON. It's easy to get started writing such an API with Flask. If you return a ``dict`` from a view, it will be converted to a JSON response.
es: Un formato de respuesta común al escribir una API es JSON. Es fácil empezar a escribir una API de este tipo con Flask. Si devuelves un ``dict`` desde una vista, se convertirá en una respuesta JSON.

source: Depending on your API design, you may want to create JSON responses for types other than ``dict``. In that case, use the :func:`~flask.json.jsonify` function, which will serialize any supported JSON data type. Or look into Flask community extensions that support more complex applications.
es: Dependiendo del diseño de tu API, puede que quieras crear respuestas JSON para otros tipos que no sean ``dict``. En ese caso, utiliza la función :func:`~flask.json.jsonify`, que serializará cualquier tipo de datos JSON soportado. O busca en las extensiones de la comunidad Flask que soportan aplicaciones más complejas.

source: Sessions
es: Sesiones

source: In addition to the request object there is also a second object called :class:`~flask.session` which allows you to store information specific to a user from one request to the next. This is implemented on top of cookies for you and signs the cookies cryptographically. What this means is that the user could look at the contents of your cookie but not modify it, unless they know the secret key used for signing.
es: Además del objeto request, existe un segundo objeto llamado :class:`~flask.session` que permite almacenar información específica de un usuario de una solicitud a otra. Esto se implementa encima de las cookies para usted y firma las cookies criptográficamente. Lo que esto significa es que el usuario podría mirar el contenido de su cookie pero no modificarlo, a menos que conozca la clave secreta utilizada para la firma.

source: In order to use sessions you have to set a secret key. Here is how sessions work::
es: Para utilizar las sesiones hay que establecer una clave secreta. Así es como funcionan las sesiones::

source: How to generate good secret keys
es: Cómo generar buenas claves secretas

source: A secret key should be as random as possible. Your operating system has ways to generate pretty random data based on a cryptographic random generator. Use the following command to quickly generate a value for :attr:`Flask.secret_key` (or :data:`SECRET_KEY`)::
es: Una clave secreta debe ser lo más aleatoria posible. Su sistema operativo tiene formas de generar datos bastante aleatorios basados en un generador aleatorio criptográfico. Utilice el siguiente comando para generar rápidamente un valor para :attr:`Flask.secret_key` (o :data:`SECRET_KEY`)::

source: A note on cookie-based sessions: Flask will take the values you put into the session object and serialize them into a cookie. If you are finding some values do not persist across requests, cookies are indeed enabled, and you are not getting a clear error message, check the size of the cookie in your page responses compared to the size supported by web browsers.
es: Una nota sobre las sesiones basadas en cookies: Flask tomará los valores que pongas en el objeto de sesión y los serializará en una cookie. Si encuentra que algunos valores no persisten a través de las solicitudes, las cookies están efectivamente habilitadas, y no está recibiendo un mensaje de error claro, compruebe el tamaño de la cookie en las respuestas de su página en comparación con el tamaño soportado por los navegadores web.

source: Besides the default client-side based sessions, if you want to handle sessions on the server-side instead, there are several Flask extensions that support this.
es: Además de las sesiones por defecto basadas en el lado del cliente, si quieres manejar las sesiones en el lado del servidor, hay varias extensiones de Flask que soportanhis.

source: Message Flashing
es: Mensajes Flash

source: Good applications and user interfaces are all about feedback. If the user does not get enough feedback they will probably end up hating the application. Flask provides a really simple way to give feedback to a user with the flashing system. The flashing system basically makes it possible to record a message at the end of a request and access it on the next (and only the next) request. This is usually combined with a layout template to expose the message.
es: Las buenas aplicaciones e interfaces de usuario se basan en la retroalimentación. Si el usuario no recibe suficiente retroalimentación, probablemente terminará odiando la aplicación. Flask proporciona una forma muy sencilla de dar retroalimentación a un usuario con el sistema de parpadeo. El sistema de parpadeo básicamente permite grabar un mensaje al final de una solicitud y acceder a él en la siguiente (y sólo la siguiente) solicitud. Esto se suele combinar con una plantilla de diseño para exponer el mensaje.

source: To flash a message use the :func:`~flask.flash` method, to get hold of the messages you can use :func:`~flask.get_flashed_messages` which is also available in the templates. See :doc:`patterns/flashing` for a full example.
es: Para flashear un mensaje utilice el método :func:`~flask.flash`, para obtener los mensajes puede utilizar :func:`~flask.get_flashed_messages` que también está disponible en las plantillas. Ver :doc:`patterns/flashing` para un ejemplo completo.

source: Logging
es: Registro

source: Sometimes you might be in a situation where you deal with data that should be correct, but actually is not. For example you may have some client-side code that sends an HTTP request to the server but it's obviously malformed. This might be caused by a user tampering with the data, or the client code failing. Most of the time it's okay to reply with ``400 Bad Request`` in that situation, but sometimes that won't do and the code has to continue working.
es: A veces puedes encontrarte en una situación en la que tratas con datos que deberían ser correctos, pero que en realidad no lo son. Por ejemplo, puedes tener algún código del lado del cliente que envíe una petición HTTP al servidor pero que esté obviamente malformada. Esto puede ser causado por un usuario que manipula los datos, o por un fallo en el código del cliente. La mayoría de las veces está bien responder con ``400 Bad Request`` en esa situación, pero a veces eso no es suficiente y el código tiene que seguir trabajando.
