Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/security.po
Languages: es

source: Security Considerations
es: Consideraciones de seguridad

source: Web applications usually face all kinds of security problems and it's very hard to get everything right. Flask tries to solve a few of these things for you, but there are a couple more you have to take care of yourself.
es: Las aplicaciones web suelen enfrentarse a todo tipo de problemas de seguridad y es muy difícil que todo salga bien. Flask intenta resolver algunas de estas cosas por ti, pero hay un par más de las que tienes que ocuparte tú mismo.

source: Cross-Site Scripting (XSS)
es: Secuencia de comandos en sitios cruzados (XSS)

source: Cross site scripting is the concept of injecting arbitrary HTML (and with it JavaScript) into the context of a website. To remedy this, developers have to properly escape text so that it cannot include arbitrary HTML tags. For more information on that have a look at the Wikipedia article on `Cross-Site Scripting <https://en.wikipedia.org/wiki/Cross-site_scripting>`_.
es: Secuencia de comandos en sitios cruzados es el concepto de inyectar HTML arbitrario (y con él JavaScript) en el contexto de un sitio web. Para remediarlo, los desarrolladores tienen que escapar adecuadamente el texto para que no pueda incluir etiquetas HTML arbitrarias. Para más información al respecto, consulte el artículo de Wikipedia sobre `Cross-Site Scripting <https://en.wikipedia.org/wiki/Cross-site_scripting>`_.

source: Flask configures Jinja2 to automatically escape all values unless explicitly told otherwise. This should rule out all XSS problems caused in templates, but there are still other places where you have to be careful:
es: Flask configura Jinja2 para que escape automáticamente todos los valores a menos que se le indique explícitamente lo contrario. Esto debería descartar todos los problemas de XSS causados en las plantillas, pero todavía hay otros lugares donde hay que tener cuidado:

source: generating HTML without the help of Jinja2
es: generar HTML sin la ayuda de Jinja2

source: calling :class:`~flask.Markup` on data submitted by users
es: llamar a :class:`~flask.Markup` sobre los datos enviados por los usuarios

source: sending out HTML from uploaded files, never do that, use the ``Content-Disposition: attachment`` header to prevent that problem.
es: enviando el HTML de los archivos subidos, nunca lo hagas, utiliza la cabecera ``Content-Disposition: attachment`` para evitar ese problema.

source: sending out textfiles from uploaded files. Some browsers are using content-type guessing based on the first few bytes so users could trick a browser to execute HTML.
es: enviando archivos de texto desde los archivos subidos. Algunos navegadores utilizan la adivinación del tipo de contenido basándose en los primeros bytes, por lo que los usuarios podrían engañar a un navegador para que ejecute HTML.

source: Another thing that is very important are unquoted attributes. While Jinja2 can protect you from XSS issues by escaping HTML, there is one thing it cannot protect you from: XSS by attribute injection. To counter this possible attack vector, be sure to always quote your attributes with either double or single quotes when using Jinja expressions in them:
es: Otra cosa que es muy importante son los atributos no citados. Mientras que Jinja2 puede protegerte de problemas de XSS escapando del HTML, hay una cosa de la que no puede protegerte: XSS por inyección de atributos. Para contrarrestar este posible vector de ataque, asegúrate de citar siempre tus atributos con comillas dobles o simples cuando uses expresiones Jinja en ellos:

source: Why is this necessary? Because if you would not be doing that, an attacker could easily inject custom JavaScript handlers. For example an attacker could inject this piece of HTML+JavaScript:
es: ¿Por qué es necesario? Porque si no lo hicieras, un atacante podría inyectar fácilmente manejadores JavaScript personalizados. Por ejemplo, un atacante podría inyectar esta pieza de HTML+JavaScript:

source: When the user would then move with the mouse over the input, the cookie would be presented to the user in an alert window. But instead of showing the cookie to the user, a good attacker might also execute any other JavaScript code. In combination with CSS injections the attacker might even make the element fill out the entire page so that the user would just have to have the mouse anywhere on the page to trigger the attack.
es: Cuando el usuario se moviera con el ratón sobre la entrada, la cookie se presentaría al usuario en una ventana de alerta. Pero en lugar de mostrar la cookie al usuario, un buen atacante podría también ejecutar cualquier otro código JavaScript. En combinación con inyecciones de CSS, el atacante podría incluso hacer que el elemento llenara toda la página, de modo que el usuario sólo tuviera que tener el ratón en cualquier lugar de la página para desencadenar el ataque.

source: There is one class of XSS issues that Jinja's escaping does not protect against. The ``a`` tag's ``href`` attribute can contain a `javascript:` URI, which the browser will execute when clicked if not secured properly.
es: Hay una clase de problemas de XSS contra los que el escape de Jinja no protege. El atributo ``a`` de la etiqueta ``href`` puede contener un URI `javascript:`, que el navegador ejecutará al hacer clic si no se asegura correctamente.

source: To prevent this, you'll need to set the :ref:`security-csp` response header.
es: Para evitarlo, deberá establecer la cabecera de respuesta :ref:`security-csp`.

source: Cross-Site Request Forgery (CSRF)
es: La falsificación de solicitudes en sitios cruzados (CSRF)

source: Another big problem is CSRF. This is a very complex topic and I won't outline it here in detail just mention what it is and how to theoretically prevent it.
es: Otro gran problema es el CSRF. Este es un tema muy complejo y no lo describiré aquí en detalle, sólo mencionaré lo que es y cómo prevenirlo teóricamente.

source: If your authentication information is stored in cookies, you have implicit state management. The state of "being logged in" is controlled by a cookie, and that cookie is sent with each request to a page. Unfortunately that includes requests triggered by 3rd party sites. If you don't keep that in mind, some people might be able to trick your application's users with social engineering to do stupid things without them knowing.
es: Si tu información de autenticación se almacena en cookies, tienes una gestión de estado implícita. El estado de "estar conectado" es controlado por una cookie, y esa cookie es enviada con cada petición a una página. Desgraciadamente, esto incluye las peticiones realizadas por sitios de terceros. Si no tienes esto en cuenta, algunas personas pueden ser capaces de engañar a los usuarios de tu aplicación con ingeniería social para que hagan cosas estúpidas sin que lo sepan.

source: Say you have a specific URL that, when you sent ``POST`` requests to will delete a user's profile (say ``http://example.com/user/delete``). If an attacker now creates a page that sends a post request to that page with some JavaScript they just have to trick some users to load that page and their profiles will end up being deleted.
es: Digamos que tienes una URL específica a la que, cuando envías peticiones ``POST`` borrará el perfil de un usuario (digamos ``http://example.com/user/delete``). Si ahora un atacante crea una página que envíe una petición de post a esa página con algo de JavaScript sólo tiene que engañar a algunos usuarios para que carguen esa página y sus perfiles acabarán siendo eliminados.

source: Imagine you were to run Facebook with millions of concurrent users and someone would send out links to images of little kittens. When users would go to that page, their profiles would get deleted while they are looking at images of fluffy cats.
es: Imagínate que tuvieras un Facebook con millones de usuarios concurrentes y que alguien enviara enlaces a imágenes de gatitos. Cuando los usuarios fueran a esa página, sus perfiles se borrarían mientras están viendo imágenes de gatitos peludos.

source: How can you prevent that? Basically for each request that modifies content on the server you would have to either use a one-time token and store that in the cookie **and** also transmit it with the form data. After receiving the data on the server again, you would then have to compare the two tokens and ensure they are equal.
es: ¿Cómo se puede evitar eso? Básicamente, para cada solicitud que modifique el contenido en el servidor tendría que utilizar un token de un solo uso y almacenarlo en la cookie **y** también transmitirlo con los datos del formulario. Después de recibir los datos en el servidor de nuevo, usted tendría que comparar los dos tokens y asegurarse de que son iguales.

source: Why does Flask not do that for you? The ideal place for this to happen is the form validation framework, which does not exist in Flask.
es: ¿Por qué Flask no lo hace por ti? El lugar ideal para que esto ocurra es el marco de validación de formularios, que no existe en Flask.

source: JSON Security
es: Seguridad JSON

source: In Flask 0.10 and lower, :func:`~flask.jsonify` did not serialize top-level arrays to JSON. This was because of a security vulnerability in ECMAScript 4.
es: En Flask 0.10 e inferiores, :func:`~flask.jsonify` no serializaba las matrices de nivel superior a JSON. Esto se debía a una vulnerabilidad de seguridad en ECMAScript 4.

source: ECMAScript 5 closed this vulnerability, so only extremely old browsers are still vulnerable. All of these browsers have `other more serious vulnerabilities <https://github.com/pallets/flask/issues/248#issuecomment-59934857>`_, so this behavior was changed and :func:`~flask.jsonify` now supports serializing arrays.
es: ECMAScript 5 cerró esta vulnerabilidad, por lo que sólo los navegadores extremadamente antiguos siguen siendo vulnerables. Todos estos navegadores tienen `otras vulnerabilidades más serias <https://github.com/pallets/flask/issues/248#issuecomment-59934857>`_, así que este comportamiento fue cambiado y :func:`~flask.jsonify` ahora soporta serializar arrays.

source: Security Headers
es: Encabezados de seguridad

source: Browsers recognize various response headers in order to control security. We recommend reviewing each of the headers below for use in your application. The `Flask-Talisman`_ extension can be used to manage HTTPS and the security headers for you.
es: Los navegadores reconocen varias cabeceras de respuesta para controlar la seguridad. Le recomendamos que revise cada una de las cabeceras que aparecen a continuación para utilizarlas en su aplicación. La extensión `Flask-Talisman`_ puede utilizarse para gestionar HTTPS y las cabeceras de seguridad por ti.

source: HTTP Strict Transport Security (HSTS)
es: Seguridad de transporte estricta HTTP (HSTS)

source: Tells the browser to convert all HTTP requests to HTTPS, preventing man-in-the-middle (MITM) attacks. ::
es: Indica al navegador que convierta todas las peticiones HTTP a HTTPS, lo que evita los ataques de tipo man-in-the-middle (MITM). ::

source: Content Security Policy (CSP)
es: Política de seguridad de contenidos (CSP)

source: Tell the browser where it can load various types of resource from. This header should be used whenever possible, but requires some work to define the correct policy for your site. A very strict policy would be::
es: Indica al navegador desde dónde puede cargar varios tipos de recursos. Esta cabecera debería utilizarse siempre que sea posible, pero requiere cierto trabajo para definir la política correcta para su sitio. Una política muy estricta sería::

source: Forces the browser to honor the response content type instead of trying to detect it, which can be abused to generate a cross-site scripting (XSS) attack. ::
es: Obliga al navegador a respetar el tipo de contenido de la respuesta en lugar de intentar detectarlo, lo que puede ser abusado para generar un ataque de cross-site scripting (XSS). ::

source: Prevents external sites from embedding your site in an ``iframe``. This prevents a class of attacks where clicks in the outer frame can be translated invisibly to clicks on your page's elements. This is also known as "clickjacking". ::
es: Evita que sitios externos incrusten su sitio en un ``iframe``. Esto evita una clase de ataques en los que los clics en el marco externo pueden traducirse de forma invisible en clics en los elementos de su página. Esto también se conoce como "clickjacking". ::

source: The browser will try to prevent reflected XSS attacks by not loading the page if the request contains something that looks like JavaScript and the response contains the same data. ::
es: El navegador intentará evitar los ataques XSS reflejados no cargando la página si la petición contiene algo que parezca JavaScript y la respuesta contiene los mismos datos. ::

source: Set-Cookie options
es: Opciones de Set-Cookie

source: These options can be added to a ``Set-Cookie`` header to improve their security. Flask has configuration options to set these on the session cookie. They can be set on other cookies too.
es: Estas opciones se pueden añadir a una cabecera ``Set-Cookie`` para mejorar su seguridad. Flask tiene opciones de configuración para establecerlas en la cookie de sesión. También se pueden establecer en otras cookies.

source: ``Secure`` limits cookies to HTTPS traffic only.
es: ``Secure`` limita las cookies sólo al tráfico HTTPS.

source: ``HttpOnly`` protects the contents of cookies from being read with JavaScript.
es: ``HttpOnly`` protege el contenido de las cookies para que no sean leídas con JavaScript.

source: ``SameSite`` restricts how cookies are sent with requests from external sites. Can be set to ``'Lax'`` (recommended) or ``'Strict'``. ``Lax`` prevents sending cookies with CSRF-prone requests from external sites, such as submitting a form. ``Strict`` prevents sending cookies with all external requests, including following regular links.
es: ``SameSite`` restringe cómo se envían las cookies con las solicitudes de sitios externos. Puede establecerse como ``'Lax'`` (recomendado) o ``'Strict'``. ``Lax`` impide el envío de cookies con las solicitudes propensas a CSRF de sitios externos, como el envío de un formulario. ``Strict`` impide el envío de cookies con todas las solicitudes externas, incluyendo el seguimiento de enlaces regulares.

source: Specifying ``Expires`` or ``Max-Age`` options, will remove the cookie after the given time, or the current time plus the age, respectively. If neither option is set, the cookie will be removed when the browser is closed. ::
es: Especificando las opciones ``Expires`` o ``Max-Age``, se eliminará la cookie después del tiempo dado, o el tiempo actual más la edad, respectivamente. Si no se establece ninguna de las dos opciones, la cookie se eliminará cuando se cierre el navegador. ::

source: For the session cookie, if :attr:`session.permanent <flask.session.permanent>` is set, then :data:`PERMANENT_SESSION_LIFETIME` is used to set the expiration. Flask's default cookie implementation validates that the cryptographic signature is not older than this value. Lowering this value may help mitigate replay attacks, where intercepted cookies can be sent at a later time. ::
es: Para la cookie de sesión, si se establece :attr:`session.permanent <flask.session.permanent>`, entonces se utiliza :data:`PERMANENT_SESSION_LIFETIME` para establecer la caducidad. La implementación de cookies por defecto de Flask valida que la firma criptográfica no sea más antigua que este valor. Bajar este valor puede ayudar a mitigar los ataques de repetición, donde las cookies interceptadas pueden ser enviadas en un momento posterior. ::

source: Use :class:`itsdangerous.TimedSerializer` to sign and validate other cookie values (or any values that need secure signatures).
es: Utiliza :class:`itsdangerous.TimedSerializer` para firmar y validar otros valores de cookies (o cualquier valor que necesite firmas seguras).

source: HTTP Public Key Pinning (HPKP)
es: Fijación de la clave pública HTTP (HPKP)

source: This tells the browser to authenticate with the server using only the specific certificate key to prevent MITM attacks.
es: Esto le dice al navegador que se autentique con el servidor usando sólo la clave del certificado específico para evitar ataques MITM.

source: Be careful when enabling this, as it is very difficult to undo if you set up or upgrade your key incorrectly.
es: Tenga cuidado al activar esto, ya que es muy difícil deshacerlo si configura o actualiza su clave incorrectamente.

source: Copy/Paste to Terminal
es: Copiar/pegar en el terminal

source: Hidden characters such as the backspace character (``\b``, ``^H``) can cause text to render differently in HTML than how it is interpreted if `pasted into a terminal <https://security.stackexchange.com/q/39118>`__.
es: Los caracteres ocultos, como el carácter de retroceso (``\b``, ``^H``), pueden hacer que el texto se muestre de forma diferente en HTML a como se interpreta `si se pega en un terminal <https://security.stackexchange.com/q/39118>`__.

source: For example, ``import y\bose\bm\bi\bt\be\b`` renders as ``import yosemite`` in HTML, but the backspaces are applied when pasted into a terminal, and it becomes ``import os``.
es: Por ejemplo, ``import y\bose\bm\bt\b`` se muestra como ``importar yosemite`` en HTML, pero los espacios traseros se aplican cuando se pega en un terminal, y se convierte en ``importar os``.

source: If you expect users to copy and paste untrusted code from your site, such as from comments posted by users on a technical blog, consider applying extra filtering, such as replacing all ``\b`` characters.
es: Si espera que los usuarios copien y peguen código no fiable de su sitio, como el de los comentarios publicados por los usuarios en un blog técnico, considere la posibilidad de aplicar un filtrado adicional, como la sustitución de todos los caracteres ``\b``.

source: Most modern terminals will warn about and remove hidden characters when pasting, so this isn't strictly necessary. It's also possible to craft dangerous commands in other ways that aren't possible to filter. Depending on your site's use case, it may be good to show a warning about copying code in general.
es: La mayoría de los terminales modernos advierten y eliminan los caracteres ocultos al pegar, por lo que esto no es estrictamente necesario. También es posible elaborar comandos peligrosos de otras maneras que no son posibles de filtrar. Dependiendo del caso de uso de su sitio, puede ser bueno mostrar una advertencia sobre la copia de código en general.
