Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/shell.po
Languages: es

source: Working with the Shell
es: Trabajar con el Shell

source: One of the reasons everybody loves Python is the interactive shell. It basically allows you to execute Python commands in real time and immediately get results back. Flask itself does not come with an interactive shell, because it does not require any specific setup upfront, just import your application and start playing around.
es: Una de las razones por las que todo el mundo ama Python es el shell interactivo. Básicamente te permite ejecutar comandos de Python en tiempo real y obtener inmediatamente los resultados. Flask en sí mismo no viene con un shell interactivo, porque no requiere ninguna configuración específica por adelantado, sólo importa tu aplicación y empieza a jugar.

source: There are however some handy helpers to make playing around in the shell a more pleasant experience. The main issue with interactive console sessions is that you're not triggering a request like a browser does which means that :data:`~flask.g`, :data:`~flask.request` and others are not available. But the code you want to test might depend on them, so what can you do?
es: Sin embargo, hay algunos ayudantes útiles para hacer que jugar en el shell sea una experiencia más agradable. El principal problema con las sesiones de consola interactivas es que no estás lanzando una petición como lo hace un navegador, lo que significa que :data:`~flask.g`, :data:`~flask.request` y otros no están disponibles. Pero el código que quieres probar puede depender de ellos, así que ¿qué puedes hacer?

source: This is where some helper functions come in handy. Keep in mind however that these functions are not only there for interactive shell usage, but also for unit testing and other situations that require a faked request context.
es: Aquí es donde algunas funciones de ayuda son útiles. Tenga en cuenta, sin embargo, que estas funciones no sólo están ahí para el uso interactivo de la shell, sino también para las pruebas unitarias y otras situaciones que requieren un contexto de solicitud falsa.

source: Generally it's recommended that you read the :doc:`reqcontext` chapter of the documentation first.
es: En general, se recomienda leer primero el capítulo :doc:`reqcontext` de la documentación.

source: Command Line Interface
es: Interfaz de línea de comandos

source: Starting with Flask 0.11 the recommended way to work with the shell is the ``flask shell`` command which does a lot of this automatically for you. For instance the shell is automatically initialized with a loaded application context.
es: A partir de Flask 0.11 la forma recomendada de trabajar con el shell es el comando ``flask shell`` que hace mucho de esto automáticamente por ti. Por ejemplo, el shell se inicializa automáticamente con un contexto de aplicación cargado.

source: For more information see :doc:`/cli`.
es: Para más información, véase :doc:`/cli`.

source: Creating a Request Context
es: Creación de un contexto de solicitud

source: The easiest way to create a proper request context from the shell is by using the :attr:`~flask.Flask.test_request_context` method which creates us a :class:`~flask.ctx.RequestContext`:
es: La forma más sencilla de crear un contexto de petición adecuado desde el shell es utilizando el método :attr:`~flask.Flask.test_request_context` que nos crea un :class:`~flask.ctx.RequestContext`:

source: Normally you would use the ``with`` statement to make this request object active, but in the shell it's easier to use the :meth:`~flask.ctx.RequestContext.push` and :meth:`~flask.ctx.RequestContext.pop` methods by hand:
es: Normalmente se usaría la sentencia ``with`` para activar este objeto de petición, pero en el shell es más fácil usar los métodos :meth:`~flask.ctx.RequestContext.push` y :meth:`~flask.ctx.RequestContext.pop` a mano:

source: From that point onwards you can work with the request object until you call `pop`:
es: A partir de ese momento se puede trabajar con el objeto request hasta que se llame a `pop`:

source: Firing Before/After Request
es: Petición de disparo antes/después

source: By just creating a request context, you still don't have run the code that is normally run before a request. This might result in your database being unavailable if you are connecting to the database in a before-request callback or the current user not being stored on the :data:`~flask.g` object etc.
es: Al crear simplemente un contexto de petición, todavía no has ejecutado el código que normalmente se ejecuta antes de una petición. Esto puede resultar en que su base de datos no esté disponible si se está conectando a la base de datos en un callback antes de la petición o que el usuario actual no se almacene en el objeto :data:`~flask.g` etc.

source: This however can easily be done yourself. Just call :meth:`~flask.Flask.preprocess_request`:
es: Sin embargo, esto se puede hacer fácilmente. Simplemente llama a :meth:`~flask.Flask.preprocess_request`:

source: Keep in mind that the :meth:`~flask.Flask.preprocess_request` function might return a response object, in that case just ignore it.
es: Ten en cuenta que la función :meth:`~flask.Flask.preprocess_request` puede devolver un objeto respuesta, en ese caso simplemente ignórala.

source: To shutdown a request, you need to trick a bit before the after request functions (triggered by :meth:`~flask.Flask.process_response`) operate on a response object:
es: Para cerrar una solicitud, es necesario engañar un poco antes de que las funciones posteriores a la solicitud (activadas por :meth:`~flask.Flask.process_response`) operen sobre un objeto de respuesta:

source: The functions registered as :meth:`~flask.Flask.teardown_request` are automatically called when the context is popped. So this is the perfect place to automatically tear down resources that were needed by the request context (such as database connections).
es: Las funciones registradas como :meth:`~flask.Flask.teardown_request` son llamadas automáticamente cuando el contexto es desalojado. Por lo tanto, este es el lugar perfecto para derribar automáticamente los recursos que fueron necesarios por el contexto de la solicitud (como las conexiones a la base de datos).

source: Further Improving the Shell Experience
es: Mejorar aún más la experiencia de Shell

source: If you like the idea of experimenting in a shell, create yourself a module with stuff you want to star import into your interactive session. There you could also define some more helper methods for common things such as initializing the database, dropping tables etc.
es: Si te gusta la idea de experimentar en un shell, crea tú mismo un módulo con cosas que quieras importar de forma estelar en tu sesión interactiva. Allí también podrías definir algunos métodos más de ayuda para cosas comunes como la inicialización de la base de datos, la eliminación de tablas, etc.

source: Just put them into a module (like `shelltools`) and import from there:
es: Sólo hay que ponerlos en un módulo (como `shelltools`) e importarlos desde allí:
