Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/testing.po
Languages: es, fr

source: Sometimes it can be very helpful to access or modify the sessions from the test client. Generally there are two ways for this. If you just want to ensure that a session has certain keys set to certain values you can just keep the context around and access :data:`flask.session`::
es: A veces puede ser muy útil acceder o modificar las sesiones desde el cliente de prueba. Generalmente hay dos formas de hacerlo. Si sólo quieres asegurarte de que una sesión tiene ciertas claves establecidas a ciertos valores puedes simplemente mantener el contexto alrededor y acceder a :data:`flask.session`::
fr: Parfois, il peut être très utile d'accéder ou de modifier les sessions à partir du client de test. Il y a généralement deux façons de procéder. Si vous voulez simplement vous assurer que certaines clés d'une session ont certaines valeurs, vous pouvez conserver le contexte et accéder à :data:`flask.session` :

source: This however does not make it possible to also modify the session or to access the session before a request was fired. Starting with Flask 0.8 we provide a so called “session transaction” which simulates the appropriate calls to open a session in the context of the test client and to modify it. At the end of the transaction the session is stored and ready to be used by the test client. This works independently of the session backend used::
es: Sin embargo, esto no permite modificar también la sesión o acceder a ella antes de que se dispare una petición. A partir de Flask 0.8 proporcionamos una “transacción de sesión” que simula las llamadas apropiadas para abrir una sesión en el contexto del cliente de prueba y para modificarla. Al final de la transacción, la sesión se almacena y está lista para ser utilizada por el cliente de prueba. Esto funciona independientemente del backend de sesión utilizado:
fr: Cependant, cela ne permet pas de modifier la session ou d'accéder à la session avant qu'une requête ne soit lancée. À partir de Flask 0.8, nous fournissons une "transaction de session" qui simule les appels appropriés pour ouvrir une session dans le contexte du client de test et pour la modifier. A la fin de la transaction, la session est stockée et prête à être utilisée par le client de test. Ceci fonctionne indépendamment du backend de session utilisé :

source: Note that in this case you have to use the ``sess`` object instead of the :data:`flask.session` proxy. The object however itself will provide the same interface.
es: Tenga en cuenta que en este caso tiene que utilizar el objeto ``sess`` en lugar del proxy :data:`flask.session``. Sin embargo, el objeto en sí mismo proporcionará la misma interfaz.
fr: Notez que dans ce cas, vous devez utiliser l'objet ``sess`` au lieu du proxy :data:`flask.session`. Cependant, l'objet lui-même fournira la même interface.

source: Testing JSON APIs
es: Prueba de las APIs JSON
fr: Test des API JSON

source: Flask has great support for JSON, and is a popular choice for building JSON APIs. Making requests with JSON data and examining JSON data in responses is very convenient::
es: Flask tiene un gran soporte para JSON, y es una opción popular para construir APIs JSON. Hacer peticiones con datos JSON y examinar los datos JSON en las respuestas es muy conveniente::
fr: Flask offre une excellente prise en charge de JSON et constitue un choix populaire pour la création d'API JSON. Faire des requêtes avec des données JSON et examiner les données JSON dans les réponses est très pratique :

source: Passing the ``json`` argument in the test client methods sets the request data to the JSON-serialized object and sets the content type to ``application/json``. You can get the JSON data from the request or response with ``get_json``.
es: Al pasar el argumento ``json`` en los métodos del cliente de prueba, se establecen los datos de la solicitud en el objeto serializado JSON y se establece el tipo de contenido en ``application/json``. Puedes obtener los datos JSON de la solicitud o la respuesta con ``get_json``.
fr: En passant l'argument ``json`` dans les méthodes du client de test, les données de la requête sont définies comme un objet sérialisé JSON et le type de contenu est défini comme ``application/json``. Vous pouvez récupérer les données JSON de la requête ou de la réponse avec ``get_json``.

source: Testing CLI Commands
es: Prueba de los comandos de la CLI
fr: Test des commandes CLI

source: Click comes with `utilities for testing`_ your CLI commands. A :class:`~click.testing.CliRunner` runs commands in isolation and captures the output in a :class:`~click.testing.Result` object.
es: Click viene con `utilidades para probar`_ sus comandos CLI. Un :class:`~click.testing.CliRunner` ejecuta los comandos de forma aislada y captura la salida en un objeto :class:`~click.testing.Result`.
fr: Click est fourni avec des `utilitaires pour tester`_ vos commandes CLI. Un :class:`~click.testing.CliRunner` exécute les commandes de manière isolée et capture la sortie dans un objet :class:`~click.testing.Result`.

source: Flask provides :meth:`~flask.Flask.test_cli_runner` to create a :class:`~flask.testing.FlaskCliRunner` that passes the Flask app to the CLI automatically. Use its :meth:`~flask.testing.FlaskCliRunner.invoke` method to call commands in the same way they would be called from the command line. ::
es: Flask proporciona :meth:`~flask.Flask.test_cli_runner` para crear una :class:`~flask.testing.FlaskCliRunner` que pasa la aplicación Flask al CLI automáticamente. Utiliza su método :meth:`~flask.testing.FlaskCliRunner.invoke` para llamar a los comandos de la misma manera que se llamarían desde la línea de comandos. ::
fr: Flask fournit :meth:`~flask.Flask.test_cli_runner` pour créer une :class:`~flask.testing.FlaskCliRunner` qui passe l'application Flask à la CLI automatiquement. Utilisez sa méthode :meth:`~flask.testing.FlaskCliRunner.invoke` pour appeler les commandes de la même manière qu'elles seraient appelées depuis la ligne de commande. ::

source: In the example above, invoking the command by name is useful because it verifies that the command was correctly registered with the app.
es: En el ejemplo anterior, invocar el comando por su nombre es útil porque verifica que el comando fue registrado correctamente con la aplicación.
fr: Dans l'exemple ci-dessus, invoquer la commande par son nom est utile car cela permet de vérifier que la commande a été correctement enregistrée dans l'application.

source: If you want to test how your command parses parameters, without running the command, use its :meth:`~click.BaseCommand.make_context` method. This is useful for testing complex validation rules and custom types. ::
es: Si quieres probar cómo tu comando analiza los parámetros, sin ejecutar el comando, utiliza su método :meth:`~click.BaseCommand.make_context`. Esto es útil para probar reglas de validación complejas y tipos personalizados. ::
fr: Si vous voulez tester la façon dont votre commande analyse les paramètres, sans exécuter la commande, utilisez sa méthode :meth:`~click.BaseCommand.make_context`. Cette méthode est utile pour tester des règles de validation complexes et des types personnalisés. ::
