Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/testing.po
Languages: es, fr

source: Testing Flask Applications
es: Prueba de aplicaciones Flask
fr: Tester les applications Flask

source: **Something that is untested is broken.**
es: **Algo que no está probado está roto.**
fr: **Quelque chose qui n'est pas testé est cassé.**

source: The origin of this quote is unknown and while it is not entirely correct, it is also not far from the truth. Untested applications make it hard to improve existing code and developers of untested applications tend to become pretty paranoid. If an application has automated tests, you can safely make changes and instantly know if anything breaks.
es: El origen de esta cita es desconocido y, aunque no es del todo correcta, tampoco está lejos de la verdad. Las aplicaciones no probadas dificultan la mejora del código existente y los desarrolladores de aplicaciones no probadas tienden a volverse bastante paranoicos. Si una aplicación tiene pruebas automatizadas, puedes hacer cambios con seguridad y saber al instante si algo se rompe.
fr: L'origine de cette citation est inconnue et, bien qu'elle ne soit pas tout à fait correcte, elle n'est pas loin de la vérité. Les applications non testées rendent difficile l'amélioration du code existant et les développeurs d'applications non testées ont tendance à devenir assez paranoïaques. Si une application dispose de tests automatisés, vous pouvez apporter des modifications en toute sécurité et savoir instantanément si quelque chose se casse.

source: Flask provides a way to test your application by exposing the Werkzeug test :class:`~werkzeug.test.Client` and handling the context locals for you. You can then use that with your favourite testing solution.
es: Flask proporciona una manera de probar su aplicación mediante la exposición de la prueba Werkzeug :class:`~werkzeug.test.Client` y el manejo de los locales de contexto para usted. Puedes utilizarlo con tu solución de pruebas favorita.
fr: Flask fournit un moyen de tester votre application en exposant le Werkzeug :class:`~werkzeug.test.Client` de test et en gérant les contextes locaux pour vous. Vous pouvez ensuite l'utiliser avec votre solution de test préférée.

source: In this documentation we will use the `pytest`_ package as the base framework for our tests. You can install it with ``pip``, like so::
es: En esta documentación utilizaremos el paquete `pytest`_ como marco base para nuestras pruebas. Puedes instalarlo con ``pip``, así::
fr: Dans cette documentation, nous utiliserons le paquet `pytest`_ comme infrastructure logicielle de base pour nos tests. Vous pouvez l'installer avec ``pip``, comme ceci :

source: The Application
es: La aplicación
fr: L'application

source: First, we need an application to test; we will use the application from the :doc:`tutorial/index`. If you don't have that application yet, get the source code from :gh:`the examples <examples/tutorial>`.
es: En primer lugar, necesitamos una aplicación para probar; utilizaremos la aplicación del :doc:`tutorial/index`. Si aún no tienes esa aplicación, obtén el código fuente de :gh:`los ejemplos <examples/tutorial>`.
fr: Tout d'abord, nous avons besoin d'une application à tester ; nous utiliserons l'application du :doc:`tutorial/index`. Si vous n'avez pas encore cette application, récupérez le code source depuis :gh:`ces exemples <examples/tutorial>`.

source: So that we can import the module ``flaskr`` correctly, we need to run ``pip install -e .`` in the folder ``tutorial``.
es: Para poder importar el módulo ``flaskr`` correctamente, necesitamos ejecutar ``pip install -e .`` en la carpeta ``tutorial``.
fr: Pour que nous puissions importer correctement le module ``flaskr``, nous devons exécuter ``pip install -e .`` dans le dossier ``tutorial``.

source: The Testing Skeleton
es: El esqueleto de las pruebas
fr: Le squelette des tests

source: We begin by adding a tests directory under the application root. Then create a Python file to store our tests (:file:`test_flaskr.py`). When we format the filename like ``test_*.py``, it will be auto-discoverable by pytest.
es: Comenzamos añadiendo un directorio de pruebas bajo la raíz de la aplicación. Luego creamos un archivo Python para almacenar nuestras pruebas (:file:`prueba_flaskr.py`). Si formateamos el nombre del archivo como ``test_*.py``, será autodescubierto por pytest.
fr: Nous commençons par ajouter un répertoire tests sous la racine de l'application. Ensuite, nous créons un fichier Python pour stocker nos tests (:file:`test_flaskr.py`). Si nous formatons le nom du fichier comme ``test_*.py``, il sera auto-découvrable par pytest.

source: Next, we create a `pytest fixture`_ called :func:`client` that configures the application for testing and initializes a new database::
es: A continuación, creamos un `pytest fixture`_ llamado :func:`client` que configura la aplicación para las pruebas e inicializa una nueva base de datos::
fr: Ensuite, nous créons un `pytest fixture`_ appelé :func:`client` qui configure l'application pour les tests et initialise une nouvelle base de données :

source: This client fixture will be called by each individual test. It gives us a simple interface to the application, where we can trigger test requests to the application. The client will also keep track of cookies for us.
es: Este fixture cliente será llamado por cada prueba individual. Nos da una interfaz simple a la aplicación, donde podemos lanzar peticiones de prueba a la aplicación. El cliente también mantendrá un seguimiento de las cookies para nosotros.
fr: Cette *fixture* client sera appelée par chaque test individuel. Il nous donne une interface simple avec l'application, où nous pouvons déclencher des requêtes de test vers l'application. Le client gardera également la trace des cookies pour nous.

source: During setup, the ``TESTING`` config flag is activated. What this does is disable error catching during request handling, so that you get better error reports when performing test requests against the application.
es: Durante la configuración, se activa la bandera de configuración ``TESTING``. Esto hace que se desactive la captura de errores durante la gestión de las solicitudes, de modo que se obtengan mejores informes de errores cuando se realicen solicitudes de prueba contra la aplicación.
fr: Lors de l'installation, le *flag* de configuration ``TESTING`` est activé. Ceci a pour effet de désactiver la capture des erreurs pendant le traitement des requêtes, de sorte que vous obtenez de meilleurs rapports d'erreurs lorsque vous effectuez des requêtes de test contre l'application.

source: Because SQLite3 is filesystem-based, we can easily use the :mod:`tempfile` module to create a temporary database and initialize it. The :func:`~tempfile.mkstemp` function does two things for us: it returns a low-level file handle and a random file name, the latter we use as database name. We just have to keep the `db_fd` around so that we can use the :func:`os.close` function to close the file.
es: Como SQLite3 está basado en el sistema de ficheros, podemos utilizar fácilmente el módulo :mod:`tempfile` para crear una base de datos temporal e inicializarla. La función :func:`~tempfile.mkstemp` hace dos cosas por nosotros: devuelve un manejador de archivo de bajo nivel y un nombre de archivo aleatorio, este último lo utilizamos como nombre de la base de datos. Sólo tenemos que mantener el `db_fd` para poder utilizar la función :func:`os.close` para cerrar el archivo.
fr: Parce que SQLite3 est basé sur le système de fichiers, nous pouvons facilement utiliser le module :mod:`tempfile` pour créer une base de données temporaire et l'initialiser. La fonction :func:`~tempfile.mkstemp` fait deux choses pour nous : elle retourne un gestionnaire de fichier de bas niveau et un nom de fichier aléatoire, ce dernier étant utilisé comme nom de base de données. Nous devons juste garder le `db_fd` pour pouvoir utiliser la fonction :func:`os.close` pour fermer le fichier.

source: To delete the database after the test, the fixture closes the file and removes it from the filesystem.
es: Para eliminar la base de datos después de la prueba, el fixture cierra el archivo y lo elimina del sistema de archivos.
fr: Pour supprimer la base de données après le test, le dispositif ferme le fichier et le supprime du système de fichiers.

source: If we now run the test suite, we should see the following output::
es: Si ahora ejecutamos el conjunto de pruebas, deberíamos ver la siguiente salida::
fr: Si nous exécutons maintenant la suite de tests, nous devrions voir la sortie suivante :

source: Even though it did not run any actual tests, we already know that our ``flaskr`` application is syntactically valid, otherwise the import would have died with an exception.
es: Aunque no ha ejecutado ninguna prueba real, ya sabemos que nuestra aplicación ``flaskr`` es sintácticamente válida, de lo contrario la importación habría muerto con una excepción.
fr: Même s'il n'a pas exécuté de réels tests, nous savons déjà que notre application ``flaskr`` est syntaxiquement valide, sinon l'importation aurait échoué avec une exception.

source: The First Test
es: La primera prueba
fr: Le premier test

source: Now it's time to start testing the functionality of the application. Let's check that the application shows "No entries here so far" if we access the root of the application (``/``). To do this, we add a new test function to :file:`test_flaskr.py`, like this::
es: Ahora es el momento de empezar a probar la funcionalidad de la aplicación. Vamos a comprobar que la aplicación muestra "No hay entradas aquí hasta ahora" si accedemos a la raíz de la aplicación (``/``). Para ello, añadimos una nueva función de prueba a :file:`test_flaskr.py`, así::
fr: Il est maintenant temps de commencer à tester la fonctionnalité de l'application. Vérifions que l'application affiche "No entries here so far" si nous accédons à la racine de l'application (``/``). Pour ce faire, nous ajoutons une nouvelle fonction de test au fichier :file:`test_flaskr.py`, comme ceci :

source: Notice that our test functions begin with the word `test`; this allows `pytest`_ to automatically identify the function as a test to run.
es: Observe que nuestras funciones de prueba comienzan con la palabra `test`; esto permite a `pytest`_ identificar automáticamente la función como una prueba a ejecutar.
fr: Remarquez que nos fonctions de test commencent par le mot `test` ; cela permet à `pytest`_ d'identifier automatiquement la fonction comme un test à exécuter.

source: By using ``client.get`` we can send an HTTP ``GET`` request to the application with the given path. The return value will be a :class:`~flask.Flask.response_class` object. We can now use the :attr:`~werkzeug.wrappers.Response.data` attribute to inspect the return value (as string) from the application. In this case, we ensure that ``'No entries here so far'`` is part of the output.
es: Usando ``client.get`` podemos enviar una petición HTTP ``GET`` a la aplicación con la ruta dada. El valor de retorno será un objeto :class:`~flask.Flask.response_class`. Ahora podemos utilizar el atributo :attr:`~werkzeug.wrappers.Response.data` para inspeccionar el valor de retorno (como cadena) de la aplicación. En este caso, nos aseguramos de que ``No hay entradas aquí hasta ahora`` es parte de la salida.
fr: En utilisant ``client.get``, nous pouvons envoyer une requête HTTP ``GET`` à l'application avec le chemin donné. La valeur de retour sera un objet :class:`~flask.Flask.response_class`. Nous pouvons maintenant utiliser l'attribut :attr:`~werkzeug.wrappers.Response.data` pour inspecter la valeur de retour (sous forme de chaîne) de l'application. Dans ce cas, nous nous assurons que ``'No entries here so far'`` fait partie de la sortie.

source: Run it again and you should see one passing test::
es: Ejecútelo de nuevo y debería ver una prueba que pasa::
fr: Exécutez-le à nouveau et vous devriez voir un test réussi :

source: Logging In and Out
es: Entrar y salir del sistema
fr: Connexion et déconnexion

source: The majority of the functionality of our application is only available for the administrative user, so we need a way to log our test client in and out of the application. To do this, we fire some requests to the login and logout pages with the required form data (username and password). And because the login and logout pages redirect, we tell the client to `follow_redirects`.
es: La mayor parte de la funcionalidad de nuestra aplicación sólo está disponible para el usuario administrativo, por lo que necesitamos una forma de iniciar y cerrar la sesión de nuestro cliente de prueba en la aplicación. Para ello, lanzamos algunas peticiones a las páginas de inicio y cierre de sesión con los datos requeridos del formulario (nombre de usuario y contraseña). Y como las páginas de login y logout redirigen, le decimos al cliente que `follow_redirects`.
fr: La majorité des fonctionnalités de notre application n'est disponible que pour l'utilisateur administratif. Nous devons donc trouver un moyen de connecter et déconnecter notre client de test de l'application. Pour ce faire, nous envoyons des requêtes aux pages de connexion et de déconnexion avec les données de formulaire requises (nom d'utilisateur et mot de passe). Et parce que les pages de connexion et de déconnexion redirigent, nous disons au client de suivre les redirections.

source: Add the following two functions to your :file:`test_flaskr.py` file::
es: Añade las siguientes dos funciones a tu archivo :file:`test_flaskr.py`::
fr: Ajoutez les deux fonctions suivantes à votre fichier :file:`test_flaskr.py`:

source: Now we can easily test that logging in and out works and that it fails with invalid credentials. Add this new test function::
es: Ahora podemos probar fácilmente que el inicio y el cierre de sesión funciona y que falla con credenciales no válidas. Añade esta nueva función de prueba::
fr: Maintenant, nous pouvons facilement tester que la connexion et la déconnexion fonctionnent et qu'elles échouent si les informations d'identification ne sont pas valides. Ajoutez cette nouvelle fonction de test :

source: Test Adding Messages
es: Prueba de adición de mensajes
fr: Test d'ajout de messages

source: We should also test that adding messages works. Add a new test function like this::
es: También debemos probar que la adición de mensajes funciona. Añade una nueva función de prueba como esta::
fr: Nous devons également tester que l'ajout de messages fonctionne. Ajoutez une nouvelle fonction de test comme ceci :

source: Here we check that HTML is allowed in the text but not in the title, which is the intended behavior.
es: Aquí comprobamos que el HTML está permitido en el texto pero no en el título, que es el comportamiento previsto.
fr: Ici, nous vérifions que le HTML est autorisé dans le texte mais pas dans le titre, ce qui est le comportement souhaité.

source: Running that should now give us three passing tests::
es: La ejecución de esto debería darnos tres pruebas de aprobación::
fr: L'exécution de ce test devrait maintenant nous donner trois tests réussis :

source: Other Testing Tricks
es: Otros trucos de comprobación
fr: Autres astuces de test

source: Besides using the test client as shown above, there is also the :meth:`~flask.Flask.test_request_context` method that can be used in combination with the ``with`` statement to activate a request context temporarily. With this you can access the :class:`~flask.request`, :class:`~flask.g` and :class:`~flask.session` objects like in view functions. Here is a full example that demonstrates this approach::
es: Además de utilizar el cliente de prueba como se ha mostrado anteriormente, también existe el método :meth:`~flask.Flask.test_request_context` que se puede utilizar en combinación con la sentencia ``with`` para activar un contexto de petición temporalmente. Con esto puedes acceder a los objetos :class:`~flask.request`, :class:`~flask.g` y :class:`~flask.session` como en las funciones de vista. Aquí hay un ejemplo completo que demuestra este enfoque::
fr: Outre l'utilisation du client de test comme indiqué ci-dessus, il existe également la méthode :meth:`~flask.Flask.test_request_context` qui peut être utilisée en combinaison avec l'instruction ``with`` pour activer temporairement un contexte de requête. Avec cette méthode, vous pouvez accéder aux objets :class:`~flask.request`, :class:`~flask.g` et :class:`~flask.session` comme dans les fonctions de vue. Voici un exemple complet qui démontre cette approche :

source: All the other objects that are context bound can be used in the same way.
es: Todos los demás objetos que están vinculados al contexto pueden ser utilizados de la misma manera.
fr: Tous les autres objets liés au contexte peuvent être utilisés de la même manière.

source: If you want to test your application with different configurations and there does not seem to be a good way to do that, consider switching to application factories (see :doc:`patterns/appfactories`).
es: Si quieres probar tu aplicación con diferentes configuraciones y no parece haber una buena manera de hacerlo, considera cambiar a las fábricas de aplicaciones (ver :doc:`patterns/appfactories`).
fr: Si vous voulez tester votre application avec différentes configurations et qu'il ne semble pas y avoir de bon moyen de le faire, envisagez de passer aux fabriques d'applications (voir :doc:`patterns/appfactories`).

source: Note however that if you are using a test request context, the :meth:`~flask.Flask.before_request` and :meth:`~flask.Flask.after_request` functions are not called automatically. However :meth:`~flask.Flask.teardown_request` functions are indeed executed when the test request context leaves the ``with`` block. If you do want the :meth:`~flask.Flask.before_request` functions to be called as well, you need to call :meth:`~flask.Flask.preprocess_request` yourself::
es: Tenga en cuenta, sin embargo, que si está utilizando un contexto de petición de prueba, las funciones :meth:`~flask.Flask.before_request` y :meth:`~flask.Flask.after_request` no se llaman automáticamente. Sin embargo, las funciones :meth:`~flask.Flask.teardown_request` sí se ejecutan cuando el contexto de la petición de prueba abandona el bloque ``with``. Si quieres que las funciones :meth:`~flask.Flask.before_request` sean llamadas también, tienes que llamar tú mismo a :meth:`~flask.Flask.preprocess_request`::
fr: Notez cependant que si vous utilisez un contexte de requête de test, les fonctions :meth:`~flask.Flask.before_request` et :meth:`~flask.Flask.after_request` ne sont pas appelées automatiquement. Cependant, les fonctions :meth:`~flask.Flask.teardown_request` sont effectivement exécutées lorsque le contexte de la requête de test quitte le bloc ``with``. Si vous souhaitez que les fonctions :meth:`~flask.Flask.before_request` soient également appelées, vous devez appeler vous-même :meth:`~flask.Flask.preprocess_request`:

source: This can be necessary to open database connections or something similar depending on how your application was designed.
es: Esto puede ser necesario para abrir conexiones a bases de datos o algo similar dependiendo de cómo se haya diseñado tu aplicación.
fr: Cela peut être nécessaire pour ouvrir des connexions à des bases de données ou quelque chose de similaire, selon la façon dont votre application a été conçue.

source: If you want to call the :meth:`~flask.Flask.after_request` functions you need to call into :meth:`~flask.Flask.process_response` which however requires that you pass it a response object::
es: Si quieres llamar a las funciones :meth:`~flask.Flask.after_request` necesitas llamar a :meth:`~flask.Flask.process_response` que sin embargo requiere que le pases un objeto response::
fr: Si vous voulez appeler les fonctions :meth:`~flask.Flask.after_request`, vous devez faire appel à :meth:`~flask.Flask.process_response` qui nécessite toutefois que vous lui passiez un objet de réponse :

source: This in general is less useful because at that point you can directly start using the test client.
es: Esto, en general, es menos útil porque en ese momento se puede empezar a utilizar directamente el cliente de prueba.
fr: Ceci est en général moins utile car à ce moment-là, vous pouvez directement commencer à utiliser le client de test.

source: Faking Resources and Context
es: Falsificación de recursos y contexto
fr: Contournement des ressources et du contexte

source: A very common pattern is to store user authorization information and database connections on the application context or the :attr:`flask.g` object. The general pattern for this is to put the object on there on first usage and then to remove it on a teardown. Imagine for instance this code to get the current user::
es: Un patrón muy común es almacenar la información de autorización del usuario y las conexiones a la base de datos en el contexto de la aplicación o en el objeto :attr:`flask.g`. El patrón general para esto es poner el objeto allí en el primer uso y luego eliminarlo en un desmontaje. Imagina por ejemplo este código para obtener el usuario actual::
fr: Un modèle très courant consiste à stocker les informations d'autorisation des utilisateurs et les connexions aux bases de données dans le contexte de l'application ou dans l'objet :attr:`flask.g`. Le modèle général pour cela est de mettre l'objet à cet endroit lors de la première utilisation et de le supprimer lors du démontage. Imaginez par exemple ce code pour obtenir l'utilisateur actuel :

source: For a test it would be nice to override this user from the outside without having to change some code. This can be accomplished with hooking the :data:`flask.appcontext_pushed` signal::
es: Para una prueba sería bueno anular este usuario desde el exterior sin tener que cambiar algo de código. Esto se puede lograr con el enganche de la señal :data:`flask.appcontext_pushed`::
fr: Pour un test, il serait bien de pouvoir remplacer cet utilisateur de l'extérieur sans avoir à modifier le code. Ceci peut être accompli en accrochant le signal :data:`flask.appcontext_pushed` :

source: And then to use it::
es: Y luego a usarlo::
fr: Et puis pour l'utiliser :

source: Keeping the Context Around
es: Mantener el contexto alrededor
fr: Maintenir le contexte

source: Sometimes it is helpful to trigger a regular request but still keep the context around for a little longer so that additional introspection can happen. With Flask 0.4 this is possible by using the :meth:`~flask.Flask.test_client` with a ``with`` block::
es: A veces es útil lanzar una petición regular pero mantener el contexto durante un poco más de tiempo para que pueda ocurrir una introspección adicional. Con Flask 0.4 esto es posible utilizando el :meth:`~flask.Flask.test_client` con un bloque ``with``::
fr: Parfois, il est utile de déclencher une requête régulière mais de conserver le contexte un peu plus longtemps afin de permettre une introspection supplémentaire. Avec Flask 0.4, cela est possible en utilisant le :meth:`~flask.Flask.test_client` avec un bloc ``with`` :

source: If you were to use just the :meth:`~flask.Flask.test_client` without the ``with`` block, the ``assert`` would fail with an error because `request` is no longer available (because you are trying to use it outside of the actual request).
es: Si se usara sólo el :meth:`~flask.Flask.test_client` sin el bloque ``with``, el ``assert`` fallaría con un error porque `request` ya no está disponible (porque se está intentando usar fuera de la petición real).
fr: Si vous utilisiez seulement le :meth:`~flask.Flask.test_client` sans le bloc `with`, le ``assert`` échouerait avec une erreur car `request` n'est plus disponible (parce que vous essayez de l'utiliser en dehors de la requête actuelle).

source: Accessing and Modifying Sessions
es: Acceso y modificación de las sesiones
fr: Accéder et modifier les sessions
