Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/views.po
Languages: es

source: Class-based Views
es: Vistas basadas en las clases

source: This page introduces using the :class:`View` and :class:`MethodView` classes to write class-based views.
es: Esta página presenta el uso de las clases :class:`View` y :class:`MethodView` para escribir vistas basadas en clases.

source: A class-based view is a class that acts as a view function. Because it is a class, different instances of the class can be created with different arguments, to change the behavior of the view. This is also known as generic, reusable, or pluggable views.
es: Una vista basada en una clase es una clase que actúa como una función de la vista. Como es una clase, se pueden crear diferentes instancias de la clase con diferentes argumentos, para cambiar el comportamiento de la vista. Esto también se conoce como vistas genéricas, reutilizables o enchufables.

source: An example of where this is useful is defining a class that creates an API based on the database model it is initialized with.
es: Un ejemplo de que esto es útil es definir una clase que crea una API basada en el modelo de base de datos con el que se inicializa.

source: For more complex API behavior and customization, look into the various API extensions for Flask.
es: Para un comportamiento más complejo de la API y su personalización, busque las diversas extensiones de la API para Flask.

source: Basic Reusable View
es: Vista básica reutilizable

source: Let's walk through an example converting a view function to a view class. We start with a view function that queries a list of users then renders a template to show the list.
es: Veamos un ejemplo de conversión de una función de vista a una clase de vista. Comenzamos con una función de vista que consulta una lista de usuarios y luego renderiza una plantilla para mostrar la lista.

source: This works for the user model, but let's say you also had more models that needed list pages. You'd need to write another view function for each model, even though the only thing that would change is the model and template name.
es: Esto funciona para el modelo de usuario, pero digamos que también tienes más modelos que necesitan páginas de lista. Tendrías que escribir otra función de vista para cada modelo, aunque lo único que cambiaría es el nombre del modelo y de la plantilla.

source: Instead, you can write a :class:`View` subclass that will query a model and render a template. As the first step, we'll convert the view to a class without any customization.
es: En su lugar, puedes escribir una subclase :class:`View` que consultará un modelo y renderizará una plantilla. Como primer paso, convertiremos la vista en una clase sin ninguna personalización.

source: The :meth:`View.dispatch_request` method is the equivalent of the view function. Calling :meth:`View.as_view` method will create a view function that can be registered on the app with its :meth:`~flask.Flask.add_url_rule` method. The first argument to ``as_view`` is the name to use to refer to the view with :func:`~flask.url_for`.
es: El método :meth:`View.dispatch_request` es el equivalente a la función de vista. La llamada al método :meth:`View.as_view` creará una función de vista que puede registrarse en la aplicación con su método :meth:`~flask.Flask.add_url_rule`. El primer argumento de ``as_view`` es el nombre a utilizar para referirse a la vista con :func:`~flask.url_for`.

source: You can't decorate the class with ``@app.route()`` the way you'd do with a basic view function.
es: No puedes decorar la clase con ``@app.route()`` como lo harías con una función de vista básica.

source: Next, we need to be able to register the same view class for different models and templates, to make it more useful than the original function. The class will take two arguments, the model and template, and store them on ``self``. Then ``dispatch_request`` can reference these instead of hard-coded values.
es: A continuación, tenemos que ser capaces de registrar la misma clase de vista para diferentes modelos y plantillas, para que sea más útil que la función original. La clase tomará dos argumentos, el modelo y la plantilla, y los almacenará en ``self``. Entonces ``dispatch_request`` puede hacer referencia a estos en lugar de valores codificados.

source: Remember, we create the view function with ``View.as_view()`` instead of creating the class directly. Any extra arguments passed to ``as_view`` are then passed when creating the class. Now we can register the same view to handle multiple models.
es: Recuerda que creamos la función vista con ``View.as_view()`` en lugar de crear la clase directamente. Cualquier argumento extra que se pase a ``as_view`` se pasa al crear la clase. Ahora podemos registrar la misma vista para manejar múltiples modelos.

source: URL Variables
es: Variables de la URL

source: Any variables captured by the URL are passed as keyword arguments to the ``dispatch_request`` method, as they would be for a regular view function.
es: Cualquier variable capturada por la URL se pasa como argumentos de palabra clave al método ``dispatch_request``, como lo harían en una función de vista normal.

source: View Lifetime and ``self``
es: Ver Vida útil y ``self``

source: By default, a new instance of the view class is created every time a request is handled. This means that it is safe to write other data to ``self`` during the request, since the next request will not see it, unlike other forms of global state.
es: Por defecto, se crea una nueva instancia de la clase view cada vez que se gestiona una petición. Esto significa que es seguro escribir otros datos en ``self`` durante la petición, ya que la siguiente petición no lo verá, a diferencia de otras formas de estado global.

source: However, if your view class needs to do a lot of complex initialization, doing it for every request is unnecessary and can be inefficient. To avoid this, set :attr:`View.init_every_request` to ``False``, which will only create one instance of the class and use it for every request. In this case, writing to ``self`` is not safe. If you need to store data during the request, use :data:`~flask.g` instead.
es: Sin embargo, si tu clase de vista necesita hacer mucha inicialización compleja, hacerla para cada petición es innecesario y puede ser ineficiente. Para evitar esto, establece :attr:`View.init_every_request` a ``False``, que sólo creará una instancia de la clase y la utilizará para cada petición. En este caso, escribir en ``self`` no es seguro. Si necesitas almacenar datos durante la petición, utiliza :data:`~flask.g` en su lugar.

source: In the ``ListView`` example, nothing writes to ``self`` during the request, so it is more efficient to create a single instance.
es: En el ejemplo de ``ListView``, nada se escribe en ``self`` durante la petición, por lo que es más eficiente crear una única instancia.

source: Different instances will still be created each for each ``as_view`` call, but not for each request to those views.
es: Se seguirán creando diferentes instancias para cada llamada a ``as_view``, pero no para cada petición a esas vistas.

source: View Decorators
es: Decoradores de vista

source: The view class itself is not the view function. View decorators need to be applied to the view function returned by ``as_view``, not the class itself. Set :attr:`View.decorators` to a list of decorators to apply.
es: La clase de la vista en sí misma no es la función de la vista. Los decoradores de la vista deben aplicarse a la función de la vista devuelta por ``as_view``, no a la propia clase. Establece :attr:`View.decorators` a una lista de decoradores a aplicar.

source: If you didn't set ``decorators``, you could apply them manually instead. This is equivalent to:
es: Si no ha establecido ``decoradores``, puede aplicarlos manualmente en su lugar. Esto equivale a:

source: Keep in mind that order matters. If you're used to ``@decorator`` style, this is equivalent to:
es: Ten en cuenta que el orden es importante. Si estás acostumbrado al estilo ``@decorador``, esto equivale a:

source: Method Hints
es: Consejos sobre el método

source: A common pattern is to register a view with ``methods=["GET", "POST"]``, then check ``request.method == "POST"`` to decide what to do. Setting :attr:`View.methods` is equivalent to passing the list of methods to ``add_url_rule`` or ``route``.
es: Un patrón común es registrar una vista con ``methods=["GET", "POST"]``, y luego comprobar ``request.method == "POST"`` para decidir qué hacer. Establecer :attr:`View.methods` es equivalente a pasar la lista de métodos a ``add_url_rule`` o ``route``.

source: This is equivalent to the following, except further subclasses can inherit or change the methods.
es: Esto es equivalente a lo siguiente, excepto que otras subclases pueden heredar o cambiar los métodos.

source: Method Dispatching and APIs
es: Envío de métodos y APIs

source: For APIs it can be helpful to use a different function for each HTTP method. :class:`MethodView` extends the basic :class:`View` to dispatch to different methods of the class based on the request method. Each HTTP method maps to a method of the class with the same (lowercase) name.
es: Para las APIs puede ser útil utilizar una función diferente para cada método HTTP. :class:`MethodView` extiende la clase básica :class:`View` para enviar a diferentes métodos de la clase basados en el método de solicitud. Cada método HTTP se asigna a un método de la clase con el mismo nombre (en minúsculas).

source: :class:`MethodView` automatically sets :attr:`View.methods` based on the methods defined by the class. It even knows how to handle subclasses that override or define other methods.
es: :class:`MethodView` establece automáticamente :attr:`View.methods` basándose en los métodos definidos por la clase. Incluso sabe cómo manejar las subclases que sobrescriben o definen otros métodos.

source: This produces the following views, a standard REST API!
es: Esto produce las siguientes vistas, ¡una API REST estándar!

source: Method
es: Método

source: Description
es: Descripción

source: List all users
es: Listar todos los usuarios

source: Create a new user
es: Crear un nuevo usuario

source: Show a single user
es: Mostrar un solo usuario

source: Update a user
es: Actualizar un usuario

source: Delete a user
es: Eliminar un usuario

source: List all stories
es: Lista de todas las historias

source: Create a new story
es: Crear una nueva historia

source: Show a single story
es: Mostrar una sola historia

source: Update a story
es: Actualizar una historia

source: Delete a story
es: Eliminar una historia
