Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/patterns/distribute.po
Languages: xd

source: Deploying with Setuptools
xd: Despliegue con Setuptools

source: `Setuptools`_, is an extension library that is commonly used to distribute Python libraries and extensions. It extends distutils, a basic module installation system shipped with Python to also support various more complex constructs that make larger applications easier to distribute:
xd: `Setuptools`_, es una biblioteca de extensión que se utiliza comúnmente para distribuir bibliotecas y extensiones de Python. Extiende distutils, un sistema básico de instalación de módulos incluido en Python, para soportar también varias construcciones más complejas que hacen que las aplicaciones más grandes sean más fáciles de distribuir:

source: **support for dependencies**: a library or application can declare a list of other libraries it depends on which will be installed automatically for you.
xd: **Soporte para dependencias**: Una librería o aplicación puede declarar una lista de otras librerías de las que depende, que se instalarán automáticamente por ti.

source: **package registry**: setuptools registers your package with your Python installation. This makes it possible to query information provided by one package from another package. The best known feature of this system is the entry point support which allows one package to declare an "entry point" that another package can hook into to extend the other package.
xd: **Registro de paquetes**: setuptools registra su paquete con su instalación de Python. Esto permite consultar la información proporcionada por un paquete desde otro paquete. La característica más conocida de este sistema es el soporte de punto de entrada que permite a un paquete declarar un "punto de entrada" al que otro paquete puede engancharse para extender el otro paquete.

source: **installation manager**: :command:`pip` can install other libraries for you.
xd: **Gestor de instalación**: :command:`pip` puede instalar otras bibliotecas por ti.

source: Flask itself, and all the libraries you can find on PyPI are distributed with either setuptools or distutils.
xd: El propio Flask y todas las bibliotecas que puedes encontrar en PyPI se distribuyen con setuptools o distutils.

source: In this case we assume your application is called :file:`yourapplication.py` and you are not using a module, but a package. If you have not yet converted your application into a package, head over to :doc:`packages` to see how this can be done.
xd: En este caso asumimos que tu aplicación se llama :file:`tuaplicacion.py` y que no estás usando un módulo, sino un paquete. Si aún no has convertido tu aplicación en un paquete, dirígete a :doc:`packages` para ver cómo hacerlo.

source: A working deployment with setuptools is the first step into more complex and more automated deployment scenarios. If you want to fully automate the process, also read the :doc:`fabric` chapter.
xd: Un despliegue de trabajo con setuptools es el primer paso hacia escenarios de despliegue más complejos y automatizados. Si quieres automatizar completamente el proceso, lee también el capítulo :doc:`fabric`.

source: Basic Setup Script
xd: Script de configuración básica

source: Because you have Flask installed, you have setuptools available on your system. Flask already depends upon setuptools.
xd: Como tienes Flask instalado, tienes setuptools disponible en tu sistema. Flask ya depende de setuptools.

source: Standard disclaimer applies: :ref:`use a virtualenv <install-create-env>`.
xd: Se aplica la exención de responsabilidad estándar: :ref:`use a virtualenv <install-create-env>`.

source: Your setup code always goes into a file named :file:`setup.py` next to your application. The name of the file is only convention, but because everybody will look for a file with that name, you better not change it.
xd: Su código de instalación siempre va en un archivo llamado :file:`setup.py` junto a su aplicación. El nombre del archivo es sólo una convención, pero como todo el mundo buscará un archivo con ese nombre, es mejor que no lo cambies.

source: A basic :file:`setup.py` file for a Flask application looks like this::
xd: Un archivo básico :file:`setup.py` para una aplicación Flask tiene el siguiente aspecto::

source: Please keep in mind that you have to list subpackages explicitly. If you want setuptools to lookup the packages for you automatically, you can use the ``find_packages`` function::
xd: Tenga en cuenta que tiene que listar los subpaquetes explícitamente. Si quiere que setuptools busque los paquetes automáticamente, puede utilizar la función ``find_packages``::

source: Most parameters to the ``setup`` function should be self explanatory, ``include_package_data`` and ``zip_safe`` might not be. ``include_package_data`` tells setuptools to look for a :file:`MANIFEST.in` file and install all the entries that match as package data. We will use this to distribute the static files and templates along with the Python module (see :ref:`distributing-resources`). The ``zip_safe`` flag can be used to force or prevent zip Archive creation. In general you probably don't want your packages to be installed as zip files because some tools do not support them and they make debugging a lot harder.
xd: La mayoría de los parámetros de la función ``setup`` deberían ser autoexplicativos, ``include_package_data`` y ``zip_safe`` podrían no serlo. ``include_package_data`` le dice a setuptools que busque un archivo :file:`MANIFEST.in` e instale todas las entradas que coincidan como datos del paquete. Usaremos esto para distribuir los archivos estáticos y las plantillas junto con el módulo de Python (ver :ref:`distributing-resources`). La bandera ``zip_safe`` puede utilizarse para forzar o evitar la creación de archivos zip. En general, probablemente no quieras que tus paquetes se instalen como archivos zip porque algunas herramientas no los soportan y dificultan mucho la depuración.

source: Tagging Builds
xd: Etiquetado de Builds

source: It is useful to distinguish between release and development builds. Add a :file:`setup.cfg` file to configure these options. ::
xd: Es útil para distinguir entre las compilaciones de lanzamiento y las de desarrollo. Añade un archivo :file:`setup.cfg` para configurar estas opciones. ::

source: Running ``python setup.py sdist`` will create a development package with ".dev" and the current date appended: ``flaskr-1.0.dev20160314.tar.gz``. Running ``python setup.py release sdist`` will create a release package with only the version: ``flaskr-1.0.tar.gz``.
xd: Al ejecutar ``python setup.py sdist`` se creará un paquete de desarrollo con ".dev" y la fecha actual añadida: ``flaskr-1.0.dev20160314.tar.gz``. Ejecutando ``python setup.py release sdist`` se creará un paquete de lanzamiento con sólo la versión: ``flaskr-1.0.tar.gz``.

source: Distributing Resources
xd: Distribución de recursos

source: If you try to install the package you just created, you will notice that folders like :file:`static` or :file:`templates` are not installed for you. The reason for this is that setuptools does not know which files to add for you. What you should do, is to create a :file:`MANIFEST.in` file next to your :file:`setup.py` file. This file lists all the files that should be added to your tarball::
xd: Si intenta instalar el paquete que acaba de crear, se dará cuenta de que carpetas como :file:`static` o :file:`templates` no se instalan por usted. La razón de esto es que setuptools no sabe qué archivos añadir por usted. Lo que debe hacer, es crear un archivo :file:`MANIFEST.in` junto a su archivo :file:`setup.py`. Este archivo lista todos los archivos que deben ser añadidos a su tarball::

source: Don't forget that even if you enlist them in your :file:`MANIFEST.in` file, they won't be installed for you unless you set the `include_package_data` parameter of the ``setup`` function to ``True``!
xd: ¡No olvide que, aunque los incluya en su archivo :file:`MANIFEST.in`, no se instalarán si no establece el parámetro `include_package_data` de la función ``setup`` a ``True``!

source: Declaring Dependencies
xd: Declarar las dependencias

source: Dependencies are declared in the ``install_requires`` parameter as a list. Each item in that list is the name of a package that should be pulled from PyPI on installation. By default it will always use the most recent version, but you can also provide minimum and maximum version requirements. Here some examples::
xd: Las dependencias se declaran en el parámetro ``install_requires`` como una lista. Cada elemento de esa lista es el nombre de un paquete que debe ser extraído de PyPI en la instalación. Por defecto, siempre se utilizará la versión más reciente, pero también se pueden proporcionar requisitos de versión mínimos y máximos. Aquí algunos ejemplos::

source: As mentioned earlier, dependencies are pulled from PyPI. What if you want to depend on a package that cannot be found on PyPI and won't be because it is an internal package you don't want to share with anyone? Just do it as if there was a PyPI entry and provide a list of alternative locations where setuptools should look for tarballs::
xd: Como se mencionó anteriormente, las dependencias se extraen de PyPI. ¿Qué pasa si quieres depender de un paquete que no se puede encontrar en PyPI y no se encontrará porque es un paquete interno que no quieres compartir con nadie? Simplemente hazlo como si hubiera una entrada en PyPI y proporciona una lista de ubicaciones alternativas donde setuptools debería buscar los tarballs::

source: Make sure that page has a directory listing and the links on the page are pointing to the actual tarballs with their correct filenames as this is how setuptools will find the files. If you have an internal company server that contains the packages, provide the URL to that server.
xd: Asegúrese de que esa página tiene un listado de directorios y que los enlaces de la página apuntan a los verdaderos tarballs con sus nombres de archivo correctos, ya que así es como setuptools encontrará los archivos. Si tiene un servidor interno de la empresa que contiene los paquetes, proporcione la URL de ese servidor.

source: Installing / Developing
xd: Instalación / Desarrollo

source: To install your application (ideally into a virtualenv) just run the :file:`setup.py` script with the ``install`` parameter. It will install your application into the virtualenv's site-packages folder and also download and install all dependencies::
xd: Para instalar tu aplicación (idealmente en un virtualenv) simplemente ejecuta el script :file:`setup.py` con el parámetro ``install``. Instalará tu aplicación en la carpeta site-packages del virtualenv y también descargará e instalará todas las dependencias::

source: If you are developing on the package and also want the requirements to be installed, you can use the ``develop`` command instead::
xd: Si está desarrollando en el paquete y también quiere que se instalen los requisitos, puede utilizar el comando ``develop`` en su lugar::

source: This has the advantage of just installing a link to the site-packages folder instead of copying the data over. You can then continue to work on the code without having to run ``install`` again after each change.
xd: Esto tiene la ventaja de que sólo se instala un enlace a la carpeta de paquetes del sitio en lugar de copiar los datos. De este modo, puede continuar trabajando en el código sin tener que ejecutar ``install`` de nuevo después de cada cambio.
