Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/patterns/mongoengine.po
Languages: xd

source: MongoDB with MongoEngine
xd: MongoDB con MongoEngine

source: Using a document database like MongoDB is a common alternative to relational SQL databases. This pattern shows how to use `MongoEngine`_, a document mapper library, to integrate with MongoDB.
xd: El uso de una base de datos de documentos como MongoDB es una alternativa común a las bases de datos relacionales SQL. Este patrón muestra cómo utilizar `MongoEngine`_, una biblioteca de mapeo de documentos, para integrarse con MongoDB.

source: A running MongoDB server and `Flask-MongoEngine`_ are required. ::
xd: Se requiere un servidor MongoDB en funcionamiento y `Flask-MongoEngine`_. ::

source: Configuration
xd: Configuración

source: Basic setup can be done by defining ``MONGODB_SETTINGS`` on ``app.config`` and creating a ``MongoEngine`` instance. ::
xd: La configuración básica puede hacerse definiendo ``MONGODB_SETTINGS`` en ``app.config`` y creando una instancia de ``MongoEngine``::

source: Mapping Documents
xd: Documentos de mapeo

source: To declare a model that represents a Mongo document, create a class that inherits from ``Document`` and declare each of the fields. ::
xd: Para declarar un modelo que represente un documento Mongo, crea una clase que herede de ``Document`` y declara cada uno de los campos ::

source: If the document has nested fields, use ``EmbeddedDocument`` to defined the fields of the embedded document and ``EmbeddedDocumentField`` to declare it on the parent document. ::
xd: Si el documento tiene campos anidados, utilice ``EmbeddedDocument`` para definir los campos del documento incrustado y ``EmbeddedDocumentField`` para declararlos en el documento padre. ::

source: Creating Data
xd: Creación de datos

source: Instantiate your document class with keyword arguments for the fields. You can also assign values to the field attributes after instantiation. Then call ``doc.save()``. ::
xd: Instancie su clase documental con argumentos de palabras clave para los campos. También puedes asignar valores a los atributos de los campos después de la instanciación. Luego llama a ``doc.save()``. ::

source: Queries
xd: Consultas

source: Use the class ``objects`` attribute to make queries. A keyword argument looks for an equal value on the field. ::
xd: Utiliza el atributo de clase ``objects`` para realizar consultas. Un argumento de palabra clave busca un valor igual en el campo ::

source: Query operators may be used by concatenating them with the field name using a double-underscore. ``objects``, and queries returned by calling it, are iterable. ::
xd: Los operadores de consulta pueden utilizarse concatenándolos con el nombre del campo mediante un doble guión. Los objetos y las consultas devueltas al llamarlos son iterables::

source: Documentation
xd: Documentación

source: There are many more ways to define and query documents with MongoEngine. For more information, check out the `official documentation <MongoEngine_>`_.
xd: Hay muchas más formas de definir y consultar documentos con MongoEngine. Para más información, consulta la `documentación oficial <MongoEngine_>`_.

source: Flask-MongoEngine adds helpful utilities on top of MongoEngine. Check out their `documentation <Flask-MongoEngine_>`_ as well.
xd: Flask-MongoEngine añade útiles utilidades encima de MongoEngine. Consulta también su `documentación <Flask-MongoEngine_>`_.
