Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/patterns/sqlalchemy.po
Languages: xd

source: SQLAlchemy in Flask
xd: SQLAlchemy en Flask

source: Many people prefer `SQLAlchemy`_ for database access. In this case it's encouraged to use a package instead of a module for your flask application and drop the models into a separate module (:doc:`packages`). While that is not necessary, it makes a lot of sense.
xd: Mucha gente prefiere `SQLAlchemy`_ para el acceso a la base de datos. En este caso se recomienda utilizar un paquete en lugar de un módulo para su aplicación flask y dejar los modelos en un módulo separado (:doc:`packages`). Aunque no es necesario, tiene mucho sentido.

source: There are four very common ways to use SQLAlchemy. I will outline each of them here:
xd: Hay cuatro formas muy comunes de utilizar SQLAlchemy. A continuación, describiré cada una de ellas:

source: Flask-SQLAlchemy Extension
xd: Extensión Flask-SQLAlchemy

source: Because SQLAlchemy is a common database abstraction layer and object relational mapper that requires a little bit of configuration effort, there is a Flask extension that handles that for you. This is recommended if you want to get started quickly.
xd: Debido a que SQLAlchemy es una capa de abstracción de base de datos común y un mapeador relacional de objetos que requiere un poco de esfuerzo de configuración, hay una extensión de Flask que maneja eso por ti. Esto se recomienda si quieres empezar rápidamente.

source: You can download `Flask-SQLAlchemy`_ from `PyPI <https://pypi.org/project/Flask-SQLAlchemy/>`_.
xd: Puedes descargar `Flask-SQLAlchemy`_ desde `PyPI <https://pypi.org/project/Flask-SQLAlchemy/>`_.

source: Declarative
xd: Declarativo

source: The declarative extension in SQLAlchemy is the most recent method of using SQLAlchemy. It allows you to define tables and models in one go, similar to how Django works. In addition to the following text I recommend the official documentation on the `declarative`_ extension.
xd: La extensión declarativa en SQLAlchemy es el método más reciente de utilizar SQLAlchemy. Permite definir tablas y modelos de una sola vez, de forma similar a como funciona Django. Además del siguiente texto recomiendo la documentación oficial sobre la extensión `declarative`_.

source: Here's the example :file:`database.py` module for your application::
xd: Aquí está el módulo de ejemplo :file:`database.py` para su aplicación::

source: To define your models, just subclass the `Base` class that was created by the code above. If you are wondering why we don't have to care about threads here (like we did in the SQLite3 example above with the :data:`~flask.g` object): that's because SQLAlchemy does that for us already with the :class:`~sqlalchemy.orm.scoped_session`.
xd: Para definir tus modelos, sólo tienes que subclasificar la clase `Base` que fue creada por el código anterior. Si te preguntas por qué no tenemos que preocuparnos de los hilos aquí (como hicimos en el ejemplo de SQLite3 anterior con el objeto :data:`~flask.g`): es porque SQLAlchemy ya lo hace por nosotros con la clase :class:`~sqlalchemy.orm.scoped_session`.

source: To use SQLAlchemy in a declarative way with your application, you just have to put the following code into your application module. Flask will automatically remove database sessions at the end of the request or when the application shuts down::
xd: Para utilizar SQLAlchemy de forma declarativa con tu aplicación, sólo tienes que poner el siguiente código en tu módulo de aplicación. Flask eliminará automáticamente las sesiones de la base de datos al final de la solicitud o cuando la aplicación se cierre::

source: Here is an example model (put this into :file:`models.py`, e.g.)::
xd: He aquí un modelo de ejemplo (ponlo en :file:`models.py`, por ejemplo)::

source: To create the database you can use the `init_db` function:
xd: Para crear la base de datos puedes utilizar la función `init_db`:

source: You can insert entries into the database like this:
xd: Puede insertar entradas en la base de datos de la siguiente manera:

source: Querying is simple as well:
xd: La consulta también es sencilla:

source: Manual Object Relational Mapping
xd: Mapeo relacional de objetos manual

source: Manual object relational mapping has a few upsides and a few downsides versus the declarative approach from above. The main difference is that you define tables and classes separately and map them together. It's more flexible but a little more to type. In general it works like the declarative approach, so make sure to also split up your application into multiple modules in a package.
xd: El mapeo relacional de objetos manual tiene algunas ventajas y algunas desventajas frente al enfoque declarativo anterior. La principal diferencia es que se definen tablas y clases por separado y se mapean juntas. Es más flexible, pero un poco más complicado de escribir. En general, funciona como el enfoque declarativo, así que asegúrese de dividir también su aplicación en varios módulos en un paquete.

source: Here is an example :file:`database.py` module for your application::
xd: Aquí hay un ejemplo de módulo :file:`database.py` para tu aplicación::

source: As in the declarative approach, you need to close the session after each request or application context shutdown. Put this into your application module::
xd: Al igual que en el enfoque declarativo, es necesario cerrar la sesión después de cada solicitud o cierre del contexto de la aplicación. Ponga esto en su módulo de aplicación::

source: Here is an example table and model (put this into :file:`models.py`)::
xd: He aquí una tabla y un modelo de ejemplo (ponlo en :file:`models.py`)::

source: Querying and inserting works exactly the same as in the example above.
xd: La consulta y la inserción funcionan exactamente igual que en el ejemplo anterior.

source: SQL Abstraction Layer
xd: Capa de abstracción SQL

source: If you just want to use the database system (and SQL) abstraction layer you basically only need the engine::
xd: Si sólo quieres utilizar la capa de abstracción del sistema de base de datos (y SQL) básicamente sólo necesitas el motor::

source: Then you can either declare the tables in your code like in the examples above, or automatically load them::
xd: Entonces puedes declarar las tablas en tu código como en los ejemplos anteriores, o cargarlas automáticamente::

source: To insert data you can use the `insert` method. We have to get a connection first so that we can use a transaction:
xd: Para insertar datos se puede utilizar el método `insert`. Primero tenemos que obtener una conexión para poder utilizar una transacción:

source: SQLAlchemy will automatically commit for us.
xd: SQLAlchemy se compromete automáticamente por nosotros.

source: To query your database, you use the engine directly or use a connection:
xd: Para consultar la base de datos, se utiliza el motor directamente o se utiliza una conexión:

source: These results are also dict-like tuples:
xd: Estos resultados también son tuplas de tipo dictado:

source: You can also pass strings of SQL statements to the :meth:`~sqlalchemy.engine.base.Connection.execute` method:
xd: También puedes pasar cadenas de sentencias SQL al método :meth:`~sqlalchemy.engine.base.Connection.execute`:

source: For more information about SQLAlchemy, head over to the `website <https://www.sqlalchemy.org/>`_.
xd: Para obtener más información sobre SQLAlchemy, diríjase al `sitio web <https://www.sqlalchemy.org/>`_.
