Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/patterns/sqlite3.po
Languages: xd

source: Using SQLite 3 with Flask
xd: Uso de SQLite 3 con Flask

source: In Flask you can easily implement the opening of database connections on demand and closing them when the context dies (usually at the end of the request).
xd: En Flask puedes implementar fácilmente la apertura de conexiones a la base de datos bajo demanda y el cierre de las mismas cuando el contexto muere (normalmente al final de la petición).

source: Here is a simple example of how you can use SQLite 3 with Flask::
xd: Aquí hay un ejemplo sencillo de cómo se puede utilizar SQLite 3 con Flask::

source: Now, to use the database, the application must either have an active application context (which is always true if there is a request in flight) or create an application context itself. At that point the ``get_db`` function can be used to get the current database connection. Whenever the context is destroyed the database connection will be terminated.
xd: Ahora, para usar la base de datos, la aplicación debe tener un contexto de aplicación activo (que siempre es cierto si hay una petición en vuelo) o crear un contexto de aplicación por sí misma. En ese momento se puede utilizar la función ``get_db`` para obtener la conexión a la base de datos actual. Siempre que el contexto se destruya, la conexión a la base de datos se terminará.

source: Example::
xd: Ejemplo::

source: Please keep in mind that the teardown request and appcontext functions are always executed, even if a before-request handler failed or was never executed. Because of this we have to make sure here that the database is there before we close it.
xd: Ten en cuenta que las funciones teardown request y appcontext se ejecutan siempre, incluso si un manejador before-request falló o nunca se ejecutó. Debido a esto tenemos que asegurarnos aquí de que la base de datos está ahí antes de cerrarla.

source: Connect on Demand
xd: Conectar a la carta

source: The upside of this approach (connecting on first use) is that this will only open the connection if truly necessary. If you want to use this code outside a request context you can use it in a Python shell by opening the application context by hand::
xd: La ventaja de este enfoque (conectar en el primer uso) es que esto sólo abrirá la conexión si es realmente necesario. Si quieres usar este código fuera de un contexto de petición puedes usarlo en un shell de Python abriendo el contexto de aplicación a mano::

source: Easy Querying
xd: Consulta fácil

source: Now in each request handling function you can access `get_db()` to get the current open database connection. To simplify working with SQLite, a row factory function is useful. It is executed for every result returned from the database to convert the result. For instance, in order to get dictionaries instead of tuples, this could be inserted into the ``get_db`` function we created above::
xd: Ahora en cada función de manejo de peticiones puedes acceder a `get_db()` para obtener la conexión actual de la base de datos abierta. Para simplificar el trabajo con SQLite, es útil una función de fábrica de filas. Se ejecuta para cada resultado devuelto por la base de datos para convertir el resultado. Por ejemplo, para obtener diccionarios en lugar de tuplas, esto podría ser insertado en la función ``get_db`` que creamos anteriormente::

source: This will make the sqlite3 module return dicts for this database connection, which are much nicer to deal with. Even more simply, we could place this in ``get_db`` instead::
xd: Esto hará que el módulo sqlite3 devuelva dicts para esta conexión de base de datos, que son mucho más agradables de manejar. Incluso más simple, podríamos colocar esto en ``get_db`` en su lugar::

source: This would use Row objects rather than dicts to return the results of queries. These are ``namedtuple`` s, so we can access them either by index or by key. For example, assuming we have a ``sqlite3.Row`` called ``r`` for the rows ``id``, ``FirstName``, ``LastName``, and ``MiddleInitial``::
xd: Esto utilizaría objetos Row en lugar de dicts para devolver los resultados de las consultas. Son ``tuplas con nombre``, por lo que podemos acceder a ellas por índice o por clave. Por ejemplo, suponiendo que tenemos un ``sqlite3.Row`` llamado ``r`` para las filas ``id``, ``FirstName``, ``LastName``, y ``MiddleInitial``::

source: Additionally, it is a good idea to provide a query function that combines getting the cursor, executing and fetching the results::
xd: Además, es una buena idea proporcionar una función de consulta que combine la obtención del cursor, la ejecución y la obtención de los resultados::

source: This handy little function, in combination with a row factory, makes working with the database much more pleasant than it is by just using the raw cursor and connection objects.
xd: Esta pequeña y práctica función, en combinación con una fábrica de filas, hace que el trabajo con la base de datos sea mucho más agradable de lo que es utilizando sólo los objetos de cursor y conexión en bruto.

source: Here is how you can use it::
xd: Así es como se puede utilizar::

source: Or if you just want a single result::
xd: O si sólo quieres un único resultado::

source: To pass variable parts to the SQL statement, use a question mark in the statement and pass in the arguments as a list. Never directly add them to the SQL statement with string formatting because this makes it possible to attack the application using `SQL Injections <https://en.wikipedia.org/wiki/SQL_injection>`_.
xd: Para pasar partes de variables a la sentencia SQL, utilice un signo de interrogación en la sentencia y pase los argumentos como una lista. Nunca los añada directamente a la sentencia SQL con formato de cadena porque esto hace posible atacar la aplicación usando `Inyecciones SQL <https://en.wikipedia.org/wiki/SQL_injection>`_.

source: Initial Schemas
xd: Esquemas iniciales

source: Relational databases need schemas, so applications often ship a `schema.sql` file that creates the database. It's a good idea to provide a function that creates the database based on that schema. This function can do that for you::
xd: Las bases de datos relacionales necesitan esquemas, por lo que las aplicaciones suelen enviar un archivo `schema.sql` que crea la base de datos. Es una buena idea proporcionar una función que cree la base de datos basada en ese esquema. Esta función puede hacerlo por ti::

source: You can then create such a database from the Python shell:
xd: A continuación, puede crear dicha base de datos desde el shell de Python:
