Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/patterns/wtforms.po
Languages: xd

source: Form Validation with WTForms
xd: Validación de formularios con WTForms

source: When you have to work with form data submitted by a browser view, code quickly becomes very hard to read. There are libraries out there designed to make this process easier to manage. One of them is `WTForms`_ which we will handle here. If you find yourself in the situation of having many forms, you might want to give it a try.
xd: Cuando tienes que trabajar con datos de formularios enviados por una vista del navegador, el código se vuelve rápidamente muy difícil de leer. Existen librerías diseñadas para hacer este proceso más fácil de manejar. Una de ellas es `WTForms`_ que manejaremos aquí. Si te encuentras en la situación de tener muchos formularios, quizás quieras probarla.

source: When you are working with WTForms you have to define your forms as classes first. I recommend breaking up the application into multiple modules (:doc:`packages`) for that and adding a separate module for the forms.
xd: Cuando se trabaja con WTForms hay que definir primero los formularios como clases. Recomiendo dividir la aplicación en múltiples módulos (:doc:`packages`) para ello y añadir un módulo separado para los formularios.

source: Getting the most out of WTForms with an Extension
xd: Sacar el máximo partido a WTForms con una extensión

source: The `Flask-WTF`_ extension expands on this pattern and adds a few little helpers that make working with forms and Flask more fun. You can get it from `PyPI <https://pypi.org/project/Flask-WTF/>`_.
xd: La extensión `Flask-WTF`_ amplía este patrón y añade algunos pequeños ayudantes que hacen que trabajar con formularios y Flask sea más divertido. Puedes conseguirla en `PyPI <https://pypi.org/project/Flask-WTF/>`_.

source: The Forms
xd: Los formularios

source: This is an example form for a typical registration page::
xd: Este es un ejemplo de formulario para una página de registro típica::

source: In the View
xd: En la vista

source: In the view function, the usage of this form looks like this::
xd: En la función de la vista, el uso de esta forma se ve así::

source: Notice we're implying that the view is using SQLAlchemy here (:doc:`sqlalchemy`), but that's not a requirement, of course. Adapt the code as necessary.
xd: Fíjate que aquí estamos implicando que la vista está usando SQLAlchemy (:doc:`sqlalchemy`), pero eso no es un requisito, por supuesto. Adapta el código como sea necesario.

source: Things to remember:
xd: Cosas para recordar:

source: create the form from the request :attr:`~flask.request.form` value if the data is submitted via the HTTP ``POST`` method and :attr:`~flask.request.args` if the data is submitted as ``GET``.
xd: crear el formulario a partir del valor de la solicitud :attr:`~flask.request.form` si los datos se envían a través del método HTTP ``POST`` y :attr:`~flask.request.args` si los datos se envían como ``GET``.

source: to validate the data, call the :func:`~wtforms.form.Form.validate` method, which will return ``True`` if the data validates, ``False`` otherwise.
xd: para validar los datos, llama al método :func:`~wtforms.form.Form.validate`, que devolverá ``True`` si los datos se validan, ``False`` en caso contrario.

source: to access individual values from the form, access `form.<NAME>.data`.
xd: para acceder a valores individuales del formulario, accede a `form.<NAME>.data`.

source: Forms in Templates
xd: Formularios en plantillas

source: Now to the template side. When you pass the form to the templates, you can easily render them there. Look at the following example template to see how easy this is. WTForms does half the form generation for us already. To make it even nicer, we can write a macro that renders a field with label and a list of errors if there are any.
xd: Ahora al lado de las plantillas. Cuando pasas el formulario a las plantillas, puedes fácilmente renderizarlas allí. Mira la siguiente plantilla de ejemplo para ver lo fácil que es esto. WTForms ya hace la mitad de la generación de formularios por nosotros. Para hacerlo aún más bonito, podemos escribir una macro que renderice un campo con etiqueta y una lista de errores si los hay.

source: Here's an example :file:`_formhelpers.html` template with such a macro:
xd: Aquí hay un ejemplo de plantilla :file:`_formhelpers.html` con dicha macro:

source: This macro accepts a couple of keyword arguments that are forwarded to WTForm's field function, which renders the field for us. The keyword arguments will be inserted as HTML attributes. So, for example, you can call ``render_field(form.username, class='username')`` to add a class to the input element. Note that WTForms returns standard Python strings, so we have to tell Jinja2 that this data is already HTML-escaped with the ``|safe`` filter.
xd: Esta macro acepta un par de argumentos de palabras clave que se envían a la función de campo de WTForm, que renderiza el campo por nosotros. Los argumentos de la palabra clave serán insertados como atributos HTML. Así, por ejemplo, puedes llamar a ``render_field(form.username, class='username')`` para añadir una clase al elemento de entrada. Ten en cuenta que WTForms devuelve cadenas estándar de Python, por lo que tenemos que decirle a Jinja2 que estos datos ya están escaneados en HTML con el filtro ``|safe``.

source: Here is the :file:`register.html` template for the function we used above, which takes advantage of the :file:`_formhelpers.html` template:
xd: Aquí está la plantilla :file:`register.html` para la función que usamos arriba, que aprovecha la plantilla :file:`_formhelpers.html`:

source: For more information about WTForms, head over to the `WTForms website`_.
xd: Para obtener más información sobre WTForms, visite el sitio web de `WTForms`_.
