Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/apache-httpd.po
Languages: xd

source: `Apache httpd`_ is a fast, production level HTTP server. When serving your application with one of the WSGI servers listed in :doc:`index`, it is often good or necessary to put a dedicated HTTP server in front of it. This "reverse proxy" can handle incoming requests, TLS, and other security and performance concerns better than the WSGI server.
xd: `Apache httpd`_ es un servidor HTTP rápido y de nivel de producción. Cuando sirva su aplicación con uno de los servidores WSGI listados en :doc:`index`, a menudo es bueno o necesario poner un servidor HTTP dedicado delante de él. Este "proxy inverso" puede manejar las peticiones entrantes, TLS, y otros problemas de seguridad y rendimiento mejor que el servidor WSGI.

source: httpd can be installed using your system package manager, or a pre-built executable for Windows. Installing and running httpd itself is outside the scope of this doc. This page outlines the basics of configuring httpd to proxy your application. Be sure to read its documentation to understand what features are available.
xd: httpd puede instalarse utilizando el gestor de paquetes de su sistema, o un ejecutable preconstruido para Windows. La instalación y ejecución de httpd en sí está fuera del alcance de este documento. Esta página describe los aspectos básicos de la configuración de httpd para el proxy de su aplicación. Asegúrese de leer su documentación para entender qué características están disponibles.

source: Domain Name
xd: Nombre de dominio

source: Acquiring and configuring a domain name is outside the scope of this doc. In general, you will buy a domain name from a registrar, pay for server space with a hosting provider, and then point your registrar at the hosting provider's name servers.
xd: La adquisición y configuración de un nombre de dominio está fuera del alcance de este documento. En general, usted comprará un nombre de dominio de un registrador, pagará por el espacio del servidor con un proveedor de alojamiento, y luego apuntará su registrador a los servidores de nombres del proveedor de alojamiento.

source: To simulate this, you can also edit your ``hosts`` file, located at ``/etc/hosts`` on Linux. Add a line that associates a name with the local IP.
xd: Para simular esto, también puedes editar tu archivo ``hosts``, ubicado en ``/etc/hosts`` en Linux. Añade una línea que asocie un nombre con la IP local.

source: Modern Linux systems may be configured to treat any domain name that ends with ``.localhost`` like this without adding it to the ``hosts`` file.
xd: Los sistemas Linux modernos pueden estar configurados para tratar cualquier nombre de dominio que termine en ``.localhost`` de esta manera sin añadirlo al archivo ``hosts``.

source: Configuration
xd: Configuración

source: The httpd configuration is located at ``/etc/httpd/conf/httpd.conf`` on Linux. It may be different depending on your operating system. Check the docs and look for ``httpd.conf``.
xd: La configuración de httpd se encuentra en ``/etc/httpd/conf/httpd.conf`` en Linux. Puede ser diferente dependiendo de su sistema operativo. Consulta la documentación y busca ``httpd.conf``.

source: Remove or comment out any existing ``DocumentRoot`` directive. Add the config lines below. We'll assume the WSGI server is listening locally at ``http://127.0.0.1:8000``.
xd: Elimine o comente cualquier directiva existente ``DocumentRoot``. Añade las líneas de configuración de abajo. Asumiremos que el servidor WSGI está escuchando localmente en ``http://127.0.0.1:8000``.

source: The ``LoadModule`` lines might already exist. If so, make sure they are uncommented instead of adding them manually.
xd: Es posible que las líneas ``LoadModule`` ya existan. Si es así, asegúrese de descomentarlas en lugar de añadirlas manualmente.

source: Then :doc:`proxy_fix` so that your application uses the ``X-Forwarded`` headers. ``X-Forwarded-For`` and ``X-Forwarded-Host`` are automatically set by ``ProxyPass``.
xd: Entonces :doc:`proxy_fix` para que tu aplicación utilice las cabeceras ``X-Forwarded``. Las cabeceras ``X-Forwarded-For`` y ``X-Forwarded-Host`` se establecen automáticamente con ``ProxyPass``.
