Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/cgi.po
Languages: es

source: If all other deployment methods do not work, CGI will work for sure. CGI is supported by all major servers but usually has a sub-optimal performance.
es: Si todos los demás métodos de despliegue no funcionan, CGI funcionará con seguridad. CGI es soportado por todos los principales servidores, pero suele tener un rendimiento sub-óptimo.

source: This is also the way you can use a Flask application on Google's `App Engine`_, where execution happens in a CGI-like environment.
es: Esta es también la forma en que se puede utilizar una aplicación Flask en el `App Engine`_ de Google, donde la ejecución ocurre en un entorno similar a CGI.

source: Watch Out
es: Cuidado

source: Please make sure in advance that any ``app.run()`` calls you might have in your application file are inside an ``if __name__ == '__main__':`` block or moved to a separate file. Just make sure it's not called because this will always start a local WSGI server which we do not want if we deploy that application to CGI / app engine.
es: Por favor, asegúrese de antemano que cualquier llamada a ``app.run()`` que pueda tener en su archivo de aplicación esté dentro de un bloque ``if __name__ == '__main__':`` o que se mueva a un archivo separado. Sólo asegúrate de que no se llama porque esto siempre iniciará un servidor WSGI local que no queremos si desplegamos esa aplicación a CGI / app engine.

source: With CGI, you will also have to make sure that your code does not contain any ``print`` statements, or that ``sys.stdout`` is overridden by something that doesn't write into the HTTP response.
es: Con CGI, también tendrás que asegurarte de que tu código no contenga ninguna sentencia ``print``, o que ``sys.stdout`` sea anulado por algo que no escriba en la respuesta HTTP.

source: Creating a `.cgi` file
es: Creación de un archivo `.cgi`

source: First you need to create the CGI application file. Let's call it :file:`yourapplication.cgi`::
es: Primero hay que crear el archivo de la aplicación CGI. Llamémoslo :file:`tuaplicacion.cgi`::

source: Server Setup
es: Configuración del servidor

source: Usually there are two ways to configure the server. Either just copy the ``.cgi`` into a :file:`cgi-bin` (and use `mod_rewrite` or something similar to rewrite the URL) or let the server point to the file directly.
es: Normalmente hay dos maneras de configurar el servidor. O bien se copia el ``.cgi`` en un archivo :file:`cgi-bin` (y se usa `mod_rewrite` o algo similar para reescribir la URL) o se deja que el servidor apunte al archivo directamente.

source: In Apache for example you can put something like this into the config:
es: En Apache, por ejemplo, puedes poner algo como esto en la configuración:

source: On shared webhosting, though, you might not have access to your Apache config. In this case, a file called ``.htaccess``, sitting in the public directory you want your app to be available, works too but the ``ScriptAlias`` directive won't work in that case:
es: Sin embargo, en un alojamiento web compartido, es posible que no tengas acceso a tu configuración de Apache. En este caso, un archivo llamado ``.htaccess``, situado en el directorio público en el que quieres que tu aplicación esté disponible, también funciona, pero la directiva ``ScriptAlias`` no funcionará en ese caso:

source: For more information consult the documentation of your webserver.
es: Para más información consulte la documentación de su servidor web.
