Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/eventlet.po
Languages: xd

source: Prefer using :doc:`gunicorn` with eventlet workers rather than using `eventlet`_ directly. Gunicorn provides a much more configurable and production-tested server.
xd: Prefiero usar :doc:`gunicorn` con eventlet workers en lugar de usar `eventlet`_ directamente. Gunicorn proporciona un servidor mucho más configurable y probado en producción.

source: `eventlet`_ allows writing asynchronous, coroutine-based code that looks like standard synchronous Python. It uses `greenlet`_ to enable task switching without writing ``async/await`` or using ``asyncio``.
xd: `eventlet`_ permite escribir código asíncrono, basado en coroutinas, que se parece al Python síncrono estándar. Utiliza `greenlet`_ para permitir el cambio de tareas sin escribir ``async/await`` o utilizar ``asyncio``.

source: :doc:`gevent` is another library that does the same thing. Certain dependencies you have, or other considerations, may affect which of the two you choose to use.
xd: :doc:`gevent` es otra biblioteca que hace lo mismo. Ciertas dependencias que tenga, u otras consideraciones, pueden afectar a cuál de las dos elija utilizar.

source: eventlet provides a WSGI server that can handle many connections at once instead of one per worker process. You must actually use eventlet in your own code to see any benefit to using the server.
xd: eventlet proporciona un servidor WSGI que puede manejar muchas conexiones a la vez en lugar de una por proceso de trabajo. Debes usar eventlet en tu propio código para ver algún beneficio al usar el servidor.

source: Installing
xd: Instalación

source: When using eventlet, greenlet>=1.0 is required, otherwise context locals such as ``request`` will not work as expected. When using PyPy, PyPy>=7.3.7 is required.
xd: Cuando se utiliza eventlet, se requiere greenlet>=1.0, de lo contrario los contextos locales como ``request`` no funcionarán como se espera. Cuando se utiliza PyPy, se requiere PyPy>=7.3.7.

source: Create a virtualenv, install your application, then install ``eventlet``.
xd: Crea un virtualenv, instala tu aplicación y luego instala ``eventlet``.

source: Running
xd: Ejecutando

source: To use eventlet to serve your application, write a script that imports its ``wsgi.server``, as well as your app or app factory.
xd: Para usar eventlet para servir tu aplicación, escribe un script que importe su ``wsgi.server``, así como tu app o fábrica de apps.

source: Binding Externally
xd: Vinculación externa

source: eventlet should not be run as root because it would cause your application code to run as root, which is not secure. However, this means it will not be possible to bind to port 80 or 443. Instead, a reverse proxy such as :doc:`nginx` or :doc:`apache-httpd` should be used in front of eventlet.
xd: eventlet no debe ejecutarse como root porque provocaría que el código de su aplicación se ejecutara como root, lo cual no es seguro. Sin embargo, esto significa que no será posible enlazar con el puerto 80 o 443. En su lugar, debe utilizarse un proxy inverso como :doc:`nginx` o :doc:`apache-httpd` delante de eventlet.

source: You can bind to all external IPs on a non-privileged port by using ``0.0.0.0`` in the server arguments shown in the previous section. Don't do this when using a reverse proxy setup, otherwise it will be possible to bypass the proxy.
xd: Puedes vincular todas las IPs externas en un puerto no privilegiado utilizando ``0.0.0.0`` en los argumentos del servidor mostrados en la sección anterior. No hagas esto cuando utilices una configuración de proxy inverso, de lo contrario será posible eludir el proxy.

source: ``0.0.0.0`` is not a valid address to navigate to, you'd use a specific IP address in your browser.
xd: ``0.0.0.0`` no es una dirección válida para navegar, sino que debes utilizar una dirección IP específica en tu navegador.
