Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/fastcgi.po
Languages: es

source: FastCGI is a deployment option on servers like `nginx`_, `lighttpd`_, and `cherokee`_; see :doc:`uwsgi` and :doc:`wsgi-standalone` for other options. To use your WSGI application with any of them you will need a FastCGI server first. The most popular one is `flup`_ which we will use for this guide. Make sure to have it installed to follow along.
es: FastCGI es una opción de despliegue en servidores como `nginx`_, `lighttpd`_, y `cherokee`_; vea :doc:`uwsgi` y :doc:`wsgi-standalone` para otras opciones. Para utilizar su aplicación WSGI con cualquiera de ellas necesitará primero un servidor FastCGI. El más popular es `flup`_ que usaremos para esta guía. Asegúrate de tenerlo instalado para poder seguir adelante.

source: Please make sure in advance that any ``app.run()`` calls you might have in your application file are inside an ``if __name__ == '__main__':`` block or moved to a separate file. Just make sure it's not called because this will always start a local WSGI server which we do not want if we deploy that application to FastCGI.
es: Por favor, asegúrate de antemano de que cualquier llamada a ``app.run()`` que puedas tener en tu archivo de aplicación esté dentro de un bloque ``if __name__ == '__main__':`` o se mueva a un archivo separado. Asegúrate de que no se llama porque esto siempre iniciará un servidor WSGI local que no queremos si desplegamos esa aplicación en FastCGI.

source: Creating a `.fcgi` file
es: Creación de un archivo `.fcgi`

source: First you need to create the FastCGI server file. Let's call it `yourapplication.fcgi`::
es: Primero necesitas crear el archivo del servidor FastCGI. Vamos a llamarlo `tuaplicacion.fcgi`::

source: This is enough for Apache to work, however nginx and older versions of lighttpd need a socket to be explicitly passed to communicate with the FastCGI server. For that to work you need to pass the path to the socket to the :class:`~flup.server.fcgi.WSGIServer`::
es: Esto es suficiente para que Apache funcione, sin embargo nginx y las versiones más antiguas de lighttpd necesitan que se pase explícitamente un socket para comunicarse con el servidor FastCGI. Para que esto funcione es necesario pasar la ruta del socket a la clase :class:`~flup.server.fcgi.WSGIServer`::

source: The path has to be the exact same path you define in the server config.
es: La ruta tiene que ser exactamente la misma que se define en la configuración del servidor.

source: Save the :file:`yourapplication.fcgi` file somewhere you will find it again. It makes sense to have that in :file:`/var/www/yourapplication` or something similar.
es: Guarde el archivo :file:`tuaplicacion.fcgi` en algún lugar donde pueda encontrarlo de nuevo. Tiene sentido tenerlo en :file:`/var/www/tuaplicacion` o algo similar.

source: Make sure to set the executable bit on that file so that the servers can execute it:
es: Asegúrate de poner el bit de ejecutable en ese archivo para que los servidores puedan ejecutarlo:

source: The example above is good enough for a basic Apache deployment but your `.fcgi` file will appear in your application URL e.g. ``example.com/yourapplication.fcgi/news/``. There are few ways to configure your application so that yourapplication.fcgi does not appear in the URL. A preferable way is to use the ScriptAlias and SetHandler configuration directives to route requests to the FastCGI server. The following example uses FastCgiServer to start 5 instances of the application which will handle all incoming requests::
es: El ejemplo anterior es lo suficientemente bueno para un despliegue básico de Apache, pero su archivo `.fcgi` aparecerá en la URL de su aplicación, por ejemplo ``ejemplo.com/tuaplicacion.fcgi/news/``. Hay algunas maneras de configurar su aplicación para que tuaplicacion.fcgi no aparezca en la URL. Una forma preferible es utilizar las directivas de configuración ScriptAlias y SetHandler para dirigir las peticiones al servidor FastCGI. El siguiente ejemplo utiliza FastCgiServer para iniciar 5 instancias de la aplicación que manejarán todas las peticiones entrantes::

source: These processes will be managed by Apache. If you're using a standalone FastCGI server, you can use the FastCgiExternalServer directive instead. Note that in the following the path is not real, it's simply used as an identifier to other directives such as AliasMatch::
es: Estos procesos serán gestionados por Apache. Si está usando un servidor FastCGI independiente, puede usar la directiva FastCgiExternalServer en su lugar. Tenga en cuenta que en lo siguiente la ruta no es real, simplemente se utiliza como identificador para otras directivas como AliasMatch::

source: If you cannot set ScriptAlias, for example on a shared web host, you can use WSGI middleware to remove yourapplication.fcgi from the URLs. Set .htaccess::
es: Si no puede establecer ScriptAlias, por ejemplo en un host web compartido, puede utilizar el middleware WSGI para eliminar tuaplicacion.fcgi de las URLs. Establezca .htaccess::

source: Set yourapplication.fcgi::
es: Establecer tuaplicacion.fcgi::

source: Configuring lighttpd
es: Configuración de lighttpd

source: A basic FastCGI configuration for lighttpd looks like that::
es: Una configuración básica de FastCGI para lighttpd tiene el siguiente aspecto::

source: Remember to enable the FastCGI, alias and rewrite modules. This configuration binds the application to ``/yourapplication``. If you want the application to work in the URL root you have to work around a lighttpd bug with the :class:`~werkzeug.contrib.fixers.LighttpdCGIRootFix` middleware.
es: Recuerda habilitar los módulos FastCGI, alias y rewrite. Esta configuración vincula la aplicación a ``/tuaplicacion``. Si quieres que la aplicación funcione en la raíz de la URL tienes que solucionar un error de lighttpd con el middleware :class:`~werkzeug.contrib.fixers.LighttpdCGIRootFix`.

source: Make sure to apply it only if you are mounting the application the URL root. Also, see the Lighty docs for more information on `FastCGI and Python <https://redmine.lighttpd.net/projects/lighttpd/wiki/Docs_ModFastCGI>`_ (note that explicitly passing a socket to run() is no longer necessary).
es: Asegúrate de aplicarlo sólo si estás montando la aplicación en la raíz de la URL. Además, vea los documentos de Lighty para más información sobre `FastCGI y Python <https://redmine.lighttpd.net/projects/lighttpd/wiki/Docs_ModFastCGI>`_ (tenga en cuenta que ya no es necesario pasar explícitamente un socket a run()).

source: Configuring nginx
es: Configuración de nginx

source: Installing FastCGI applications on nginx is a bit different because by default no FastCGI parameters are forwarded.
es: La instalación de aplicaciones FastCGI en nginx es un poco diferente porque por defecto no se reenvían parámetros FastCGI.

source: A basic Flask FastCGI configuration for nginx looks like this::
es: Una configuración básica de Flask FastCGI para nginx tiene el siguiente aspecto::

source: This configuration binds the application to ``/yourapplication``. If you want to have it in the URL root it's a bit simpler because you don't have to figure out how to calculate ``PATH_INFO`` and ``SCRIPT_NAME``::
es: Esta configuración vincula la aplicación a ``/tuaplicacion``. Si quieres tenerla en la raíz de la URL es un poco más sencillo porque no tienes que averiguar cómo calcular ``PATH_INFO`` y ``SCRIPT_NAME``::

source: Running FastCGI Processes
es: Ejecución de procesos FastCGI

source: Since nginx and others do not load FastCGI apps, you have to do it by yourself. `Supervisor can manage FastCGI processes. <http://supervisord.org/configuration.html#fcgi-program-x-section-settings>`_ You can look around for other FastCGI process managers or write a script to run your `.fcgi` file at boot, e.g. using a SysV ``init.d`` script. For a temporary solution, you can always run the ``.fcgi`` script inside GNU screen. See ``man screen`` for details, and note that this is a manual solution which does not persist across system restart::
es: Como nginx y otros no cargan aplicaciones FastCGI, tienes que hacerlo tú mismo. `Supervisor puede gestionar los procesos FastCGI. <http://supervisord.org/configuration.html#fcgi-program-x-section-settings>`_ Puedes buscar otros gestores de procesos FastCGI o escribir un script para ejecutar tu archivo `.fcgi` en el arranque, por ejemplo, usando un script SysV ``init.d``. Para una solución temporal, siempre puedes ejecutar el script ``.fcgi`` dentro de GNU screen. Vea ``man screen`` para más detalles, y tenga en cuenta que esta es una solución manual que no persiste a través del reinicio del sistema::

source: Debugging
es: Depurando

source: FastCGI deployments tend to be hard to debug on most web servers. Very often the only thing the server log tells you is something along the lines of "premature end of headers". In order to debug the application the only thing that can really give you ideas why it breaks is switching to the correct user and executing the application by hand.
es: Las implementaciones de FastCGI tienden a ser difíciles de depurar en la mayoría de los servidores web. Muy a menudo lo único que te dice el registro del servidor es algo parecido a "final prematuro de las cabeceras". Para depurar la aplicación, lo único que realmente puede darte ideas de por qué se rompe es cambiar al usuario correcto y ejecutar la aplicación a mano.

source: This example assumes your application is called `application.fcgi` and that your web server user is `www-data`::
es: Este ejemplo asume que su aplicación se llama `aplicacion.fcgi` y que el usuario de su servidor web es `www-data`::

source: In this case the error seems to be "yourapplication" not being on the python path. Common problems are:
es: En este caso el error parece ser que "tuaplicacion" no está en la ruta de python. Los problemas más comunes son:

source: Relative paths being used. Don't rely on the current working directory.
es: Se utilizan rutas relativas. No depender del directorio de trabajo actual.

source: The code depending on environment variables that are not set by the web server.
es: Que el código dependa de variables de entorno que no son establecidas por el servidor web.

source: Different python interpreters being used.
es: Que se utilicen diferentes intérpretes de python.
