Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/gevent.po
Languages: xd

source: Prefer using :doc:`gunicorn` or :doc:`uwsgi` with gevent workers rather than using `gevent`_ directly. Gunicorn and uWSGI provide much more configurable and production-tested servers.
xd: Prefiera usar :doc:`gunicorn` o :doc:`uwsgi` con trabajadores gevent en lugar de usar `gevent`_ directamente. Gunicorn y uWSGI proporcionan servidores mucho más configurables y probados en producción.

source: `gevent`_ allows writing asynchronous, coroutine-based code that looks like standard synchronous Python. It uses `greenlet`_ to enable task switching without writing ``async/await`` or using ``asyncio``.
xd: `gevent`_ permite escribir código asíncrono, basado en coroutinas, que parece un Python síncrono estándar. Utiliza `greenlet`_ para permitir el cambio de tareas sin escribir ``async/await`` o utilizar ``asyncio``.

source: :doc:`eventlet` is another library that does the same thing. Certain dependencies you have, or other considerations, may affect which of the two you choose to use.
xd: :doc:`eventlet` es otra biblioteca que hace lo mismo. Ciertas dependencias que tenga, u otras consideraciones, pueden afectar a cuál de las dos elija utilizar.

source: gevent provides a WSGI server that can handle many connections at once instead of one per worker process. You must actually use gevent in your own code to see any benefit to using the server.
xd: gevent proporciona un servidor WSGI que puede manejar muchas conexiones a la vez en lugar de una por proceso trabajador. Debes usar gevent en tu propio código para ver algún beneficio al usar el servidor.

source: Installing
xd: Instalación

source: When using gevent, greenlet>=1.0 is required, otherwise context locals such as ``request`` will not work as expected. When using PyPy, PyPy>=7.3.7 is required.
xd: Cuando se utiliza gevent, se requiere greenlet>=1.0, de lo contrario los contextos locales como ``request`` no funcionarán como se espera. Cuando se utiliza PyPy, se requiere PyPy>=7.3.7.

source: Create a virtualenv, install your application, then install ``gevent``.
xd: Crea un virtualenv, instala tu aplicación y luego instala ``gevent``.

source: Running
xd: Ejecutando

source: To use gevent to serve your application, write a script that imports its ``WSGIServer``, as well as your app or app factory.
xd: Para usar gevent para servir tu aplicación, escribe un script que importe su ``WSGIServer``, así como tu app o fábrica de apps.

source: No output is shown when the server starts.
xd: No se muestra ninguna salida cuando el servidor se inicia.

source: Binding Externally
xd: Vinculación externa

source: gevent should not be run as root because it would cause your application code to run as root, which is not secure. However, this means it will not be possible to bind to port 80 or 443. Instead, a reverse proxy such as :doc:`nginx` or :doc:`apache-httpd` should be used in front of gevent.
xd: gevent no debe ejecutarse como root porque provocaría que el código de su aplicación se ejecutara como root, lo cual no es seguro. Sin embargo, esto significa que no será posible enlazar con el puerto 80 o 443. En su lugar, debe utilizarse un proxy inverso como :doc:`nginx` o :doc:`apache-httpd` delante de gevent.

source: You can bind to all external IPs on a non-privileged port by using ``0.0.0.0`` in the server arguments shown in the previous section. Don't do this when using a reverse proxy setup, otherwise it will be possible to bypass the proxy.
xd: Puedes enlazar con todas las IPs externas en un puerto no privilegiado utilizando ``0.0.0.0`` en los argumentos del servidor mostrados en la sección anterior. No hagas esto cuando utilices una configuración de proxy inverso, de lo contrario será posible eludir el proxy.

source: ``0.0.0.0`` is not a valid address to navigate to, you'd use a specific IP address in your browser.
xd: ``0.0.0.0`` no es una dirección válida para navegar, sino que debes utilizar una dirección IP específica en tu navegador.
