Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/gunicorn.po
Languages: xd

source: `Gunicorn`_ is a pure Python WSGI server with simple configuration and multiple worker implementations for performance tuning.
xd: `Gunicorn`_ es un servidor WSGI hecho Python puro con una configuración sencilla y múltiples implementaciones de trabajadores para el ajuste del rendimiento.

source: It tends to integrate easily with hosting platforms.
xd: Suele integrarse fácilmente con las plataformas de alojamiento.

source: It does not support Windows (but does run on WSL).
xd: No es compatible con Windows (pero sí con WSL).

source: It is easy to install as it does not require additional dependencies or compilation.
xd: Es fácil de instalar, ya que no requiere dependencias adicionales ni compilación.

source: It has built-in async worker support using gevent or eventlet.
xd: Tiene soporte de trabajador asíncrono incorporado usando gevent o eventlet.

source: This page outlines the basics of running Gunicorn. Be sure to read its `documentation`_ and use ``gunicorn --help`` to understand what features are available.
xd: Esta página describe los aspectos básicos del funcionamiento de Gunicorn. Asegúrese de leer su `documentación`_ y utilizar ``gunicorn --help`` para entender qué características están disponibles.

source: Installing
xd: Instalación

source: Gunicorn is easy to install, as it does not require external dependencies or compilation. It runs on Windows only under WSL.
xd: Gunicorn es fácil de instalar, ya que no requiere dependencias externas ni compilación. Se ejecuta en Windows sólo bajo WSL.

source: Create a virtualenv, install your application, then install ``gunicorn``.
xd: Crea un virtualenv, instala tu aplicación y luego instala ``gunicorn``.

source: Running
xd: Ejecutando

source: The only required argument to Gunicorn tells it how to load your Flask application. The syntax is ``{module_import}:{app_variable}``. ``module_import`` is the dotted import name to the module with your application. ``app_variable`` is the variable with the application. It can also be a function call (with any arguments) if you're using the app factory pattern.
xd: El único argumento requerido a Gunicorn le dice cómo cargar su aplicación Flask. La sintaxis es ``{module_import}:{app_variable}``. ``module_import`` es el nombre de importación con puntos del módulo con tu aplicación. ``app_variable`` es la variable con la aplicación. También puede ser una llamada a una función (con cualquier argumento) si estás usando el patrón de fábrica de aplicaciones.

source: The ``-w`` option specifies the number of processes to run; a starting value could be ``CPU * 2``. The default is only 1 worker, which is probably not what you want for the default worker type.
xd: La opción ``-w`` especifica el número de procesos a ejecutar; un valor inicial podría ser ``CPU * 2``. El valor por defecto es sólo 1 trabajador, que probablemente no es lo que quieres para el tipo de trabajador por defecto.

source: Logs for each request aren't shown by default, only worker info and errors are shown. To show access logs on stdout, use the ``--access-logfile=-`` option.
xd: Los registros de cada solicitud no se muestran por defecto, sólo se muestra la información del trabajador y los errores. Para mostrar los registros de acceso en stdout, utilice la opción ``--access-logfile=-``.

source: Binding Externally
xd: Vinculación externa

source: Gunicorn should not be run as root because it would cause your application code to run as root, which is not secure. However, this means it will not be possible to bind to port 80 or 443. Instead, a reverse proxy such as :doc:`nginx` or :doc:`apache-httpd` should be used in front of Gunicorn.
xd: Gunicorn no debe ser ejecutado como root porque causaría que el código de su aplicación se ejecute como root, lo cual no es seguro. Sin embargo, esto significa que no será posible enlazar con el puerto 80 o 443. En su lugar, un proxy inverso como :doc:`nginx` o :doc:`apache-httpd` debe ser utilizado delante de Gunicorn.

source: You can bind to all external IPs on a non-privileged port using the ``-b 0.0.0.0`` option. Don't do this when using a reverse proxy setup, otherwise it will be possible to bypass the proxy.
xd: Puedes enlazar con todas las IPs externas en un puerto no privilegiado usando la opción ``b 0.0.0.0``. No hagas esto cuando utilices una configuración de proxy inverso, de lo contrario será posible eludir el proxy.

source: ``0.0.0.0`` is not a valid address to navigate to, you'd use a specific IP address in your browser.
xd: ``0.0.0.0`` no es una dirección válida para navegar, sino que debes utilizar una dirección IP específica en tu navegador.

source: Async with gevent or eventlet
xd: Async con gevent o eventlet

source: The default sync worker is appropriate for many use cases. If you need asynchronous support, Gunicorn provides workers using either `gevent`_ or `eventlet`_. This is not the same as Python's ``async/await``, or the ASGI server spec. You must actually use gevent/eventlet in your own code to see any benefit to using the workers.
xd: El sync worker por defecto es apropiado para muchos casos de uso. Si necesitas soporte asíncrono, Gunicorn proporciona trabajadores usando `gevent`_ o `eventlet`_. Esto no es lo mismo que ``async/await`` de Python, o la especificación del servidor ASGI. Debes usar gevent/eventlet en tu propio código para ver algún beneficio al usar los workers.

source: When using either gevent or eventlet, greenlet>=1.0 is required, otherwise context locals such as ``request`` will not work as expected. When using PyPy, PyPy>=7.3.7 is required.
xd: Cuando se utiliza gevent o eventlet, se requiere greenlet>=1.0, de lo contrario los contextos locales como ``request`` no funcionarán como se espera. Cuando se utiliza PyPy, se requiere PyPy>=7.3.7.

source: To use gevent:
xd: Para utilizar gevent:

source: To use eventlet:
xd: Para utilizar eventlet:
