Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/nginx.po
Languages: xd

source: `nginx`_ is a fast, production level HTTP server. When serving your application with one of the WSGI servers listed in :doc:`index`, it is often good or necessary to put a dedicated HTTP server in front of it. This "reverse proxy" can handle incoming requests, TLS, and other security and performance concerns better than the WSGI server.
xd: `nginx`_ es un servidor HTTP rápido y de nivel de producción. Cuando sirvas tu aplicación con uno de los servidores WSGI listados en :doc:`index`, a menudo es bueno o necesario poner un servidor HTTP dedicado delante de él. Este "proxy inverso" puede manejar las peticiones entrantes, TLS, y otros problemas de seguridad y rendimiento mejor que el servidor WSGI.

source: Nginx can be installed using your system package manager, or a pre-built executable for Windows. Installing and running Nginx itself is outside the scope of this doc. This page outlines the basics of configuring Nginx to proxy your application. Be sure to read its documentation to understand what features are available.
xd: Nginx se puede instalar utilizando el gestor de paquetes de su sistema, o un ejecutable pre-construido para Windows. La instalación y ejecución de Nginx está fuera del alcance de este documento. Esta página describe los fundamentos de la configuración de Nginx para el proxy de su aplicación. Asegúrese de leer su documentación para entender qué características están disponibles.

source: Domain Name
xd: Nombre de dominio

source: Acquiring and configuring a domain name is outside the scope of this doc. In general, you will buy a domain name from a registrar, pay for server space with a hosting provider, and then point your registrar at the hosting provider's name servers.
xd: La adquisición y configuración de un nombre de dominio está fuera del alcance de este documento. En general, usted comprará un nombre de dominio de un registrador, pagará por el espacio del servidor con un proveedor de alojamiento, y luego apuntará su registrador a los servidores de nombres del proveedor de alojamiento.

source: To simulate this, you can also edit your ``hosts`` file, located at ``/etc/hosts`` on Linux. Add a line that associates a name with the local IP.
xd: Para simular esto, también puedes editar tu archivo ``hosts``, ubicado en ``/etc/hosts`` en Linux. Añade una línea que asocie un nombre con la IP local.

source: Modern Linux systems may be configured to treat any domain name that ends with ``.localhost`` like this without adding it to the ``hosts`` file.
xd: Los sistemas Linux modernos pueden estar configurados para tratar cualquier nombre de dominio que termine en ``.localhost`` de esta manera sin añadirlo al archivo ``hosts``.

source: Configuration
xd: Configuración

source: The nginx configuration is located at ``/etc/nginx/nginx.conf`` on Linux. It may be different depending on your operating system. Check the docs and look for ``nginx.conf``.
xd: La configuración de nginx se encuentra en ``/etc/nginx/nginx.conf`` en Linux. Puede ser diferente dependiendo de tu sistema operativo. Consulta la documentación y busca ``nginx.conf``.

source: Remove or comment out any existing ``server`` section. Add a ``server`` section and use the ``proxy_pass`` directive to point to the address the WSGI server is listening on. We'll assume the WSGI server is listening locally at ``http://127.0.0.1:8000``.
xd: Elimina o comenta cualquier sección existente de ``server``. Añade una sección ``server`` y utiliza la directiva ``proxy_pass`` para apuntar a la dirección en la que el servidor WSGI está escuchando. Asumiremos que el servidor WSGI está escuchando localmente en ``http://127.0.0.1:8000``.

source: Then :doc:`proxy_fix` so that your application uses these headers.
xd: Entonces :doc:`proxy_fix` para que su aplicación utilice estas cabeceras.
