Repository: Jalkhov/docspro
Catalog: docs/*/LC_MESSAGES/deploying/uwsgi.po
Languages: es

source: uWSGI is a deployment option on servers like `nginx`_, `lighttpd`_, and `cherokee`_; see :doc:`fastcgi` and :doc:`wsgi-standalone` for other options. To use your WSGI application with uWSGI protocol you will need a uWSGI server first. uWSGI is both a protocol and an application server; the application server can serve uWSGI, FastCGI, and HTTP protocols.
es: uWSGI es una opción de despliegue en servidores como `nginx`_, `lighttpd`_, y `cherokee`_; vea :doc:`fastcgi` y :doc:`wsgi-standalone` para otras opciones. Para utilizar su aplicación WSGI con el protocolo uWSGI necesitará primero un servidor uWSGI. uWSGI es tanto un protocolo como un servidor de aplicaciones; el servidor de aplicaciones puede servir los protocolos uWSGI, FastCGI y HTTP.

source: The most popular uWSGI server is `uwsgi`_, which we will use for this guide. Make sure to have it installed to follow along.
es: El servidor uWSGI más popular es `uwsgi`_, que usaremos para esta guía. Asegúrate de tenerlo instalado para poder seguir adelante.

source: Please make sure in advance that any ``app.run()`` calls you might have in your application file are inside an ``if __name__ == '__main__':`` block or moved to a separate file. Just make sure it's not called because this will always start a local WSGI server which we do not want if we deploy that application to uWSGI.
es: Por favor, asegúrate de antemano de que cualquier llamada a ``app.run()`` que puedas tener en tu archivo de aplicación esté dentro de un bloque ``if __name__ == '__main__':`` o movido a un archivo separado. Asegúrate de que no se llama porque esto siempre iniciará un servidor WSGI local que no queremos si desplegamos esa aplicación en uWSGI.

source: Starting your app with uwsgi
es: Cómo iniciar su aplicación con uwsgi

source: `uwsgi` is designed to operate on WSGI callables found in python modules.
es: `uwsgi` está diseñado para operar con las llamadas WSGI que se encuentran en los módulos de python.

source: Given a flask application in myapp.py, use the following command:
es: Dada una aplicación flask en miapp.py, utilice el siguiente comando:

source: The ``--manage-script-name`` will move the handling of ``SCRIPT_NAME`` to uwsgi, since it is smarter about that. It is used together with the ``--mount`` directive which will make requests to ``/yourapplication`` be directed to ``myapp:app``. If your application is accessible at root level, you can use a single ``/`` instead of ``/yourapplication``. ``myapp`` refers to the name of the file of your flask application (without extension) or the module which provides ``app``. ``app`` is the callable inside of your application (usually the line reads ``app = Flask(__name__)``.
es: La directiva ``--manage-script-name`` moverá el manejo de ``SCRIPT_NAME`` a uwsgi, ya que es más inteligente al respecto. Se utiliza junto con la directiva ``--mount`` que hará que las peticiones a ``/tuaplicacion`` sean dirigidas a ``miapp:app``. Si tu aplicación es accesible a nivel de raíz, puedes utilizar un único ``/`` en lugar de ``/tuaplicacion``. ``miapp`` se refiere al nombre del archivo de tu aplicación flask (sin extensión) o al módulo que proporciona ``app``. ``app`` es el callable dentro de tu aplicación (normalmente la línea dice ``app = Flask(__name__)``.

source: If you want to deploy your flask application inside of a virtual environment, you need to also add ``--virtualenv /path/to/virtual/environment``. You might also need to add ``--plugin python`` or ``--plugin python3`` depending on which python version you use for your project.
es: Si quieres desplegar tu aplicación flask dentro de un entorno virtual, necesitas añadir también ``--virtualenv /ruta/al/entorno/virtual``. También puedes necesitar añadir ``--plugin python`` o ``--plugin python3`` dependiendo de la versión de python que utilices para tu proyecto.

source: A basic flask nginx configuration looks like this::
es: Una configuración básica de flask nginx tiene el siguiente aspecto::

source: This configuration binds the application to ``/yourapplication``. If you want to have it in the URL root its a bit simpler::
es: Esta configuración vincula la aplicación a ``/tuaplicacion``. Si quieres tenerlo en la raíz de la URL es un poco más sencillo::
